{"meta":{"title":"Eternal digital memory - 永恒的数字记忆","subtitle":"Digital Evergarden - 数字永恒花园 | ZeroSimple的博客","description":"Save digital memory forever 永远保存数字记忆。这里有Android生态的小杂谈，这里有我关于互联网的小笔记，折腾不止；当然也有ACG。","author":"ZeroSimple","url":"https://www.hee.ink","root":"/"},"pages":[{"title":"About","date":"2019-08-31T13:31:49.000Z","updated":"2020-08-29T17:18:24.403Z","comments":true,"path":"about/index.html","permalink":"https://www.hee.ink/about/index.html","excerpt":"","text":"Emmmmm… 其实我也还没想好这里写什么，就先空着吧。 站点历史远古时期 2016年6月17日，博客上线，发布自己维护的魔法小道具。这种魔法道具早已成为历史，不再可用 2018年2月24日，迁移到域名Geekside.org 2018年某日，服务器迁移到Vultr 东京机房 服务器迁移到Vultr 新加坡机房 近现代 2019年4月15日，域名迁移到www.hee.ink 2019年8月31日，改用GitHub Pages部署，将WordPress换成了Hexo 某日兴趣使然加上了一只Live2D的猫（现在已经去掉了，太影响性能） 当代 2020年2月11日，下载站d.hee.ink 上线 2020年6月，启用hee.ink 裸域名访问（终于解决了CNAME记录和MX记录冲突的问题。之前没看GitHub Pages的官方文档，直接把DNS解析到github.io了，事实上通过A记录解析到GP服务器上就能解决了。V2EX上看到的解决方法） 2020年7月，下载站前端从GitHub Pages（米利坚服务器）迁移到韩国Oracle小鸡，OD数据中心也换成亚太地区的，域名更变为dl.hee.ink 2020年8月21日，将Hexo版本升级到5.0.2，结果带来了一堆Bug 2020年8月29日，在Oracle首尔机房的小鸡上部署了反向代理，优化中国内地的访问速度。裸连终于不卡了 站点统计本站于 上线，建站已 天"},{"title":"categories","date":"2020-01-01T07:07:04.000Z","updated":"2020-01-01T07:07:04.992Z","comments":true,"path":"categories/index.html","permalink":"https://www.hee.ink/categories/index.html","excerpt":"","text":""},{"title":"friends","date":"2020-01-01T07:07:01.000Z","updated":"2020-01-01T07:07:01.743Z","comments":true,"path":"friends/index.html","permalink":"https://www.hee.ink/friends/index.html","excerpt":"","text":""},{"title":"tags","date":"2020-01-01T07:06:58.000Z","updated":"2020-01-01T07:06:58.655Z","comments":true,"path":"tags/index.html","permalink":"https://www.hee.ink/tags/index.html","excerpt":"","text":""},{"title":"营销号生成器声明","date":"2020-05-02T03:34:53.000Z","updated":"2020-05-02T03:47:11.321Z","comments":true,"path":"yxh/index.html","permalink":"https://www.hee.ink/yxh/index.html","excerpt":"","text":"本项目使用反996许可证发布本项目仅供娱乐，请勿滥用。本项目的本意是抨击营销号，严禁拿来真的写营销号文章。本项目基于狗屁不通生成器，感谢原作者suulnnka和menzi11。 免责声明在使用本作品前，请您务必仔细阅读并透彻理解本声明。您可以选择不使用本作品，但如果您使用本作品，您的使用行为将被视为对本声明全部内容的认可。本作品产生的文章由用户输入内容结合随机信息生成，版权人不保障生成文章的安全性、正确性、及时性、合法性，用户在使用过程中的风险由用户自行承担，版权人对用户使用本作品产生的内容其概不负责，亦不承担任何法律责任。任何本作品生成的链接地址均系第三方或用户生成，版权人对链接本身及由链接产生的内容概不负责，亦不承担任何法律责任。本作品产生的文章均由浏览器产生，无服务器端服务且无存储，版权人不对由用户产生的侵权行为负责，亦不承担任何法律责任。本作品不对用户使用过程中使用的任何第三方产品负责，亦不承担任何法律责任。本作品不对任何本作品使用的第三方服务负责，亦不承担任何法律责任。本作品不对任何基于本作品的衍生品负责，亦不承担任何法律责任。 许可证版权所有（c）2020 ZeroSimple, meng ke, suulnnka 反996许可证版本1.0 在符合下列条件的情况下，特此免费向任何得到本授权作品的副本（包括源代码、文件和/或相关内容，以下统称为“授权作品”）的个人和法人实体授权：被授权个人或法人实体有权以任何目的处置授权作品，包括但不限于使用、复制，修改，衍生利用、散布，发布和再许可： 个人或法人实体必须在许可作品的每个再散布或衍生副本上包含以上版权声明和本许可证，不得自行修改。 个人或法人实体必须严格遵守与个人实际所在地或个人出生地或归化地、或法人实体注册地或经营地（以较严格者为准）的司法管辖区所有适用的与劳动和就业相关法律、法规、规则和标准。如果该司法管辖区没有此类法律、法规、规章和标准或其法律、法规、规章和标准不可执行，则个人或法人实体必须遵守国际劳工标准的核心公约。 个人或法人不得以任何方式诱导、暗示或强迫其全职或兼职员工或其独立承包人以口头或书面形式同意直接或间接限制、削弱或放弃其所拥有的，受相关与劳动和就业有关的法律、法规、规则和标准保护的权利或补救措施，无论该等书面或口头协议是否被该司法管辖区的法律所承认，该等个人或法人实体也不得以任何方法限制其雇员或独立承包人向版权持有人或监督许可证合规情况的有关当局报告或投诉上述违反许可证的行为的权利。 该授权作品是”按原样”提供，不做任何明示或暗示的保证，包括但不限于对适销性、特定用途适用性和非侵权性的保证。在任何情况下，无论是在合同诉讼、侵权诉讼或其他诉讼中，版权持有人均不承担因本软件或本软件的使用或其他交易而产生、引起或与之相关的任何索赔、损害或其他责任。"}],"posts":[{"title":"【翻译】吴志丽在2019年约翰·W·坎贝尔最佳新作家奖颁奖式上的演讲","slug":"【翻译】吴志丽在2019年约翰·W·坎贝尔最佳新作家奖颁奖式上的演讲","date":"2020-08-05T03:29:09.000Z","updated":"2020-08-05T03:56:39.041Z","comments":true,"path":"2020/08/05/【翻译】吴志丽在2019年约翰·W·坎贝尔最佳新作家奖颁奖式上的演讲/","link":"","permalink":"https://www.hee.ink/2020/08/05/%E3%80%90%E7%BF%BB%E8%AF%91%E3%80%91%E5%90%B4%E5%BF%97%E4%B8%BD%E5%9C%A82019%E5%B9%B4%E7%BA%A6%E7%BF%B0%C2%B7W%C2%B7%E5%9D%8E%E8%B4%9D%E5%B0%94%E6%9C%80%E4%BD%B3%E6%96%B0%E4%BD%9C%E5%AE%B6%E5%A5%96%E9%A2%81%E5%A5%96%E5%BC%8F%E4%B8%8A%E7%9A%84%E6%BC%94%E8%AE%B2/","excerpt":"","text":"吴志丽（英语：Jeannette Ng），香港科幻作家，现居英国，为小说《摇摆的太阳之下》的作者。吴志丽获颁2019年约翰·W·坎贝尔最佳新作家奖和2020年雨果奖最佳相关作品奖等奖项。 ——以上资料来自维基百科 此演讲获2020年雨果奖最佳相关作品奖。这并没有在墙内激起多大风波，毕竟墙内基本没报道这件事儿~ 不过这个演讲能得雨果奖，我感觉成都申幻基本是没戏了，国际环境比较糟糕——有谁愿意在一个”autocratic empire”举办大会呢。╮(╯-╰)╭ 以下是我，一名学渣高中生的翻译，可能有错误，还请各位大佬指出。 翻译约翰·W·坎贝尔，冠名这个奖项的人，是个法西斯分子。他通过编辑控制《惊奇故事（吴女士的演讲原文为Amazing Stories，她记错名字了，下文有更正）》，为科幻小说定下的基调使（科幻）流派困扰到今天。缺乏想象力。男权。白皮。他有着野心崇尚帝国主义和开拓者、殖民者和工业家。是的，我知道凡事有例外。但是这些争议点，让我们成长为精彩的、却又摇摇欲坠的流派，比你所想象的或允许的更加狂野和陌生些。我也以自己是他们的一份子为傲。与你分享我奇异的小故事，所有我不寻常兴趣的混合体，很多东西与我表面的身份和标签没有什么关系。但正如玛格丽特·卡文迪什所说的那样，我是一名思想和文字的传播者。所以我需要说，我生于香港。现在，在这个全球最赛博朋克的都市，抗争者们正与一个独裁帝国的蒙面、匿名风暴部队搏斗。他们刚刚举行了历史上最大规模的非法集会。在我们演说的时候，他们呼吁在我们这个时代进行一场时代革命。尽管希望渺茫，他们仍举起激光笔，指向天空，尝试不顾一切地燃点星光。我不禁为他们感到自豪、为他们流泪，为他们的痛苦感到惋惜。我很抱歉把这些事拖进我们的奇幻文字里，毕竟大家给了我一个麦克风，我觉得有必要说说这些事。 勘误：《惊奇故事》更正为《惊骇科幻小说》。这错误非常严重。我承认我在雨果奖的观众席上，因为没有准备好（演讲稿子）而被人瞪了一眼，然后在手机上写下了这些话。老实说，我没想到会得到奖。 原文John W. Campbell, for whom this award was named, was a fascist. Through his editorial control of Astounding Science Fiction, he is responsible for setting a tone of science fiction that still haunts the genre to this day. Sterile. Male. White. Exalting in the ambitions of imperialists and colonisers, settlers and industrialists. Yes, I am aware there are exceptions. But these bones, we have grown wonderful, ramshackle genre, wilder and stranger than his mind could imagine or allow. And I am so proud to be part of this. To share with you my weird little story, an amalgam of all my weird interests, so much of which has little to do with my superficial identities and labels. But I am a spinner of ideas, of words, as Margaret Cavendish would put it. So I need say, I was born in Hong Kong. Right now, in the most cyberpunk in the city in the world, protesters struggle with the masked, anonymous stormtroopers of an autocratic Empire. They have literally just held her largest illegal gathering in their history. As we speak they are calling for a horological revolution in our time. They have held laser pointers to the skies and tried to to impossibly set alight the stars. I cannot help be proud of them, to cry for them, and to lament their pain. I’m sorry to drag this into our fantastical words, you’ve given me a microphone and this is what I felt needed saying. Correction: Amazing Stories changed to Astounding Science Fiction. Error is very much mine. I confess I wrote this on my phone literally in the audience of the Hugo’s after being glared at for not being prepared. I was honestly not expecting to win. 原文传送门 s 视频另外，前两天吴女士还在YouTube传了一个视频（英语），我就放在这里了~ 最后还用粤语喊了一句“光復香港，時代革命”。 your browser does not support the video tag 视频原地址传送门","categories":[],"tags":[]},{"title":"【已失效】现阶段PanDownload的最佳替代工具baidupcs-web","slug":"现阶段PanDownload的最佳替代工具baidupcs-web","date":"2020-04-17T07:52:28.000Z","updated":"2020-08-19T02:26:16.677Z","comments":true,"path":"2020/04/17/现阶段PanDownload的最佳替代工具baidupcs-web/","link":"","permalink":"https://www.hee.ink/2020/04/17/%E7%8E%B0%E9%98%B6%E6%AE%B5PanDownload%E7%9A%84%E6%9C%80%E4%BD%B3%E6%9B%BF%E4%BB%A3%E5%B7%A5%E5%85%B7baidupcs-web/","excerpt":"","text":"原仓库：https://github.com/Erope/baidupcs-web Fork后自行到Release页下载自己合适的版本即可。 总所周知的原因，PanDownload 的作者被抓了。Android 版本的其实是第三方维护的（作者似乎是个高中生），这次被抓的是原版作者，Android 的维护者已经在酷安报平安了。 先上效果图： 百度是针对账号进行限速，当一个非会员账号下载量达到一定阈值就会触发限速。账号被限速之后容易出现下载错误、掉连接数等问题，需要过几天或者开通会员才会恢复。 经过我的实际测试，下载后期会出现间歇性的0Kb/s ，需要耐心等待。不过前期速度挺快的，大约有3M/s. Windows 版本的话直接运行EXE就行，会自动跳转到Localhost页面。如果没有跳转，请在浏览器地址栏输入：http://localhost:5299/ Tip：请务必解压后使用，不要在压缩包里直接运行，不然会导致下载的文件丢失！ macOS & Linux 用户需要设置权限后使用： 先cd到文件目录，然后 12chmod a+x BaiduPCS-Go./BaiduPCS-Go 浏览器输入：localhost:5299 Enjoy it! 另外，据这个Fix版的作者说，arm版本似乎用不了。 鸣谢 @iikira 的BaiduPCS-Go @liuzhuoling2011 的baidupcs-web @Erope 的baidupcs-web Fix版本 其他贡献者 希望PanDownload 的作者平安。","categories":[],"tags":[{"name":"教程","slug":"教程","permalink":"https://www.hee.ink/tags/%E6%95%99%E7%A8%8B/"}]},{"title":"我最爱的专辑：Pure -AQUAPLUS LEGEND OF ACOUSTICS-","slug":"Pure-AQUAPLUS-LEGEND-OF-ACOUSTICS-信息全整理","date":"2020-03-29T06:53:00.000Z","updated":"2020-08-20T17:40:20.504Z","comments":true,"path":"2020/03/29/Pure-AQUAPLUS-LEGEND-OF-ACOUSTICS-信息全整理/","link":"","permalink":"https://www.hee.ink/2020/03/29/Pure-AQUAPLUS-LEGEND-OF-ACOUSTICS-%E4%BF%A1%E6%81%AF%E5%85%A8%E6%95%B4%E7%90%86/","excerpt":"","text":"这张专是我最喜欢的ACG精选集，没有之一。 大概是前三年，我在朋友的安利下玩了白色相簿2，对其中的歌曲印象非常深刻，其中印象最深的是WA1的Powder Snow. Powder Snow 被许多人翻唱过，我一首一首的听，听到Pure 这个版本的时候整个人都僵住了，现在回想起来甚至不知道如何形容当时的那种感觉。至此，我遇到了我最爱的这张专辑。 作为叶子社的精选OST集，有富二代下川直哉大佬的支持，可以说是开创了ACG高保真录音的先河，采用DSD录制，5.1ch。去年我终于购入了这张2007年发售的CD，现在的话日亚价格在3, 000円左右，作为SACD算是不贵的价格了。我买到的这张是2008年的再版，另外听说前两年出了黑胶版，有钱的大佬可以去收一张收藏。 说句实在话，比起Key社的音乐，我还是更喜欢叶子社的音乐。这种专辑元素花园+ Suara 的组合实在太赞了。 这张专辑包括了《传颂之物》《白色相簿》《锁》和To Heart 的音乐，现特地整理了专辑内附的Staff的话和一些信息，然后手打了歌词本内的官方歌词，也包括了官方的振假名标注。 图是用手机拍的，不是很高质量，大家将就着看吧，我已经尽量修了。 前前后后整理了三个星期……这张专辑本身就挺老的（2007年的），收录的乐曲更是老（有些是90年代的歌曲），年代比较久远，资料也不太好找，欢迎大家补充。这么说吧，这张专辑可以说是1990s~2000s日本Galgame 黄金时期的高品质音乐代表。 关于SACD的介绍可以参看下图： Staff & Instruments 我的乐理知识无限接近零，以下的内容都是查资料得出的（大多都是摘录、翻译或整理自维基百科），若有错误，敬请各位大佬指出。 本专辑使用的乐器：在下一小节“收录乐曲”中会注明使用的乐器和演奏者，乐器名使用英语或日语。在这里先列出乐器的中英/日语对照和罕见乐器的简单介绍。 Acoustic Bass: 原声低音吉他Acoustic Guitar: 原声吉他Cello: 低音提琴Electric Bass: 插电低音吉他Flute: 长笛Gut Guitar: 羊肠弦吉他事实上Gut Guitar属于Acoustic Guitar，但是在Staff表单独列出了，所以我也单独列出吧~ 肠弦吉他是用羊的肠子作弦的吉他，一种比较古老的门类。 摘录自中文维基百科条目：羊肠弦 羊肠弦的特色是手感张力柔和，可以发出最丰富的音色，音质也有深邃的内涵，温暖及多层次的色彩极为接近人声，暂时未有其他弦可取代其幽美的音色。 在现代，除了对羊肠弦的音色有特别执著的演奏家外，大都采用合金线包合成纤维的弦。 Mandolin: 曼陀林 曼陀铃，拨弦乐器，由欧洲意大利文艺复兴时期的琵琶家族鲁特琴演变而来，一般有钢弦四对，按小提琴音高定音，用拨子弹奏。 Percussion: 打击乐器Piano: 钢琴Quatro(Cuatro ): 瓜特罗琴 （配图是Venezuelan Concert Cuatro，不得不说看着真像古典吉他，虽然少了两根弦） 又是一个我没听过 & 中文互联网上搜不到结果的乐器了……译名同样采用台湾教育研究院的译名。 那么接下来又是翻译英文维基百科的内容了： 瓜特罗琴（英语：Cuatro 或Quatro，日语：クアトロ）是拉丁美洲弦乐器家族中的一员，发迹于中美洲、南美洲，波多黎各和西印度群岛地区，源于西班牙吉他（古典吉他）。虽然部分瓜特罗琴长得像中提琴，但大多数瓜特罗琴在音色上更像一个小些尺寸的古典吉他。 Quena: 克纳笛 克纳笛是安第斯山脉地区的传统乐器，全长35〜40厘米。克纳笛常用于传统安第斯音乐。依照出土文物，克纳笛是用芦苇（有时则用了动物骨头）制作的。传统工艺上，它是用甘蔗或木头制成的，有6个手指孔和1个拇指孔。该乐器两端都敞开，或者底部是半封闭的。近年来，教学中使用的克纳笛通常是用塑料制作的，在日本，很多人用川竹（学名：Pleioblastus simonii，为禾本科大明竹属下的一个种）自行制作克纳笛。 克纳笛于20世纪70年代由阿根廷传入日本。 我在中文互联网上几乎找不到资料，所以翻译整理了一下英文维基百科（Quena）和日文维基百科（ケーナ）的内容。由于找不到内地的官方译名，遂采用台湾教育研究院的译名“克纳笛”。 不得不说，这张专真的豪华啊……又是一个我没见过的乐器…… SopraninoStrings: 弦乐Viola: 中提琴Violin: 小提琴二胡琴：琴 （图源：武藏野音乐大学，若侵权请联系我删除） 值得注意的是，此处说的“琴”为日语中的琴，和中文语境的琴不一致。 以下内容翻译自日语维基百科： 琴（きん、こと）是日本的传统乐器。在日本被称为“琴（こと）”的乐器包括： 琴（きん） 箏（そう） 和琴 （わごと） 一絃琴 (須磨琴) 二絃琴 (八雲琴) 这张专辑使用的应该是和琴( •̀ ω •́ )✧（如果我弄错了，麻烦大佬在评论区指出）。 以下是和琴的中文维基百科介绍： 和琴（日语：和琴／わごん）亦称大和琴（やまとごと）、东琴（あずまごと），是日本雅乐所用的传统六弦弦乐器，是日本最古老的乐器。按照形制可以分为板作、槽作和棒作琴。 和琴主要用于宫中祭祀时的国风歌舞，例如神乐歌、久米歌、东游等乐曲中。通常由地位比较高的人演奏。 琴身一般使用桐制作，中间挖空作成音箱。柱由枫制成。长约190厘米、横宽约16厘米、尾约24厘米。 六根琴弦使用丝制作。其琴弦的顺序与古琴、日本筝都不同，距离演奏者最近的一根弦是一弦，以此类推。 篠笛 (しのぶえ) ：篠笛 (xiǎo dí) 篠笛（ しのぶえ）是日本的一种传统木管乐器，由川竹（又称苦竹、篠竹）制成，上开有吹口和指孔，内面涂有漆与合成树脂。日本传统艺能中常略称为笛或称为竹笛。 收录乐曲運命 -SADAME- 作曲：豆田将、編曲：上松範康 原曲はPCゲームソフト『うたわれるもの』挿入歌。 Strings: 篠崎正嗣ストリングスQuena: 旭孝Acoustic & Gut Guitar: 小倉博和Electric Bass: 須長和広 这是《受赞颂者》（うたわれるもの。话说为啥会被误翻译成“传颂之物”啊，明明是“受赞颂者”）中的插曲，按照设定是艾露露家族的祖传安眠曲。这个编曲版本和原曲区别很大，且为纯音乐版本。 歌词 静かに訪れる 色なき世界すべての時を止め 眠りにつく 悲しみ喜びを 集めて人は流れし時の中 安らぎ見る 生まれ生き消えてゆく 人の運命の中誰もみな空の星に 微かな願い託す 密かに輝ける 満天の星地平の彼方へと 流れ消える 色づき始めた 大地の上を無情な時だけが 吹き抜けてく 風に揺る绿の先 明日へと続いて新しき時の中 笑顔の花を咲かす 生まれ生き消えてゆく 人の運命の中誰もみな空の星に 微かな願い託す 静かに訪れる まばゆき世界すべての時を生み 咲き乱れる 收录专辑 『永久に』（元田惠美） 『うたわれるものオリジナルゲームサントラ』（元田惠美） 『「うたわれるもの-散りゆく者への子守唄」オリジナルサウンドトラック』（柚木凉香） 『「うたわれるもの 偽りの仮面」ゲーム&TVアニメ オリジナルサウンドトラック』（种田梨沙） 『AQUA PLUS VOCAL COLLECTION VOL.2』（元田惠美） 『AQUA PLUS VOCAL COLLECTION VOL.6』（柚木凉香） 『「うたわれるもの」うたもの绘卷』（大原沙耶香 & 田中敦子） 『うたわれるもの 二人の白皇 ADDITIONAL SOUNDTRACK』（柚木凉香 & 种田梨沙） 『Pure -AQUAPLUS LEGEND OF ACOUSTICS- 』（纯音乐） 试听原唱： Heart To Heart 作曲：中上和英、編曲：藤田淳平 原曲はPS2ソフト『ToHeart2』オープニングテーマ。 Strings: 篠崎正嗣カルテット 1st Violin: 篠崎正嗣 2nd Violin: 斎藤真知亜 Viola: 成瀬かおり Cello: 堀沢真己 Gut Guitar: 田代耕一郎 原唱收录于2005年发售的Heart To Heart ，是叶子社2004年发售的游戏ToHeart2片头曲，Leaf社御用歌姬中山愛梨紗演唱，曲风欢快愉悦。本专辑版本为纯音乐版。 （PS：ToHeart2的音乐都很赞，可以去听听OST） 歌词 ずっと ずっと 憧れている奇跡が はじまる I want to believe that a wish come true. キラキラ木漏れ日の やさしい光うけて新しい季節 この道からはじまる花びらに誘われ 振り向いた瞬間まぶしい笑顔 あなたを見つけた Hum こんなに近くにいても 渡せないものがあるの 空にひとつ 流れゆく星青空が見せてくれた奇跡 きっと Heart to heart 叶えてくれる眼を閉じ 三回 願い事繰り返す そろえた前髪を やさしくなでる風勇気持てない背中を 押してくれた あの笑顔見つけて おはようって言ったらわたしと同時に おはようをくれた Hum 全ての眼に写るもの エールくれた そんな気がするきっと きっと 気づいて欲しいいろんなところに 奇跡はあるずっと Heart to heart あこがれているこれからも 強く I want to believe that a wish come true. Hum こんなに近くにいても 渡せないものがあるの 空にひとつ 流れゆく星青空が見せてくれた奇跡 きっと Heart to heart 叶えてくれる眼を閉じ 三回 願い事繰り返す 吐槽一句，这一首歌的英语发音太标准了o(￣┰￣*)ゞ 收录专辑 『Heart To Heart 』（2005） 『Pure -AQUAPLUS LEGEND OF ACOUSTICS- 』（2007，纯音乐） 『ToHeart 2 コンプリートサウンドトラック』 （2011） 试听原唱： それぞれの未来へ 作曲：下川直哉、編曲：藤間仁 原曲はPSソフト『ToHeart』エンディングテーマ。 Flute: 旭孝 Gut Guitar & Quena: 田代耕一郎 Electric Bass: 須長和広 Piano: 美野春樹 首次收录于2000年发售的LEAF VOCAL COLLECTION vol.1 事实上最早收录于1999年的Feeling Heart，游戏ToHeart（初代）的片尾曲，中司雅美演唱。 这张OST的官方介绍是这样的： 18禁のゲームソフト・メーカー、Leafが生んだ『ToHeart』『WHITE ALBUM』『こみっくパーティー』の3作からヴォーカル曲を集めたベスト。19のフル・コーラス版,4のヴォーカル・アレンジ版を初収録。どの歌も至って健康的なのでご心配なく。 最后一句话笑喷了~ 歌词 桜の花が咲きみだれ 大きめの制服をきてはなびらの舞う校庭を バックにして記念写真とったね 机にかいたらくがきも やさしくひびくチャイムもたそがれどきの教室も みんなみんなセピア色の思い出 あかくそまる校舎みつめて いつか大人にかわっても子供のように時をわすれて おもいきりはしゃぎたい どんなときも元気になれる 場所が必ずあるからどこにいてもわすれないで 前に歩いてゆこう 日焼けした肌みせあって いつも負けた夏休み秋、冬過ぎて春がきて クラス替えが悲しくて涙した 今思えば楽しい日々が フルスピードで過ぎてゆきそしていつか大人にかわる そんな事に気が付かない どんな時も勇気をくれる 人が必ずいるからどこにいてもわすれないで 前に進んでゆこう どんなときも元気になれる 場所が必ずあるからどこにいてもわすれないで 前に歩いてゆこう 收录专辑 Feeling Heart (1999) Leaf Vocal Collection, Volume 1 (2000) Leaf Piano Collection VOL.1 (2002) To Heart Remember my memories サウンドトラック&イメージソング (2004) AQUA PLUS VOCAL COLLECTION Vol.1 (2006) Pure -AQUAPLUS LEGEND OF ACOUSTICS- (2007) 试听原唱： 夢想歌 作詞：須谷尚子、作曲：衣笠道雄、編曲：上松範康 原曲はテレビアニメ『うたわれるもの』オープニングテーマ。2012年発売のSuaraベストアルバム「The Best〜タイアップコレクション〜」Special Discにも収録された。 琴：川村昌子 篠笛：旭孝 Piano: 美野春樹 Acoustic Bass: 須長和広 Percussion: 三沢またろう 这首歌的歌词真的很积极向上~ 然而这张专辑的编曲版本笛声悠扬婉转，却有一丝忧伤的感觉。总感觉这张专辑中的版本才传达代表了艾露露的梦想，对亲情的渴望，传达了那种美好却又遥不可及的忧伤情思。 歌词 子供の頃の夢は 色褪せない落書きで思うまま書き滑らせて 描く未来へとつながる 澄み渡る空 果てしないほど青く無邪気な心に 充たされ魅かれてく やがて自由に飛びまわれる 翼を手に入れて無垢な瞳は求めてく 空の向こうへ 行きたいな 止め処ない願いから 一つだけ叶うのなら誰にも譲りたくはない 夢を掴みたいと思うよ 子供の頃の夢は 色褪せない落書きでいつまでも描き続けられた 願う未来へとつながる 鐘が鳴る音 遠くから聞こえてくる素直な心に 届いては響いてる 光りは 七色に変わって 弧を描いてゆく無垢な瞳は求めてく 虹の向こうへ 行きたいな 止め処なく願うほど 忘れないでいたいこと支えてくれる人がいて 夢を見ることができるから 子供の頃の夢は 色褪せない落書きで思うまま書き滑らせて 描く未来へとつながる やがて自由に飛びまわれる 翼を手に入れて無垢な瞳は求めてく 空の向こうへ 行きたいな 止め処ない願いから 一つだけ叶うのなら誰にも譲りたくはない 夢を掴みたいと思うよ 止め処なく願うほど 忘れないでいたいこと支えてくれる人がいて 夢を見ることができるから 子供の頃の夢は 色褪せない落書きで思うまま書き滑らせて 描く未来へとつながる 收录专辑 『夢想歌』(2006) 『夢路』(2006) 『TVアニメ「うたわれるもの」音楽集』(2006) Pure -AQUAPLUS LEGEND OF ACOUSTICS- (2007，上松范康编曲) The Best〜タイアップコレクション〜 (2012，与本专辑编曲一致) 『「うたわれるもの 偽りの仮面＆二人の白皇」歌集』（2016新编曲版） 试听原唱（似乎被TX独家了，可能没法完整播放）： 永久に 作曲：松岡純也、編曲：上松範康 原曲はPCゲームソフト『うたわれるもの』エンディングテーマ。 二胡：賈鵬芳 Cello: 上森祥平 Chorus: 広谷順子 Piano: 美野春樹 Percussion: 三沢またろう PS: 这一首似乎有一个钉宫翻唱版，收录在「うたわれるもの」うたもの絵巻 这一张专里，喜欢「バカ変態うるさい！」的可以去听听~ (￣︶￣*)) 歌词 いとし君よ 土になれ 我は雲になろう念いとけし雨 そなたに満たそう いとし君よ 花になれ 我は太陽になろう振り向かせし顔貌を 我に見せ隠さん 永久に流るる滴かな薄紅の頬落ちて 光閉ざし影 永久に眠るる契りかな青白き人 傍に寄りて慰むる いとし君よ 海になれ 我は風になろう穏やかにときに激しく寄せ返さん 永久に叶わぬ 祈りかな星屑の小舟にのせて 天に還す 永久に帰らぬ 過ぎし日よ漆黒の髪梳いて 此処に眠らんと 永久の別れに 袖振りて霞逝く様 瞼閉ざし残らんと 收录专辑『永久に』(2002)『うたわれるもの オリジナルゲームサントラ』(2002)『夢路』(2006)『「うたわれるもの 偽りの仮面＆二人の白皇 歌集」』(2016) 试听原唱： POWDER SNOW 作詞：須谷尚子、作曲：下川直哉、編曲：藤田淳平 原曲はPCゲームソフト『WHITE ALBUM』エンディングテーマ。原曲のボーカルはAKKOである。なお、Suaraは2010年6月24日発売のPS3ソフト『WHITE ALBUM -綴られる冬の想い出-』のエンディングテーマとして、本アルバム収録のものとは別バージョンの「POWDER SNOW」を歌っている。2010年7月21日発売の「WHITE ALBUM －綴られる冬の想い出－ ORIGINAL SOUNDTRACK」と2012年発売のSuaraベストアルバム「The Best〜タイアップコレクション〜」Special Discにも収録された。 Cello: 上森祥平 Acoustic Guitar: 小倉博和 Piano: 美野春樹 这可是一首名曲，也是我整张专辑中最爱的一首。 （这一首歌的很多版本都被QQ音乐独占，还要付费） 有着众多的改编版本（来自萌百的整理）： Powder Snow —— 演唱：AKKO 白色相簿游戏原版的片尾曲版本，也是歌曲的最初版本，由AKKO演唱。 POWDER SNOW —— 演唱：绪方理奈（CV：水树奈奈） 白色相簿动画角色歌版本，由水树奈奈演唱。 POWDER SNOW（Live Ver.） —— 演唱：森川由绮（CV：平野绫） & 绪方理奈（CV：水树奈奈） 白色相簿动画最终话前半插曲版本。 POWDER SNOW (YUKI & RINA Ver.) —— 演唱：森川由绮（CV：平野绫） & 绪方理奈（CV：水树奈奈） 白色相簿动画最终话结尾插曲版本。 POWDER SNOW —— 演唱：Suara 白色相簿游戏重制版的片尾曲版本，Leaf御用歌姬Suara的演唱版本 POWDER SNOW (PURE Ver.) —— 演唱：Suara Leaf社精选集《Pure-AQUAPLUS LEGEND OF ACOUSTICS-》中收录的，后又在白色相簿游戏重制版的OST中收录。 POWDER SNOW PIANO 2010 —— 演唱：无 白色相簿2游戏IC章节中钢琴编曲版本。 POWDER SNOW PIANO～kazusa～ —— 演唱：无 白色相簿2游戏IC章节中钢琴编曲版本，其二。 POWDER SNOW Guitar solo —— 演唱：无 白色相簿2游戏IC章节中吉他solo编曲版本。 POWDER SNOW（弾き語り） —— 演唱：小木曾雪菜（CV：米泽圆） 白色相簿2游戏coda(最终章)冬马TE结局后日谈，由小木曾雪菜弹唱的版本胃痛神曲 POWDER SNOW —— 演唱：无 白色相簿2动画CD《Kazusa Classic Piano Pieces》收录曲钢琴版本，由松本あすか演奏。 POWDER SNOW —— 演唱：冬马和纱（CV：生天目仁美），收录于冬马和纱的专辑《WHITE ALBUM2 ORIGINAL SOUNDTRACK～kazusa～》中。 歌词 粉雪が空から 優しく降りてくる手のひらで受け止めた 雪が切ないどこかで見てますか あなたは立ち止まり思い出していますか 空を見上げながら うれしそうに雪の上を歩くあなたが私には本当に いとおしく見えた 今でも覚えている あの日見た雪の白さ初めて触れた唇の温もりも忘れないI still love you. 粉雪が私に いくつも降りかかる暖かいあなたの 優しさに似ている 楽しそうに話しをしてくれたあなたが私には心から恋しく思えた 今でも夢を見るの あの日見た白い世界あの時触れた指先の冷たさも忘れないI still love you. 今でも覚えている あの日見た雪の白さ初めて触れた唇の温もりも忘れない 粉雪のようなあなたは 汚れなく綺麗で私もなりたいと雪に願う I still love you. 试听原唱（AKKO版，1998年WA游戏中收录）： 理奈&由琦 アニメLive版（这个版本也非常推荐，前奏是恋色空）： 本版本（被TX独占只能试听40秒）： 最期の誓い： 本版本： 本版本：","categories":[],"tags":[{"name":"ACG","slug":"ACG","permalink":"https://www.hee.ink/tags/ACG/"}]},{"title":"解决国行手机Google Play商店报错DF-DFERH-01","slug":"解决国行手机Google-Play商店报错DF-DFERH-01","date":"2020-03-24T10:52:22.000Z","updated":"2020-03-29T06:53:32.180Z","comments":true,"path":"2020/03/24/解决国行手机Google-Play商店报错DF-DFERH-01/","link":"","permalink":"https://www.hee.ink/2020/03/24/%E8%A7%A3%E5%86%B3%E5%9B%BD%E8%A1%8C%E6%89%8B%E6%9C%BAGoogle-Play%E5%95%86%E5%BA%97%E6%8A%A5%E9%94%99DF-DFERH-01/","excerpt":"","text":"在路由器或者手机的的代理设置中把googleapis.cn加入强制走代理的黑名单就行。","categories":[],"tags":[{"name":"教程","slug":"教程","permalink":"https://www.hee.ink/tags/%E6%95%99%E7%A8%8B/"}]},{"title":"Nginx本地反向代理傻瓜教程","slug":"Nginx本地反向代理傻瓜教程","date":"2020-03-06T11:32:55.000Z","updated":"2020-06-13T16:08:09.510Z","comments":true,"path":"2020/03/06/Nginx本地反向代理傻瓜教程/","link":"","permalink":"https://www.hee.ink/2020/03/06/Nginx%E6%9C%AC%E5%9C%B0%E5%8F%8D%E5%90%91%E4%BB%A3%E7%90%86%E5%82%BB%E7%93%9C%E6%95%99%E7%A8%8B/","excerpt":"","text":"众所周知，某些网站被以SNI阻断的方式Ban了~ 从墙墙ちゃん毒害网络的方式来看，有DNS污染、封IP和端口和TCP连接重置等。下图的“连接已重置”就很有可能是遇到TCP连接重置了。 受到TCP连接重置影响的知名网站有： 维基百科 维基语录 Reddit Steam社区 Pixiv Archive of Our Own …… Nginx本地反向代理针对的就是TCP连接重置（SNI阻断）ヾ(•ω•`)o 在干活之前，我们有必要了解一下法律条文，做一个学法懂法用法的好公民~ 《中华人民共和国计算机信息网络国际联网管理暂行规定》 第六条 计算机信息网络直接进行国际联网，必须使用邮电部国家公用电信网提供的国际出入口信道。任何单位和个人不得自行建立或者使用其他信道进行国际联网。 引用一篇博文的讲解：本地的 客户端拦截浏览器的 TLS 连接，让浏览器以为自己已经连上了目标服务器，读取 TLS 中承载的 HTTP 数据；然后自己与目标服务器建立一个新的 TLS 连接，把 HTTP 数据发过去。也就是说，您不需要代理服务器。 我们今天讲的Nginx本地反代，是本地反向代理，并没有自行建立信道进行国际联网，并没有推倒墙娘，我们的流量依然是走国家公用电信网的，所以这种方式完全合法！ 详细步骤那么废话不多说，赶紧开始吧~ 退出杀毒软件。我电脑上的ESET居然报毒了……不确定国内的杀软会不会报毒，总之退出了肯定没问题…… 下载GitHub (GayHub) 上的Pixiv-Nginx项目并解压： GitHub下载直链 码云镜像（需登录） 两者二选一，推荐使用GitHub 注意，解压的路径不能包含任何非英文字符！不能放在诸如“新建文件夹”之类的中文路径里，不然无法正常使用！ 安装证书。我们解压出来的文档中有一个名为”ca.cer” 的文件。 我们双击打开它，然后按下图步骤操作： 点击图片可以查看大图 修改Hosts文件。Windows 用户直接运行目录下的“一键修改hosts.bat”就好，一切工作会自动完成。 启动Nginx。双击打开“4.可视化工具（这个操作简单）.exe”，给予管理员权限（允许此应用对您的设备进行修改）。点击“Nginx”后面的“Start”按钮。 同意穿过防火墙 这时文本标签“Nginx”前的红叉会变成绿勾。 刷新DNS缓存。先关闭您所有开启的浏览器窗口。随后同时按住键盘上的“Windows键”和字母“R”键，在弹出的窗口中输入“cmd”并键入回车。在弹出的“命令提示符”窗口中输入命令： 1ipconfig /flushdns 请注意，ipconfig后有一个空格。然后键入回车。您会看到提示： Windows IP 配置 已成功刷新 DNS 解析缓存。 大功告成！ 恭喜您，您已经成功使用了Nginx进行本地反代。这时您已经可以访问AO3、Pixiv、Steam社区和维基百科。赶紧试试您想访问的网页吧。 如果您想关闭服务，只需要点击步骤4中的“Stop”按钮。 重新启动电脑和，您需要重复步骤4和步骤5重新启动服务。如果您想开机自动启动服务，请把目录下的“nginx.exe”设为开机启动。具体设置方法请自行百度。 鸣谢 Pixiv-Nginx的开发者@Mashiro Pixiv-Nginx的其他贡献者 Nginx项目 维基百科编辑者 学富五车的方教授、令人怜惜的墙娘和为保护青少年身心健康而不懈奋斗的热心网友 (jiàn pán dà xiá) 屏幕前的您 更多 如果您在启用Nginx的时候遇到了其他困难，不妨看看下载文件中附带的几张图片，也可以在评论区留言向我提问。 如果您想这个工具支持更多的站点，不妨亲自动手编写规则并Pull Request。 如果您想进一步了解相关原理，不妨阅读维基百科。 安全相关本项目使用的证书是@Mashiro签的，我不能保证证书的100%安全，存在中间人攻击的风险，本人不承担使用这个项目所造成任何损失的责任。你的Pixiv、维基百科和AO3账号及密码可能遭到劫持，其他并非通过本项目反向代理的网站安全性则不受影响。 然而Mashiro和我都认为这几个网站没啥中间人攻击的价值~ 又不能恰钱~ 而且Mashiro也说如果证书有问题可以“顺着网线过来打我”……一般来说普通网友不会做这样的坏事，大体上请放心使用我这个方法，我只是声明一下不承担责任 &amp; 科普。 如果你担心安全问题，可以考虑自己生成一个证书。如果你不会生成证书，可以考虑通过以下手段保护自己的隐私： 使用小号访问Pixiv、维基百科和AO3 不安装证书，每次访问的时候点一下不安全仍然访问（但是可能出现图片无法访问的现象） 找一个你信得过的懂技术的朋友，让Ta帮忙签发一个 点击此处查看@Mashiro的安全声明 总之，不必过分担心，快乐上网冲浪就好( •̀ ω •́ )✧","categories":[],"tags":[{"name":"教程","slug":"教程","permalink":"https://www.hee.ink/tags/%E6%95%99%E7%A8%8B/"}]},{"title":"【简体镜像】魔法少女小圆  内容考据","slug":"【简体中文镜像】魔法少女小圆-内容考据","date":"2020-03-03T11:00:38.000Z","updated":"2020-09-05T18:10:09.295Z","comments":true,"path":"2020/03/03/【简体中文镜像】魔法少女小圆-内容考据/","link":"","permalink":"https://www.hee.ink/2020/03/03/%E3%80%90%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87%E9%95%9C%E5%83%8F%E3%80%91%E9%AD%94%E6%B3%95%E5%B0%91%E5%A5%B3%E5%B0%8F%E5%9C%86-%E5%86%85%E5%AE%B9%E8%80%83%E6%8D%AE/","excerpt":"","text":"原标题：废怯少女小圆 内容考据(有雷)(4/26更新ver1) 作者：天使の翼 原网站：Game Comic Forum 原地址：http://www.gcforum.org/viewthread.php?tid=5721 字数：约53500字 此处的4/26是指2011年4月26日，这是一个老帖了。原帖已经404了，连Web Archive都打不开。现在也联系不到原帖大佬取得转载授权，若有人能帮忙联系上就帮大忙了。如果您是原作者，认为这个镜像侵犯了您的著作权，请直接在评论区留言，我会第一时间删除。感謝天使の翼的考据。 看见Bangumi上依然有人讨论，现特地整理并制作压缩过的镜像。原帖为繁体，在台湾论坛发布，本版本将正体中文转换成了简体，若有错误敬请指出。若要查看正体中文原版，请点击此处跳转。 2020年9月6日优化镜像，将JPEG/PNG/GIF图片换成了WebP，节省流量60%，理论加载时间减少60%。 以下是原帖内容： 废怯 (mó fǎ) 少女小圆 内容考据(有雷)(4/26更新ver1) 魔法少女小圆 (魔法少女まどか★マギカ) (目前已完结) 引用：原作 - Magica Quartet ˇ监督 - 新房昭之 シリーズディレクター - 宫本幸裕 ˇシリーズ構成・脚本 - 虚渊玄（ニトロプラス） ˇキャラクター原案 - 蒼樹うめ ˇ音楽 - 梶浦由记 (可怕的四巨头组合w 以下大部分内容整理自4chan(主)、维基百科(中&日)、PTT C_Chat、百度百科，2Ch，Komica，魔法少女まどか★マギカ官方網站(图片点开可以放大) 整理者注：此处可能是原作者链接标错了，上面的链接指向《魔法少女まどか☆マギカ WIKI》。维基百科的URL应为https://wikipedia.org 目前出现的魔女引用： Gertrud - 蝶の羽を持つグロテスクな魔女。(第二话)Charlotte - ファンシーなぬいぐるみの姿をした魔女。見た目に似合わず強大な戦闘能力と特殊能力を誇る。(第三话)Suleika - 暗闇の魔女（未登场）。暗が深ければ深いほどその力は増す。Elly(Kirsten) - ハコの魔女。その性質は憧憬。 筋金入りのひきこもり魔女。 (第四话)Albertine - 落書きの魔女。（未登场）。その性質は無知。 かくれんぼが大好き。Gisela - 銀の魔女。その性質は自由。高速で移動する結界の中に潜んでいるが魔女自身は非常に愚鈍。 (第七话)Elsa Maria - 影の魔女。その性質は独善。全ての生命のために祈り続ける魔女。 (第七话)Uhrmann - 影の犬の魔女。(未登场)その性質は渇望。谁からも谁よりも愛されたくてしょうがない犬の姿をした魔女。(第八话)Oktavia von Seckendorff - 人魚の魔女。その性質は恋慕。在りし日の感動を夢見ながらコンサートホールごと移動する魔女。(第九话)Isadel - 芸術家の魔女。その性質は虚栄。自らを選ばれた存在であると疑わぬ魔女。(第十话)Kriemhild Gretchen - 救済の魔女。その性質は慈悲。この星の全ての生命を強制的に吸い上げ彼女の作った新しい天国（结界）へと導いていく。(第十话)Patricia - 委員長の魔女。その性質は傍観。蜘蛛のような糸を吐き結界内の空に自分だけの学園を作って学生達と変わらぬ日常生活を繰り返している。(第十话)Oktavia Von(第二版….) - 人魚の魔女。その性質は恋慕。ギターが鳴り響くコンサートホールの中で在りし日の感動を夢見続ける魔女。(第十话)Roberta - 鳥かごの魔女。その性質は憤怒。カゴの中で足を踏み鳴らし叶わぬもの達に憤り続ける。(第十话)?????(魔女之夜) - 舞台装置の魔女（通称・ワルプルギスの夜 / 本名不明）その性質は無力。回り続ける愚者の象徴。 歴史の中で語り継がれる谜の魔女。通称・ワルプルギスの夜。 (第十一话) → 取戏份最多的那一话XD 目前出現的使い魔引用： Anthony - 魔女の使い魔。おひげを生やした毛玉のような外見をしている。ハサミで手入れしようとする。おひげのセットは主が担当している。Adelbert - 魔女の使い魔。相手を足止めする蔦に変身する小型の使い魔。Pyotr - お菓子の魔女。その役割はチーズを探すこと。しかし過度な期待は禁物。Ulla - 暗闇の魔女の手下。その役割は夢。Daniyyel & Jennifer - ハコの魔女の手下。 その役割は運搬。 この手下がさわった物体はとても運びやすくなってしまう。Anja - 落書きの魔女の手下。その役割は童心。 ひとり遊びに夢中になっているうち 魔女とはぐれてしまった迷子の手下。 (第五话)Dora - 銀の魔女の手下。その役割は主張。体についたパイプから近所迷惑な爆音を撒き散らし気まぐれな砂嵐のように移動する。(第七话)SEBASTIAN’S - 影の魔女の手下。その役割は妄信。 影の魔女によって平等に救われてしまった命達の集合体。(第七话)Bartels - 犬の魔女の手下。その役割はインテリア。全く意思を持たずにただ回転しているだけのマネキン。(第八话)Bartels - 人魚の魔女の手下。その役割は演奏。 魔女のために音楽を奏で続ける虚ろな楽団。 (第九话)Michaela - 芸術家の魔女の手下。その役割は作品。魔女によって命を奪われた人間はその体の一部分を盗まれ、この中に組み込まれてしまう。(第十话)Mathieu - 委員長の魔女の手下。その役割はクラスメイト。足に履いたスケート靴で糸の上を優雅に滑走するがそれぞれは魔女が糸で操ってるだけであり意思を持たない。(第十话)Holger — Klarissa - 人魚の魔女の手下。その役割はバックダンサー。魔女の後ろで陽気に踊り続けるだけの存在。(第十话)Gotz - 鳥かごの魔女の手下。その役割は軽薄無思慮。群がる鳥は馬鹿な男達。(第十话)?????(魔女之夜的手下) - 舞台装置の魔女の手下。その役割は道化役者。 強大な魔力に引かれ集まった無数の魂。(第十一话) 文字：4chan讨论的结果，废怯少女动画的原创文字是从德文改编而来(上图有缺的部分是由于德文f,q,x出现频率极低，加上目前动画还没出现对应的符号) 详细文字对照在62#楼 故事：(第一话)第一集开场图，引用自Prolog(浮士德)的一段话图上的字是德文原文：Prolog im Himmel ，翻译成英文是Prologue in Heaven也就是 在天堂的序言(Prologue in Heaven is the first scene of Faust)而正好Prolog im Himmel也是歌德的浮士德(Goethe’s Faust)第一篇的标题 这中间的核与第一话对照，似乎是相同的东西，但却不明白这代表什么意思 这个是布幕打开后，很快闪过的字，要顺时针旋转90度才看得出来，原文是TAGSCH是Prolog im Himmel中的一个片段，取缩写 引用： 德文(Prolog im Himmel)部分原文：Sind herrlich wie am ersten Tag. Und schnell und unbegreiflich schnelle(Are wonderful as on the first day. And fast and incomprehensibly snaps) 第一话一开始出现崩坏的城市，闹钟响起，小圆起床究竟这是梦还是第二次loop? (loop的可能性很高)这张图很明显可以看出来，左边是第一话一开始崩坏的地方，右边则是小圆被QB声音吸引而去的地方似乎可以看得出来这个地方是LOOP后才恢复的(?)时间轴如图，可能是世界毁灭后焰许愿回溯，来阻止小圆成为魔法少女 小圆的家取景自”House N” 引用： 更多资料请看 日本House N By Sou-Fujimoto建筑事务所 焰转学过来，同学位置好像怪怪的(作画失误?) Anthony，是魔女Gertrud的随从，名称含意是不祥魔女の手下。その役割は造園。おヒゲは魔女にセットしてもらう。(魔女的手下，工作是造园，胡子是魔女赐的ww)这些品客(?)围观小圆他们所说的话：三国语言版XD 引用： Das sind mir unbekannte Blumen.(この花々は私には分からない花々だ ) (Those are unknown flowers to me. )Ja, sie sind mir auch unbekannt.( (そうだ、あの花々は私にも分からない物だ) (Yes, they are unknown to me too. )Schneiden wir sie ab.((じゃあ、切ってしまおう ) (Let’s cut them off.)Ja schneiden doch(?) sie ab.(そうだ、切ってしまおう) (Yes, let’s just cut them off. )Die Rosen schenken wir unserer Königin.(切って女王にこの蔷薇を捧げよう ) (We present the roses to our queen.) 之后的秘境图，字大多都跟上面有关~ 所以翻成简单的英文我就不在翻中文了XD(众：你好懒XD) 图中原文： 引用： Die blühenden Rosen sollen der(上)(The blooming roses shall be)…bl[ü]henden Rosen sollen der(下)(… blooming roses shall be) 德文原文： 引用： Bekämpfe schädliche Insekten! (=Fight harmful insects!=扑灭害虫) 德文原文： 引用： Kein Durchgang(=No trespassing=请勿擅入) 德文原文： 引用： Das sind mir unbekannte Blumen(=Those are unknown flowers to me) 德文原文： 引用： Königin sofort geschenkt sein(=the queen immidiately)Die blühenden Rosen sollen der(=The roses shall be presented to) 德文原文： 引用： Das sind mir unbekannte Blumen(=Those are unknown flowers to me)moero(=燃えろ=燃烧吧) 德文原文： 引用： Das sind mir unbekannte Blumen(=Those are unknown flowers to me)Die blühenden Rosen sollen der(=The roses shall be presented to) 德文原文： 引用： Kein Durchgang. Zutritt verboten.(=No trespassing. Entry forbidden) 德文原文： 引用： Königin sofort geschenkt sein(=the queen immidiately)Die blühenden Rosen sollen der(=The roses shall be presented to) 德文原文： 引用： Die ersten Knospen sollen gepflückt sein(=The first buds shall be plucked=第一个芽应该摘下) 德文原文： 引用： Kein Durchgang. Zutritt verboten(=No trespassing. Entry forbidden) 德文原文： 引用： Kein Durchgang(=No trespassing)Die Äste behindern Durchlüftung” Die üppigen Äste behindern gute Durchlüftung (=”The lush branches hinder good ventilation) 魔女秘境的图，用罗马拼音翻译过来是けに来たよ，”来救你了”的意思这意思到底是”(麻美)来救你了”(为什么会写在魔女的领域内?)或主是魔女试着告诉我们他会救小圆呢?(如果是的话到底是为什么?) 图中出现的德文Bekämpfe schädliche Insekten!，翻译成英文是Fight harmful insects!(扑灭害虫) 左半边是魔女秘境很快带过的图，没想到竟然是拿破仑 囧…秘境主题：花园，园艺剪刀，蔷薇，花，蝴蝶，荆棘，枯树 灭火器上头写的是moero(燃えろ) 原文： 引用： ?Du mußt versteh’n! Aus Eins mach Zehn, Und Zwei laß geh’n, Und Drei mach gleich, So bist Du reich. Verlier die Vier! Aus Fünf und Sechs, So sagt die Hex’, Mach Sieben und Acht, So ist’s vollbracht: Und Neun ist Eins, Und Zehn ist keins. Das ist das Hexen-Einmaleins!“ 图中原文很长，出处为浮士德”巫医”篇，当时梅菲斯特带领浮士德去找女巫去制造返老还童药水女巫所念的咒语(全文很长，详见附录w)翻译成中文为： 引用： 你得领悟！ 由一作十， 二任其去， 随即得三， 你则富足。 将四失去！ 由五与六—— 女巫如是说—— 而得七与八， 如此完成了： 而九即是一， 而十是零号。 这是女巫的九九表！ 其实这首诗是一篇谜语，从前面三句我们得到10, 2, 3这三个数字，”你就富有”意指加起来(=15)后三句得到0, 7, 8，与5, 6, 4，最后得到的结果是3x3的9格方形，10是零号表示第10格不要 10 2 3 =15 0 7 8 =15 5 6 4 =15 =15 =15 =15 x 小圆他们的教室取材自Second life监狱(つд⊂)左上：Second life监狱右下：澳大利亚的玻璃(?)监狱 还有一些其他场景~中东的哈利法塔 (Burj Khalifa) 引用： 更多资料请看 世界第一高楼—哈利法塔 (Burj Khalifa) 跟迪拜的天空比较图XD 新加坡的双螺旋桥 引用： 更多资料请看 新加坡双螺旋桥(Helix Bridge) (第二话)这栋建筑物是Weltstadthaus(由建筑师Renzo Piano所设计的) 新加坡的UOB广场 引用： 更多资料请看 大华银行广场一期(UOB Plaza One) 这两张出自浮士德的诗句，原文： 引用： Weh! weh!Du hast sie zerstörtDie schöne Welt,Mit mächtiger Faust;Sie stürzt, sie zerfällt!Ein Halbgott hat sie zerschlagen!Wir tragenDie Trümmern ins Nichts hinüber,Und klagenÜber die verlorne Schöne.MächtigerDer Erdensöhne,PrächtigerBaue sie wieder,In deinem Busen baue sie auf!Neuen LebenslaufBeginne,Mit hellem Sinne,Und neue LiederTönen darauf! 翻译为： 引用： 悲哉!悲哉!你用这粗拳摧毁了这美丽的世界;它倾覆,它会瓦解!一位半神将它砸坏!我们将废墟打扫干净并且为失去的美而伤怀.强而有力的地之子啊,赶快把它在你的胸中重建得更加气派!光明磊落地开始崭新的人生历程吧,让崭新的歌曲响彻世界! 这张图文字是The Blooming roses shall be presented to the queen lmmidiately(盛开的玫瑰必须马上奉献给皇后) 魔女的名字：Gertrud 原文：Die Rooose!!(=The Rooose!!) 大图请点我这个是第二话出现的魔女，名字是Gertrud(蝶の羽を持つグロテスクな魔女)，不过Gertrud这个名字还满多地方用的就是… 不是电影就是导演，还有小裤裤魔女www不过最好的解释还是同名的玫瑰花种名为Gertrud，这种花长得也跟动画中出现的很像介绍文：蔷薇園の魔女。性質は不信。なによりも蔷薇が大事。その力の全ては美しい蔷薇のために。結界に迷い込んだ人間の生命力を奪い蔷薇に分け与えているが、人間に結界内を踏み荒らされることは大嫌い。(蔷薇园的魔女，生性多疑，蔷薇比什么都重要，他将所有力量都注入蔷薇中，迷路进入蔷薇园的人类会被窃取生命力) Adelbert，第二话才出现的随从，蔷薇園の魔女の手下。 その役割は警戒。人間を見つけると、ベルのような警戒音を鳴らし、容赦ない頭突きを食らわせる。視力は 2.5。 小さなタイプは侵入者を阻む蔷薇の蔦に変身可能。(魔女的手下，工作是警戒，会像铃铛一样发出警戒音，视力有2.5，小只的能变身成带刺的玫瑰攻击入侵者) (第三话)沙耶加拿给上条君(误)听的CD 引用： 大卫·费奥多罗维奇·欧伊斯特拉夫（俄语：Давид Фёдорович Ойстрах，1908年9月30日－1974年10月24日），犹太裔俄罗斯小提琴家。详情可以看介绍[简介] 欧伊斯特拉夫 麻美学姐戒指上写着”mami” 牢笼中墙壁写着Charlotte 原文： 引用： CharlotteIch liebe Käse.Ich will nur Käse.Es gibt nirgends den Käse. 引用： CharlotteI love cheese.I want only cheese.There is no cheese anywhere. 秘境旁边的图腾有Charllote的图案 第三话似乎在警告斩首的可能性 大图请点我part1 大图请点我part2第三话出现的魔女，名字叫Charllote(ファンシーなぬいぐるみの姿をした魔女。見た目に似合わず強大な戦闘能力と特殊能力を誇る。)(お菓子の魔女。その性質は執着。欲しいものは 全部。絶対に谛めない。お菓子を無限に生み出せるが大好物のチーズだけは自分で作ることができない。チーズさえ持っていれば簡単に隙をつくことが出来ただろう。)这只同样没有适合的解释，有地名，还有小裤裤魔女XD，不过看他这么贪吃的样子，就暂时把他归类到一种法国的点心www准备芝士的话就可简单地制造破绽吧→ 所以焰战胜的方式是喂他吃炸弹东西(喂最后引诱魔女吃到炸弹就结束了这点心里面塞水果跟奶油，然后外面包着面粉这样，跟他的攻击方式挺类似的…. 不知道算不算捏他，注意看英文部分MAMI MOGU MOGU…翻译成日文就是…マミ モグ モグ…(抖 Charllote的使魔：お菓子の魔女。その役割はチーズを探すこと。しかし過度な期待は禁物。(Charllote的仆从，他的工作是找到奶酪，但是不要对他期望太高) 引用： 出处：http://yaraon.blog109.fc2.com/blog-entry-512.html图片相信不用翻译大家应该的看得懂XD疑点：焰第一次(?)看到这个魔女就知道本体(?)在哪，也就是说焰事先知道攻略法的可能性很高，剧情很高的可能性是loop 引用： 补一下Charllote秘境的一些图(甜点+医院+手术室+药品+叉子+剪刀) 秘境中出现的两本书 Charllote的悲伤之种(左)、学姐的灵核(右)之对照图 第三话才出现的EDED最后看上去像一个脸，这是浮士德中的恶魔”梅菲斯特”的外貌(梅菲斯特曾经拍成电影，音乐剧…等等很多部的作品)似乎是影射QBey=梅菲斯特? 引用： 歌德笔下的梅菲斯特(详情请看附件w)梅菲斯特虽然是个恶魔，但是歌德将他设定为代表「为成就大恶而行善的力量」，他刚登场的时候，并不是个恐怖的恶魔，而是一个身躯瘦弱，微微驼背，鹰勾鼻的男子，睑上浮着嘲笑似的笑容。 不过他毕竟是个恶魔，能够变成种种样子，变成尨犬跟在浮士德身旁散步，或者变成旅行的学生待在浮士德的书房中。 而在要与浮士德签订契约时，则是变身成西班牙的贵族。与浮士德订契约的场面相信是以《旧约圣经》中的〈约伯记〉为参考。 契约的期限是到浮士德念出「啊啊!你真是美好无匹!请你驻留!」为止。在那之前恢复年轻的浮士德经历了种种的事件。墨菲斯托作为《浮士德》里的反面主角，玩世不恭，诱人堕落，却又不失冷静、深沉、恢谐和机智，是个典型的虚无主义者的形象。 墨菲斯托在自我介绍时说：「我是永在否定的精灵！一切事物只要它生成，理所当然就都要毁灭，所以还不如无所发生。你们叫这做破坏、罪行，简单扼要说就叫做恶，这就是我本质的属性。」 官网第三话新增的魔女 ，名字是Suleika暗闇の魔女（未登场）。その性質は妄想。暗が深ければ深いほどその力は増す。完全な暗暗の中においてはほぼ無敵だが灯りの多い現代においてはそれほど恐れる魔女ではない。(暗闇的魔女(未登场),其性质为”妄想”,在越深的黑暗中力量越强,完全的黑暗中，将近是无敌的存在, 在灯火通明的现代并不是值得恐怖的魔女…)这魔女也太强了吧◢▆▅▄▃崩╰(〒皿〒)╯溃▃▄▅▇◣ Suleika的使魔：暗闇の魔女の手下。その役割は夢。あらゆるものに姿を変化させ漆黒の暗の中に魔女の望みを描き出す。暗闇の中では強大な力を誇るが、街灯や月明かり程度のわずかな光があればその力を半減できる。(暗闇魔女的手下,其职责为”梦”,能够任意变化形态,在黑暗之中描绘出魔女的愿望,黑暗中拥有强大的力量,但若在街灯及月光的影响下力量则半减…)名字叫Ulla，这只使魔应该是第三话开头被学姐打爆的那只XD 引用： 翻译转自PTT C_Chat tgfh1234chan的第三话剧情推测：「所以你决定跟我签订契约了?」 QBey坐在小圆的床上,看着就它见过中最具有潜力的女孩发出了掩饰不住兴奋的声音。小圆躺在床上还在思考她所要做的事「是的。我准备好了, QBey」 「我很高兴能够这么快的找到了能够替代麻美的人」 小圆向天花板扮了个鬼脸。她仍然没有完全相信QBey的承诺 「让我们开始吧, 那么，你的愿望是什么?」 小圆犹豫了一下, 给了自己最后一点时间来思考。 在这之前, 感到不安因为她没有什么愿望。在她人生中的每一件事情, 虽然不是十全十美，一直不够好, 她有一个美好的家庭、很好的朋友, 并没有需要改变的必要。但是现在知道她想要的，她不能不抓住这个机会。 「我希望麻美能够复活。」 她说完了之后松了一口气。有任何其他问题这是好的愿望现在已经毫无意义也为时已晚。 她甚至不知道她为什么想过这尽管是一个不好的愿望开始麻美承诺会指导小圆,而且小圆也承诺会在麻美的身边。 有了这个, QBey 也不需要更换麻美。两边都有好处 不过QBey看上去似乎很失望「这就是你的愿望?」 小圆疑惑着看着QBey「是的, 就是这样。 是否有问题呢??」 「我很抱歉, 我无法实现这个愿望。」 「为什么不能。」小圆做了起来并且贴近了QBey她不相信它拒绝了能再次见到麻美的机会 。 「为什么你不能把她复活? 你说你能创造奇迹发生, 对吧?」小圆的眼里泛着泪光。「为什么你不能让 麻美 复活? 什么阻止了你? 是你能力不够吗?」 小圆开始抽泣，她想和麻美在一起的梦又破碎了。然而QBey丝乎没有被小圆的情绪影响。 「不是这样的。 我有权力使死者复活。」 「那你为什么不能让麻美复活?」 小圆问。她虽然已经想到了原因, QBey在之前有提到了一些「规则」。 所以如果禁止复活。。。 「麻美并没有死。」「…什么?」 小圆不敢相信她所听到的。 「麻美并没有死，我可以轻易的让死者复活, 但我不能让生者复活。」「你是什么意思, 『麻美并没有死』? 如果她真的活着, 那么她在哪? 为何你需要一个代替她的?」 「你还记得麻美发生了什么事吧? 魔女在她反应不过来的时候咬住了她的头。」小圆转身背对 QBey 并摀住了耳朵。她并不想要回忆起麻美的命运。但是没有用; QBey的声音很清楚的在她的头响起。 「当麻美的无头尸体掉在地上的时候, 魔女扑上去咀嚼。到这边任何一个正常的人都会死, 但麻美的愿望使她不同于一般人。她将永远的生存下去 。 然而仅此活着是不够的。随着她的头跟身体分家 , 魔女把她嚼成碎片, 她已经不能再和魔女战斗了。我不能再用她了。」 小圆躺在床上, 她的双手仍试图阻止QBey的声音从她的耳朵进来。麻美的命运比她想像的还要糟糕。 「我真得很期待看到你的潜力，一个魔法少女的诞生，真令人失望。」 QBey 走上了垫子并把自己卷成了一颗球。「如果有别的愿望的话，告诉我，到时再来签约吧。」 在这晚小圆完全没有睡着。 (第四话)左手君用的CD Player： 引用： 以下说明转自PTT C_CHAT 这款名为Dual Music Player的概念播放器，为来自设计师 Yong-Seong Kim的创意，它是一部同时支援CD及MP3的双能音乐播放器，目前只有概念，没有实品。 在MP3模式时它为一个长方体结构，上方配有一只圆形LCD屏幕，能用来显示歌手与专辑名称、乐曲长度等相关资讯下方则配备了圆形的播放/暂停、停止独立按键，及前进/倒退/音量调整复合键此外一旁还配有细长的条状蓝色指示灯。 不过若为 CD模式，可以LCD屏幕为中心将整个Dual Music Player播放器以像蝴蝶刀旋转的方式(也有点像圆规)笔直切成两半转开然后把CD光碟从LCD屏幕侧边的细缝放入，Dual Music Player就摇身变成CD播放器了。 SONY有实做一款类似的实体机Sony Discman D-88(看上去超恐怖啊XD 随身电锯)Sony D-88 Discman 第四话魔女，写做Elly念做Kirsten(咦)ハコの魔女。その性質は憧憬。 筋金入りのひきこもり魔女。憧れは全てガラスの中に閉じ込める。 閉じ込められた者はその心までも簡単に見透かされてしまうが 考えるより先に殴れば問題ない。(箱的魔女。性质是憧憬(渴望?)。长时间住在内部含金属条(?)的箱子中，不与外界接触的家里蹲魔女。他憧憬将所有他憧憬的事物关在(?)玻璃器具中。被关在玻璃中的入侵者心会被透视，但是在被透视之前先揍他一顿就没问题了(喂wwww))不负责任乱翻译Orz补充：Elly是绿野仙踪(改写版本)里面，桃乐丝的名字 Elly的使魔：Daniyyel & Jenniferハコの魔女の手下。 その役割は運搬。 この手下がさわった物体はとても運びやすくなってしまう。(箱之魔女的手下。工作是搬运。它们能很轻松地搬运被他们碰到的物体)(竟然有小熊裤裤(喷茶)) 这话出现的 神圣仪式neta出处 ：人民圣殿教(这集的典故) 【逆再生】魔法少女まどか☆マギカ4話のあるシーン・・・ 第四话进魔女秘境前的奇怪音效，逆再生后才知道魔女所说的意思是今日は本当に楽しかったねぇまたいきたいねぇ今度はお弁当ももっていこう(今天真的很开心呦，下次还想再去耶，这次连便当也带着了) 小圆进入秘境后，从天而降的双子(Kirsten)手中的屏幕像开幕似地显示4–>3–>2–>1(每一秒变一次) 小圆被拉入秘境前，背后的屏幕写着Kirsten(这到底是使魔? 还是魔女?)虽然很多资料都写这集应该是双魔女，但是我觉得这应该是Elly的使魔才对 这次魔女刻印是双子天使 德文原文：Ich mag keine Narren(I don’t like fools)在浮士德中，梅菲斯特把人所有人类影射为世界级的傻瓜Narren为德文的傻瓜之意，在这可看成影射人类。并且可能意味着魔女讨厌人类。 德文原文：Ich will nicht arbeiten(I don’t want to work.)这句是一位挪威的剧作家Henrik Ibsen所写出来的剧本John Gabriel Borkman(中文翻做冰雪人生 有翻拍成电影) 引用： “Ich bin jung, ich will nicht arbeiten, ich will leben,”可以翻译成”Yes, but I don’t want to work now! For I am young! I will not work! I will only live, live, live!” 在冰雪人生中，这句话是从Erhart口中说出来的(剧中角色John Gabriel Borkman的儿子)，John Gabriel Borkman原本是银行经理，但因诈欺坐了五年牢，(中间剧情省略)，最后他的儿子说他希望居住在他的幸福生活，无需未来。而最后Borkman在寒冷的冬天发抖着，接着在雪地跌倒，然后死亡 引用： 冰雪人生(John Gabriel Borkman)详细剧情请看这里：冰雪人生(John Gabriel Borkman) Elly最后死亡的一幕，是女人的样子，Grief seed是从魔法少女的宝石/灵核变的可能性很高 引用： 补充Elly秘境的图：(水中+旋转木马+CRT屏幕+双子(?)) (第五话)第五话OP，旁边红色像血流下来的液体消失了，取而代之的是淡蓝色的血/液体(?)(是否预告下次的死者?) 正中间的是帝国大厦XD 引用： 更多资料请看 帝国大厦(Empire State Building) 有台北101耶www 引用： 更多资料请看 台北101 (TAIPEI 101) 沙耶加变身，周围魔法阵是音符(跟许的愿望有关?) 沙耶加的魔法少女编号(?)是C(喂) 为什么沙耶加的戒指上没有写字呢?是伏笔? 还是单纯的作画失误? 焰的戒指上的文字是”mura”不知道焰的编号是什么(喂)。疑点：编号跟强度是否有关系? 仔细一看对照图，该不会第一话出现的魔女是沙耶加吧!?(可能性很高Orz 咦?! 签下去之后连影子都不见了吗?(つд⊂) ….(可能是伏笔?) 原文：Fin，通常用在电影结束，在法文中也有end的意思 第五话出现的使魔的主人，名字是Albertine落書きの魔女。（未登场） その性質は無知。 かくれんぼが大好き。 けれど彼女の手下達はあまり賢くないため 谁も彼女のことを探してくれない。(涂鸦的魔女(未登场)。其性质为无知。最喜欢捉迷藏。但是他的手下们都不太聪明，(捉迷藏的时候)都找不到他XD) 名字是Anja落書きの魔女の手下。その役割は童心。 ひとり遊びに夢中になっているうち 魔女とはぐれてしまった迷子の手下。 人間をボールに変えてしまう力を使い、ボールに変えられた人間は今までについた嘘の数だ地面を跳ねなくてはもとの姿に 戻ることが出来ない。(涂鸦的魔女的手下。他的工作是表现得天真幼稚(他本性原本就这样吧XD)。独自一人玩得太入迷会跟魔女走散(?)，他的能力可以把人类变成球，被变成球的人类如果不依照说谎的次数在地面弹跳的化就没办法变回来)他坐的交通工具从飞机变成船再变成车子www这只使魔的音效好可爱~(ˊ艸ˋ) 链子上的图案是奈良兴福寺的五重塔 引用： (兴福寺:日本第2の高塔。室町時代)兴福寺为一座位于日本奈良县奈良市登大路町的寺院，为南都六宗之一的法相宗的大本山。也是南都七大寺之一。以「古都奈良的文化财」的一部分而登入世界遗产名录之列。 710年在奈良建都之时，当时的统治者、政治家藤原不比等将飞鸟的厩阪寺迁移到了这里，改名为兴福寺。因为是祝愿藤原氏繁荣昌盛的寺院，所以该寺院随着藤原氏作为政治家活跃于世而不断兴盛繁荣。 但是，从16世纪左右其繁荣之势开始衰落，1717年因火灾除了北园堂、东金堂、食堂以外，其余建筑都被烧毁，从那以后，慢慢重建为现在的规模。五重塔、三重塔、北园堂、东金堂已被指定为国宝。 现在的五重塔是日本古老的五层建筑，建于1426年，采用了日本古典建筑方法，高50米，是日本第二高塔。 三重塔则体现了10至11世纪优美的建筑风格，堪称三重塔中的杰作。 焰的能力是时间操作系吗?就在蓝毛要领蛋糕时，焰出现(此时背景的流水停住)蓝毛&红毛被移开位置 仔细想想QB所说的沙耶加的快速治愈能力(愿望=治愈左手君的手)，如果像先前说的焰的愿望是时间回溯的话，那能力是时间操作似乎也是理所当然的感觉~ 而学姐所说的许愿要谨慎，或许是愿望会跟你拿到的能力/武器(之后能不能活下来?)有很大的关系?沙耶加：OXX!! QB怎么不早说不过内置补的坦不多见了啦(‘,_>`)y-~ 这一话有新房最喜欢的四十五度角分镜XD (第六话)OP的变身画面背景颜色变了(暗示小圆快签下去了?)而且好像更恩爱了XD 杏子玩的跳舞机，不是DDR(Dance Dance Revolution )，而是DDR(Dog Drug Reinforcement、药物强化犬)而且曲子还是OP电音版XD 法兰克福的商业银行大厦~ 引用： 更多资料请看 法兰克福 商业银行大厦(Commerzbank Tower) 这集果然是大怒神云霄飞车Orz 这话沙耶加用的Grief seed是第四话出场的魔女Elly(上图跟下图是魔女结界的特征，中间的图是对照Elly的Grief seed) 先看到沙耶加拿grief seed吸收宝石/灵核的黯淡光辉，之后QB把那个用过的Grief seed收回后面的嘴巴(?)疑点1：吸收过多污秽的Grief seed可以变回魔女之卵?(正好符合先前每个不同的魔女，Grief seed都不一样)疑点2：魔法少女的宝石/灵核久了会没办法用Grief seed净化，可能会黑化变成魔女，所以杀魔女=拿以前魔法少女的宝石/灵核(灵魂)来净化自己的 QB吃掉的疑点：疑点1：QB吃掉表示他会再拿出来用? (可能性很高)疑点2：还是QB只是借由签魔法少女帮他搜集Grief seed来吃?(会变大魔王吗?XD) 魔法少女食物链(抖 引用： 所谓成为魔法少女，就是把灵魂抽出来变成宝石/灵核，而身体变成僵尸之类的东东，如果宝石/灵核离开身体超过100米，宝石/灵核(灵魂)就没办法控制身体，身体会像死掉一样(本体=宝石/灵核) QB：这种方式很方便耶，只要宝石/灵核没有受损就是不死之身，心脏被打穿或者断手断脚这种伤害都可以复原但是我实在无法理解你们人类，只要知道这点都会有这种震惊/悲伤的反应~(烟) 观众：「そういうことは先に言えええええええええええ！！！」(出处http://seiga.nicovideo.jp/seiga/im929425) 等等!?那这样的话麻美学姐他…..?可能性1：麻美学姐连宝石/灵核都被吃掉了，没救(可能性比较高，因为学姐的宝石/灵核好像变成发饰 囧)可能性2：他其实没死，但是被Charllote吃下去之后宝石/灵核被焰炸烂=死亡可能性3：学姐到现在都还没死!? (但是身体被炸烂+灵核离开身体超过100米，而且还困在Charllote的秘境中?)可能性4：麻美学姐的宝石/灵核在焰手上!(咦?) (灵核在变身后会镶嵌在肉体上?，变身之后弱点反而更明显这是哪招啦XD)所以学姐可能….. 宝石/灵核离开身体有无副作用?(EX:记忆丧失之类的)or离开身体太久(或者原本的身体被破坏/找不到肉体–>宝石/灵核随时间流逝变污秽?)会直接变成Grief seed? 焰可能是用时间操作能力追上卡车的(时间暂停–>焰前进–>时间解除–>焰跑步–>loop)，但是一次只能暂停一小段时间 重点是这集QB的嘴脸超讨厌的啊啊啊啊啊!!!众人的愤怒，小圆收到了 引用： 焰提到的瓦尔普吉斯之夜(魔女之夜/ヴァルプルギスの夜) 瓦尔普吉斯之夜，在德国是一个非常古老的传说，这传说相信着每一年的四月三十号到五月一号之间的夜晚，魔鬼们和女巫们在德国中部哈尔茨山脉（Harz）的最高峰布罗肯山（Brocken）举行狂欢节，它又被称作「女巫们的安息日」，又称作布罗肯奇景（Specter of the Brocken）。 最初发现的登山队由于无法解释眼前的光环，以为是山中的幽灵，所以称作「布罗肯幽灵」，1780年由约翰·斯伯奇莱克（Johann Silberschlag）记录为「布罗肯虹」。德国文豪歌德于1808年发表写作了60年才完成的悲剧《浮士德》中的一幕为瓦尔普吉斯之夜。主人翁浮士德（Heinrich Faust）被魔鬼梅菲斯特（Mephistopheles）带去参加群魔乱舞的布罗肯峰之夜。后来的作家将布罗肯峰之夜引申为「群魔夜」，如：法国作家巴尔扎克的《驴皮记》，前苏联作家米尔加科夫的《大师与玛格丽特》以及德国童话大师米切尔·恩德的《愿望潘趣酒》。(日文版本：)歴史的なヴァルプルギスの夜は、異教の春の風習にちなんでいる。ノース人の風習では、ヴァルプルギスの夜は『死者を囲い込むもの』とされていた。北欧神話の主神オーディンがルーン文字の知識を得るために死んだことを記念するもので、その夜は死者と生者との境が弱くなる時間だといわれる。かがり火は、生者の間を歩き回るといわれる死者と無秩序な魂を追い払うためにたかれ、光と太陽が戻るメーデー（5月1日）を祝うことにつながる。ワルプルガの聖なる日が同じ日に移動されたことにより、彼女の名前が祝祭と結びついたのである。ヴァイキングたちが春を祝った風習がヨーロッパに広まることでワルプルガは同じ方法で讃えられ、2つの記念日がともに混じり合い、ヴァルプルギスの夜の祭りとして成立していった。(学姐在那天复活的可能性?) 引用： 瓦尔普吉斯之夜(浮士德的悲剧第一部，「瓦尔普吉斯之夜」篇章请看附录)因为占的版面很大，对「瓦尔普吉斯之夜」本文的推测请看下面补充区 引用： 浮士德之中也有提到瓦尔普吉斯之夜(原文详见附录)梅非斯特一直想把浮士德引向纯肉欲感官的爱情，但浮士德被梅非斯特带进马格丽特闺房，感受到她的宁静、整洁、满足、贞洁的性格，他的爱情立刻升华成对反璞归真的向往了。浮士德跟马格丽特犯罪前，曾到森林洞窟中，在大自然中倘佯，这其实也是企图抗拒他渴望马格利特的欲念。但浮士德终究是个历练过人生的老手，又有了年轻的身体，他并无青少年的羞涩胆怯，却有青年的性欲，因此，他和马格丽特发生性关系在所难免。 浮士德引诱了马格丽特，误杀了马格丽特的母亲与哥哥，梅菲斯特赶快携浮士德逃亡，他把浮士德带到他的地盘，也就是「瓦尔普吉斯之夜」。这导致马格丽特单独面对婚前产子的羞惭，她惊惶不知所措下，杀了自己的婴孩，于是被判绞刑。 引用： 描写浮士德”瓦尔普吉斯之夜”的白辽士「幻想交响曲」第五乐章Berlioz SF V: Songe d’une nuit de Sabbat (Immerseel) 幻想交响曲 Immerseel 白辽士的幻想交响曲第五乐章，被付以〈魔女的晚宴之梦——魔女轮回曲〉（Songs d’une Nuit du Sabbat——Ronde du Sabbat），是描写歌德「浮士德」中所构想的，在布罗肯山中魔女们的晚宴情景，当然，白辽士不是直接抒写歌德《浮士德》中此段的确切含意，而是借用瓦尔普吉斯之夜可能会出现的狂乱，来抒写狂乱的幻觉，在这幻觉中，有白辽士自己的丧礼，而他爱却得不到的爱人，在幻觉中则成为了魔女。 更详细说明请到这里看[音乐]：白辽士《幻想交响曲》ch5、古诺《浮士德》Act Five前半段 小圆使用的键盘类似这种激光键盘Celluon Magic Cube 小圆写的作业是首英文诗Hey Diddle Diddle 英文wiki条目 引用： Hey diddle diddle,The cat played the fiddle,The cow jumped over the moon,The little dog laughed to see such sport,And the dish ran away with the Spoon . 引用： 改编自这首诗的童谣：Hey Diddle Diddle Hey diddle(=骗取) diddleAnd the cat and the fiddle(=小提琴)And the cow jumped over theMoonA little dog lied to see such aSportAnd the dish ran away with theSpoon There was a little girlWho had a little curl Right in the middle of herForeheadWhen she was good she was veryVery goodBut when she was bad she wasHorrid La lala lalala… Humpty dumpty sat on the wallHumpty dumpty had a great fallAll the king’s horses and all theKing’s menCould’nt put humpty togetherAgain Georgi porgi pudding and pieKissed the girls and made them cryWhen the boys came out to playGeorgi porgi ran away La lala lalala… Old king cole was a merry old soulAnd a merry old soul was heHe called for his pipeAnd called for his bowlAnd called for his fiddles threeAnd every fiddler had a fiddle soFineAnd a very fine fiddle had heThere’s none so rare as canCompareWith old king cole and his fiddlersThree La lala lalala… 最后一张图倒过来看上去像个「死」这个字(抖 (第七话)这话OP变身的颜色改回来了，跟第六话不一样，跟第五话一样 魔法少女的行动模式(ry 跟前面第五话相同，戒指上写的是”Homura” 杏子抓住沙耶加的时候，手里拿的那袋苹果消失了”(;’Д`)”(作画失误? 沙耶加戒指上的文字还是没办法辨识，不过根据先前的经验，我们可以假设戒指上写是他的名字”Sayaka”之前沙耶加的戒指也没办法看出写了什么字，特别要注意的是手指上的C 这话取材的场景─日本群马县的一景 杏子的戒指上写着”Kyoko” 第七话[杏子回想mode]跟杏子战斗魔女，名字叫Gisela銀の魔女。その性質は自由。高速で移動する結界の中に潜んでいるが魔女自身は非常に愚鈍。残念ながら科学的な力は一切使えない。かつては全身目も眩むほどの銀色であったが、海岸線の夕日を眺めているうちにずいぶんと锖びてしまった。(銀の魔女。性質是自由。潜居在任何物体都高速移动的结界中，但是魔女本身却很愚钝。很可惜地一切有关科学的力量他都没办法使用。他的身体曾经闪耀着眩目的银色光芒，但却因为到海摊去看夕阳而全身生满银锈。) Gisela的使魔，名字叫Dora銀の魔女の手下。その役割は主張。体についたパイプから近所迷惑な爆音を撒き散らし気まぐれな砂嵐のように移動する。嫌いなものは磁石。(銀の魔女的使魔。工作是坚持下去。他移动起来像个沙尘暴同时也会制造很大的噪音，困扰着周遭的人。他恨磁石。)(大略翻了一下，应该有漏掉的 \\囧/) 杏子的死亡暗示? 第七话跟沙耶加战斗的触手魔女，名字叫Elsa Maria影の魔女。その性質は独善。全ての生命のために祈り続ける魔女。祈りの姿勢を崩さぬまま、その影の中へとあらゆる命を平等に引きずり込む。この魔女を倒したくば、黒色の苦痛を知らなくてはならない。(影の魔女。性質是自以为是。持续不断地为世界上所有的生命祈祷的魔女。维持祈祷的姿势不动，他可以把所有生命都拉进他的影子内。人们必须了解黑暗的痛苦才有办法击倒他) 难得出现跟沙耶加有关系的魔女解说(炸这大概也是指沙耶加内心的痛苦(加上他打倒Elsa Maria)的暗示吧。魔女全景，一个人拿着圣体匣的样貌仔细看，左边跟右边有跟背景同色的文字围绕在旁边念做「elsamaria」，就是Elsa Maria 这图更明显了，文字翻译是「Elsa Maria」，右下方跪下祈祷的是魔女的本体 左图：魔女Elsa Maria右图：杏子的妹妹(左)，杏子(右)魔女Elsa Maria的树&发型，对照杏子的妹妹发型跟窗外的树难道这个魔女是杏子的妹妹? 左：这件物件出现在在第7集的魔女的结界右：圣体光座，是天主教经常在宗教义式上用来的一件物件下：圣体光座是由神父拿着的，中间的位置是放着｢圣体｣。因为这件圣体光座是被视为神坚的，所以神父会一边拿着一边用来向信徒祝福，这就等同由主耶诞基督来祝福信徒。 引用： 详细资料请看这里Monstrance wiki 影の魔女的使魔，名字叫触手SEBASTIAN’S影の魔女の手下。その役割は妄信。 影の魔女によって平等に救われてしまった命達の集合体。 彼らは同胞を求めている。(影の魔女的使魔。工作是盲目的信仰。是被影の魔女平等救(吃)出(掉)的这些生命的集合体。他们总是在寻求(找)着同伴。) 坏掉啦坏掉啦坏掉啦~ 这坏掉的表情让我飞跃起来啦(喂www~发动速攻魔法！狂战士之魂！~~ 沙耶加这种表现法是向坏苹果致敬吗?XDD 为别人而许愿签下去的果然都没什么好下场(遮脸 杏子：「奇迹并不是免费的。如果你祈求了希望，也会散播出同等的绝望，就这样将差距变为0，以此保持这个世界的平衡。」(这表示魔法少女许愿后会出现相应绝望的魔女?) 把沙耶加的战斗调亮：(soulgem变成黑的? 或者只是因为背光? or作画崩坏?) (第八话)引用： 本AA转自PTT_CChat 小圆 浮士德 ——–> 魔法少女 梅菲斯特 ——–> QB 浮士德最后 ——–> 魔女 引用： 转自 PTT C_Chat PsycoZero(魔法少女方程式)简单易懂(个鬼)的图解版 M(t)：t时间点魔法少女数量的函数W(t)：t时间点魔女数量的函数 C：QB签的数量D：阵亡的魔法少女的比例B：魔法少女变成魔女的比例K：被魔法少女干掉的魔女的比例F：每个魔女制造的使魔长大成魔女的数量(好复杂)(这栏要正有理数) 接下来有很多演算 总之主要计算法是这样：ΔM(t) = C - D × M(t) - B × M(t) = C - (D + B) × M(t)ΔW(t) = B × M(t) + F × W(t) - K × M(t) = F × W(t)+ (B - K) × M(t) …总之是个公式 从其他角度来推测魔法少女小圆的结局引用： 转自 PTT C_Chat Shift2 虚渊是谁 在C-Chat板上，虚渊真的快变成佛地魔了(苦笑)老实说，我不知道目前的我有没有那个资格，但是我还是试图来谈谈他。 回到虚渊的第一款商业作品Phantom，在这边我们可以找到虚渊玄的『初心』在本作，有这么一句台词，也是我在全作中最喜欢的台词。 『強固な信念、守るべきもの、生き殘るための不屈の意志ヒロイズムとは、幻想ではなかったようだ。』(『强韧的信念、该守护的存在、为了生存而具备的不屈意志 看来英雄并非只存在于幻想之中』) 非常讽刺地是，这句话出自本作的最大反派赛斯口中，他在解释主角的能力为何超出他的想像时，说了这句话。而这句话中的要素我们可以一直在虚渊的剧本中找到。 其实虚渊一直都在写『意志力』与『英雄』这两个东西。但他并不像是少年漫画，说到意志力就是咬紧牙关喊Never Give Up， 燃烧胸中热血，事情就会迎刃而解。 虚渊剧中的『英雄』要用无从抵抗的逆境来描述虚渊剧中的『意志力』要用一次又一次的牺牲来突显 「即使你知道前方走下去只有痛苦只有断崖，你也要走下去吗？」「即使你知道你作的事都是错的，走越远就失去越多，你也要走下去吗？」 于是如同版友所说：『这些角色不见黄河心不死，但最后走到了黄河畔，大都会选择不死心地跳下去，能游多远算多远，最后被名为Bad End的浊流吞没。』 这是早期的虚渊，虚渊三番两次玩这套，玩到自己都快把自己搞到爆炸：「奇怪我为啥只能写这种东西」「我怎么没办法随便凹一下来个救赎呢」 他甚至开始怀疑：「我是不是不相信平常人相信的幸福啊？」而萌生了封笔之意。 「当我看蜘蛛人2，彼得放不出丝的那个桥断，发现了自己心中深藏的愿望…」「虚渊玄该不会其实很讨厌写作吧？」 但此时好友奈须\\武内带来了F/Z的企画，虚渊大喜：「Fate是一部『大团圆』的喜剧，这个故事已经确定会被卫宫士郎所救赎， 既然如此，就算我把自己胸腹中的Bad End恶性肿瘤通通掏剖出来给大家看，也无损于Fate最终的结局！ 就算我在F/Z怎么欺负Saber，她在本篇Fate线最后还是有善终！」 从这段话我们可以看到，F/Z会变成了那附德行，也是必然的道理。虚渊就是打定主意要在F/Z中尽情地写他的Bad Ending。而确实，自从F/Z(2006)之后，虚渊有点变了，也许是这自我Shock疗法出了作用吧。 虚渊剧中的『英雄』有点变了，不再是一个『无尽牺牲、承担无数罪恶以成就某些事』的人物，而有了新的解释：『英雄是一个传承下来的人们的梦想』 从F/Z的Rider主从的最后一幕为开端，懦弱的威巴分得了征服王的勇气，居然敢对英雄王大小声 赏金首的抗暴革命英雄黑鹰，在剧情前半被虚渊又踢又踹：「只要带着那把传说中的枪，谁就是革命英雄黑鹰！黑鹰是谁根本没人在意」于是女主角带着那把传说中的枪，自称黑鹰招摇撞骗。然而到剧情的最尾，虚渊却把这件事完全地翻了盘：「对，黑鹰是谁都无所谓，因为黑鹰就是人们心中向往自由的梦」 钢之翼的结局主角贯彻了『挑战音速的梦』之后，仍然有下一代接手这个梦『挑战未知的宇宙』。本作的『牺牲』成分一样相当低。不像以前，虚渊的主角动不动就是杀害好友、泯灭旧情、毁灭世界… 引用： 转自 PTT C_Chat Shift2 来说小圆 好，回来说魔法少女小圆，小圆仍然是虚渊的孩子，就算不是儿子，老鼠生的女儿一样会打洞。 那么，小圆剧中传承的『梦』是什么？我想那就是『帮助他人的魔法少女(正义使者)』这个梦。同时这也是『魔法少女』这个类型的故事中，最根本的要素，也是小圆一开始的梦想。 注：(我其实不太想用正义这个词，因为正义在板上有某种很负面的印象，一说正义大家就杀气腾腾的要谈美国和切嗣。但其实这作品中的正义没这么复杂…)虚渊三番两次怀疑这件事，好像要打破这件事，告诉观众：『你看，要帮助他人的通通没好下场。』 麻美学姐是最像『魔法少女』的魔法少女，她有绝招名，也最接近正义使者。 可是她三话就被秒杀了，十话还被虚渊拖出来鞭尸，破坏死者形象，惨。沙也加为了上条签约，化身魔法少女后选择了和麻美一样的正义使者之路。 她的下场就不要说了。杏子呢？她不也是吗，她重拾了『助人的魔法少女』之梦十分钟后殉职。 但是反过来说。她们都贯彻到底了。 麻美学姐贯彻到底，最后也取得了小圆这个伙伴，得到了心灵上的救赎。[沙也加也真的直到最后都没有利用魔法和许愿为借口去取得上条的心。 (虽然她混乱之下把电车上的两个男的宰了…)杏子一度背弃这个梦，但最后也回来为了这个梦，义无反顾地牺牲性命。 麻美教导沙也加，沙也加让杏子回想起来的这个『助人的魔法少女』之梦引导出她们的破灭，同时也引导出她们的坚持与光芒。 把这一切看在眼里的小圆，9话接下了杏子交出的美味棒。 虚渊难道不是在问这个年仅中学二年级的的女儿吗：『会变成身魂分离的僵尸、总有一天会变成魔女被别的魔法少女猎杀、甚至伤害他人 所有付出都无人知晓，无从求回报， 即使这样，你也要当助人的魔法少女吗？』小圆的答案？我想，小圆就算废怯，她体内流的还是虚渊的血。 引用： 转自 PTT C_Chat Shift2 从这角度来说焰从这角度来看，焰是一个被排除在『助人的魔法少女』这个接力赛之外的角色。相反地，她还是一个打算破坏这交棒的角色。**她从一开始就是个『只为一人的魔法少女』——某个角度来看，她并不是一个『魔法少女』，她没有背负魔法少女的宿命，** 反倒比较像是『沙耶之歌』和『鬼哭街』中，只为一人而造成无数死伤的早期虚渊故事的主角。一开始她的视野内也许还有其他人的安危，但随着loop数的增加，她的关心也越来越集中在小圆身上。 最后这一次loop中，从4、5话她和小圆的对谈可以知道，一旦成为魔法少女，在她眼中就只剩下战死和魔女化的差别：『一旦成为魔法少女就没有希望了，所以你放弃美树沙也加吧！』 事实上也是这样，这就是魔女系统的真相。 回头说『结局应该不会是怎样』从这个观点来看，若虚渊选择让『再loop一轮以完成完美结局』，那会是件令我难以想像的事。 在小圆无法loop的状况下(我也不认为虚渊会让她loop)一旦再loop，那不但代表1-9话整个『梦』的传承通通都要被归零。同时也代表，整个1-9话麻美、沙也加、杏子的故事，她们的奋力演出通通都被推翻了 那观众为她们流的眼泪，捏的冷汗，放的感情，吐的口水，开的讨论串，延烧的笔战，通通是要reset去哪？ 『选择再loop』，会把整个1-9话，贬为单纯用来介绍角色和世界观的道具。 就算我们最后看到了幸福的结局，那个沙也加绝不是我们关注了两个月的死脑筋沙也加，那个杏子也不会是经历和沙也加的点滴之后重拾爱与勇气的杏子。 最重要的『梦的传承』，必须要完遂在这一轮，才会为三人的牺牲和故事带来意义。 因为这一轮的小圆，已经具有最多的觉悟了。她掌握了比之前所有小圆都要多的情报，她已经可说是知道一切该知道的了。她喊签约需要的是难以想像的决心和意志力。 毕竟，这部作品的重点，就是『描写小圆决心成为魔法少女的经过』 而不是寒蝉一样的『无限loop以求完美结局』所以…万一真的loop把记录洗掉了，我会很失望。 引用： 转自 PTT C_Chat Shift2 小圆与焰(妄想) 现在小圆面前最后没开示的情报只剩下一条：「你变成魔女之后会毁灭世界，没人打得赢」 小圆站在全剧分崩离析的人际关系中唯一的交错点。 她听过麻美的心里话，见过沙也加的眼泪，知道杏子的决心 那么，也该是时候让焰对她坦白一些事了吧？直到现在，小圆和焰的交集是很单方面的，小圆仍然不懂焰究竟要什么。这集揭示了焰的过去，那下一集就该让小圆去接触这一块东西。 小圆无论如何都要签约时，我想焰会搬出这最后一条情报来阻止她。 如果小圆作出了之前同样的决定，我想小圆就会击倒魔女之夜而存活， 并且以她宁死也不愿魔女化、仍然要为他人而战的勇气，说服焰不再loop。 -—-我很喜欢这篇分析w 引用： 翻译转自PTT C_Chat enfis(猎户座与天蝎座的故事 vs 红毛蓝毛故事) 由于外星人出现，所以老外的考据也走向星座了吗XD *”Orion was the son of the sea-god Poseidon”- the reason for Sayaka’s fish form .* “奥利安为海神波赛顿之子(本集さやか的人魚造型) *”Odysseus sees him hunting in the underworld with a bronze club”- first time we’ve seen Sayaka in a barrier(underworld) , she carried a golden(bronze) bat.*奥德修斯看奥利安以青铜棒在阴间狩猎(さやか首次跟麻美姐去见习的时候也有青铜棒)(如下图) *”he hunted with the goddess Artemis and her mother Leto”- she hunted with Mami and Madoka .*他会跟女神阿耳忒弥斯和她的母亲勒托一起狩猎(这边指的是粉圆跟麻美) *”threatened to kill every beast on Earth”- kill every witch on the world .*大地之母看他不爽，所以派出巨大的蝎子去对付他(杏子登场，杏子的枪造型也像是蝎子尾) *”The creature succeeded, and after his death, the goddesses asked Zeus to place Orion among the constellations.*蝎子成功了，在奥利安死后，女神要球宙斯把奥利安放上星座 Zeus consented and, as a memorial to the hero’s death, added the Scorpion to the heavens as well”- and now they’re both in the skies .宙斯答应了，同时也把蝎子放上，跟奥利安就一起成为了星座──天蝎座跟猎户座(两个人一块自爆了(っ･ω･)っ(拍拍) 顺带一提，这两个星座永远不会同时出现在天空上，一个落下另一个就升起天蝎座，跟杏子的锁链枪蛮像的猎户座，魔女化さやか脸部的三个圆圈是不是刚好等同猎户座的腰带-–很有趣的讨论XD 满有道理的~ 引用： 转自PTT C_Chat greydust(杏子心境讨论) さやか这个结局(还是还没结局? 不过我是相信两个人都便当了啦),虽然从她变成魔法少女的那一刻就已经注定, 不过还是会让人很感叹啊(尤其是上一集)只能说一直让我想到这句台词:You either die a hero (マミ) or you live long enough to see yourselfbecome the villain. (さやか) 这篇主要是想讨论杏子(不可免俗的还是要强调一下, 我从第一集就是ほむら派)杏子就我看来, 她對さやか就是很简单的投射心理而已 杏子的行为从头到尾都很一致, “不希望其他人跟她一样”所以一開始さやか那個樣子, 杏子就打她是因为看到过去的自己而生气吗? 还是有更多其他的理由我也不知道虽然第六集的時候さやか说雙方打到最後是真的想要杀掉对方但在没有明确的解释之下, 我觉得那只是為了表現出さやか心中的”憎恨”罢了 后来soul gem的事情爆发, 杏子反而去開導さやか如果前面所作的是為了把さやか打醒, 那这边就是意识到这件事对她打击很大了于是伸出了援手. 可惜的是这只是杏子單方面的認為さやか需要援手而已實際上さやか根本拉不下脸来和解, 也没有经历过那一段残酷的现实接著さやか開始暴走, 杏子開始為她奔波. 也是延续着这一段. 而第九集整个我觉得是刻画杏子内心的高峰, 也是句点. 一开始杏子只是抱持著さやか跟她有相同的经验.而杏子的过去没有人帮助她, 她靠自己的力量得出了不为他人使用魔法的结论.所以她希望可以帮帮さやか. 但是在ほむら说出”魔法少女终将成为魔女”以后, 也打碎了杏子的防线. 靠着去拯救さやか, 杏子最想拯救的其实是她自己.所以她不停的问 “没救了吗?” “所以说还有你不知道的方法?”其中她問まどか的一句話我覺得最為傳神 “救不了的话, 就不管了吗?” 我仿佛看到杏子这么问着:“如果我也这样没救了, 会有人帮我吗?”很顯然ほむら不會, 但是まどか會. 如果这个友情的羁绊真的这么强烈这次可以拯救さやか, 那下次搞不好就可以拯救杏子自己. 可惜的是在虚渊玄的故事里面从来就没有什么友情的羁绊这种鬼东西 于是在杏子向神祈禱以後, ほむら出現了. 虽然杏子什么都没说, 可是我看到的感觉是:“哈哈.. 果然你才是对的. 像我们这样子, 本来就是没救了呢” 所以杏子也放弃了一切. 与其最后变魔女与其要去杀死原本一直想拯救的, 与自己过去神似的晚辈.不如就在这边把一切结束. 在最後道別的時候, ほむら明顯的有了表情让我觉得, 其实这部片里面所有人都是一样的さやか想借由拯救所有人来拯救自己, 所以牺牲了.杏子想借由拯救さやか來拯救自己, 所以牺牲了.ほむら表面上看起來什么也不管, 其实她也想拯救まどか而且拯救まどか對她来说应该有什么重要的意义, 而我认为这与杏子如出一辙.(所以接下来换她牺牲了) 除了目標不明的マミ和總是被阻止的まどか其他角色真的是都有爱的很可爱啊, 虚渊玄果然没有辜负他自称爱的战士 -–超棒的杏子分析 ｡ﾟ･(つД`)･ﾟ 引用： 2ch对Charlotte的有趣分析*155 名前：風の谷の名無しさん＠実況は実況板で[sage] 投稿日：2011/02/28(月) 20:23:21.33 ID:VHfOtOKt0*シャルロッテは病院で発動薬品とお菓子のイメージ＝末期の不治の病でお菓子を食べたかった(Charlotte结界中，药品跟甜点的image表示Charlotte罹患末期的不治之症，所以不能吃甜食) もしくは過食と拒食を繰り返してた？(厌食和贪食这两种情绪不断反复着?)シャルロッテの結界で一瞬出てくるこれ 外来で抗癌剤治療受ける外来科学療法センターに似すぎなんだわ。(这景象跟治疗癌症的癌症中心很相似)ウエの番号とかベットの並びとか(像是序列的号码啦，跟床的摆放方式) ちなみに抗癌剤治療してる間はお菓子は食べていいけど、(顺带一提癌症的治疗期间虽然可以吃甜点)チーズとか一部発酵食品は禁止。(但是禁止吃芝士之类的发酵品)ソースは抗癌剤治療中の俺。(消息来源在化疗中的这位2CH乡民ˊxˋ) もしシャルが小児がん患者だったら、そんな子を契約させたQB…(如果Charlotte真的是幼年癌症患者的话，在濒死时跟QB签约….) 以下是转自PTT的相关讨论 Kusari 目前2ch现在正在热烈讨论Charlotte到底代表什么首先有人提出夏洛特的结界后者是哪里呢？癌症中心….目前治疗乳癌用的紫杉醇(taxol),必须避免与Trp或是其前趋物5-HTP一起服用, 否则会增加Taxol的副作用 而含有高量Trp的食材包含金枪鱼,蛋,坚果类,牛奶和奶制品….→所以Charlotte不能吃芝士最后Charlotte被学姐打败后二段变身成惠方卷代表癌细胞的转移与不死性(目前最早被发现的癌细胞在主人死了之后依然还活着) 所以有人猜Charlotte本来是幼年癌症患者,在濒死时和QB订下契约… -–Charlotte变成魔女的原因(喂)Charlotte变成魔女的原因(同人补完版｡ﾟ･(つД`)･ﾟ) (请看这帖的回复#61楼~) 引用： 本文转自PTT C_Chat dotZu*「若不啄破蛋壳的话，蛋壳里的雏鸟将因无法诞生而死去。 吾等就是雏鸟、蛋就是世界， 若不打破世界之壳，吾等将因无法诞生而死去。 将世界之壳破坏吧！为了让世界革命！」 ––《少女革命》* 本来标题要打成「蛋的联想」，但是觉得这样会不会太强调剧中有蛋了， 所以改成较无特定意义的「蛋蛋的悲伤」，完全是无意义的标题。只是后来想想，还真的是「蛋蛋的悲伤」没有错。（以下会解释） 事情是这样的，说到那个孵化器（育成中心），我不知为啥，想起第一话当中，老师所说的话：*「各位同学！蛋要吃半熟的好，还是全熟的好？ 没错！两者都可以！各位女同学，请务必不要和只吃半熟蛋的男人交往， 各位男同学，长大以后千万不要成为只吃半熟蛋的男人！」* 看上去只是一句无关紧要的闲聊对吧？不不不，看上去这句可是在描述真正核心的主要剧情啊！这部作品，剧情密度还真的是相当高啊！ 在魔法少女小圆 08 当中，我们看到灵魂宝石（Soul Gem，SG）会转变为悲伤之种（Grief Seed，GS），也就是魔女之卵。 先前就有西洋人观察到，**灵魂宝石的外观长得很像一种蛋雕艺术品，这叫做「法贝热彩蛋」的样子，是俄罗斯工匠所制作的华丽蛋雕，**在剧场版《名侦探科南：世纪末的魔术师》当中登场的就是这个东西。 而 06 话当中出现的童谣()，主角是「蛋人」，他坐在墙上，不小心掉下而摔碎，就算国王出动了多少人马都拼不回来。 相当符合剧情，从这里我们也可以认知到，灵魂宝石是颗蛋。编剧虚渊在此给了较快乐的结局，童谣当中打破蛋壳是不可逆的。 我观察到，灵魂宝石转变为悲伤之种的过程，视觉上是原本四周栏杆状的保护条（蛋壳）消失，而向下伸出刺针，而这刺针就像图钉之类的，可以插在地上。 QB说过，灵魂宝石的优点，是有比普通人类有更佳的防护效果，由此可以知道， 那个保护条并不只是视觉上的设计，说它有加强防御力的用意在，应该不算错。 而向下伸出的针，我把它联想成雏鸟的鸟喙。有点牵强就是了。 但是从 08 话 QB 所说，「还未成长的魔女，称为魔法少女。」我想「打破蛋壳」这个含意，应该是没有错的。也就是说，这是成长的必然。（至少 QB 这么认为） 少年少女成长之后，就成了污秽的大人；灵魂宝石成长之后，就成了悲伤之种。蛋成长之后，就成了……还是一颗蛋。 一颗成长过的蛋，但是还没完全长成魔女，所以是魔女之卵。但是成长是件很痛苦的事，有些人会因此累积了负面能量。 圆和妈妈的对话：「那不是很痛苦吗？」 「每个大人都很痛苦的，所以才能喝酒呀。」圆妈也说，但是变成大人不是只有痛苦，也有很多快乐的事。但是小圆的回答：「真想快点能和妈妈一起喝酒呢！」 不觉得这句话，现在看上去，是个成长 flag 吗？（抖） 灵魂宝石是个蛋，悲伤之种也是个蛋，所以还真的是蛋蛋的悲伤。 小圆04话说过：「活着才能吃到蛋，真是太幸福了。」说不定QB就是许了一个「活着、吃蛋」的愿望，才成为QB哦； 他是个只吃全熟的蛋的男人，全熟＝全黑。所以，老师有说过：全熟、半熟两种都可以，不要挑食的男人交往；这其实是在提醒大家，不要和挑食的 QB 签约， 因为半熟的他不吃啊，看到蛋就想做成全熟的……。 -–(超棒的蛋推论XD 快承认你就是虚渊吧!!(ry)) 引用： 本文转自PTT C_Chat evilsura*与魔鬼战斗的人，应当小心自己不要成为魔鬼。当你远远凝视深渊时，深渊也在凝视你。 －－尼采* 虽说”魔女是由魔法少女转变而来”这点已经是大家都猜到的了不过看到sayaka肉体与精神一同崩落的瞬间，还是让人很伤心啊。 在看着sayaka心路历程转变以及魔化的过程中，我一直想到安徒生的《小美人鱼》，童话中的小美人鱼救了王子一命，又为了王子放弃了人鱼的身份以及天籁之音，王子却错爱别人，小美人鱼最后化为泡沫。但小美人鱼对于自己将会化为泡沫这件事是了然于心的，她宁可如此也不愿伤害王子， sayaka为了上条而许愿，也因此牺牲了自己却直到堕落前的那一刻都不知道，自己变成了自己眼中最不能容忍的存在。 从这集也可以看出sayaka对上条用情之深，sayaka在与魔女对战所用的治疗魔法，甚至在黑化的眼中，都是音符和五线谱，想当然尔在这些符号的中心…自然是那位上条了(只不过是断头的跟沾满血的上条君…)从sayaka当时穿的衣服胸前有个C来看，这或许就是她身为魔法少女符号的来源，**sayaka可以说是整个世界都绕着上条在打转，为了他当上魔法少女，也为了他成为魔女，初恋嘛，总是最纯粹最刻骨铭心跟最傻的那个。** 新房在画面处理中，把sayaka充满污秽的灵核和转化为魔女的过程，都加入了泡沫的元素， **如果说小美人鱼是因为爱的光明面才变成了泡沫，毫无疑问的sayaka则是因为另一面而使然，** 在第四集营救madoka和hitomi的时候，面对madoka的困惑，sayaka曾笑笑说了一句:”嘛，该说是心境的变化吗?” 然而这次心境的遽变，她却没能渡过。难怪魔女们带着的叫做悲伤之种，因为是希望转为绝望之间所必经的结晶啊。(不过我觉得这个名字应该也是个伏笔，帮初看学姐介绍的时候就很困惑了，不知情的魔法少女应该是不会给它取这个名字的，QB更不像是会取这种名字的家伙……那到底是谁取的呢?) 另外贴一些我觉得很有意思的点：(1)这一幕是sayaka迁怒到madoka的时候，可以看到sayaka身后已经被扭曲成笼状，或者卵状，非常呼应她的灵魂在卵(灵核)内也一并扭曲的情形。(2)杏子被吹的方向刚好跟背后看板箭头的方向一致wwwww不过如果搭上这张图片大概就笑不太出来了… 只有头跟身体是分开的…拜托不要啊Orz 感想到此，谢谢大家收看~-–(沙耶加=小美人鱼那边很有道理呢w) 引用： 2ch的剧情推测(翻译转贴自Komica，ID:QRSyz42Q)，我开始相信你了 /口\\ ↓ 結局part2スレのこれが正解で、本当のネタバレ919 名前： 進藤ヒカル(香川県)[sage] 投稿日：2011/02/05(土) 10:53:24.59 0そろそろ良い顷合いなので、ネタバレすると QBは悪魔 （QB是恶魔）少女の願い事を叶える代わりに魂を奪う （实现少女的愿望的代价就是夺走灵魂）魂を奪われた人＝魔法少女 （被夺走灵魂的人=魔法少女）一度魂を奪われると二度と元の人間には戻れない （被夺走灵魂的话不能再次变回普通人） そしてそのまま時間が経つと （而且经过一段时间之后）空っぽの魂の器が暴走して化け物＝魔女になる （空虚的灵魂容器就会暴走变成怪物=魔女） 化け物になりたくなければ、魔女を殺し続けて （如果不想变成怪物的话，就要猎杀魔女）彼らの生命の残滓から、仮初めの魂(シード)を奪い取り （去夺取他们的生命残骸，最开始的灵魂）自身の魂の器を補強するしか無い （来增强自己的灵魂容器） 魔女は正気を失っているが （魔女虽然已经失去意识了）二度と戻らない人間性を取り戻そうとして （但是为了取回原有的普通属性）人間の魂、特に魔法少女の魂の器を狙うようになる （会不断的猎捕人类的灵魂，尤其是魔法少女的灵魂容器） そして延々と戦いが続いてきた （战斗就这样一直的持续着） まどかは、この世で最も大きな魂の器を持つ少女 （小圆，持有这个世界上最大的灵魂容器的少女）その魂の大きさに目を付けたQBの策略によって （被她的大型灵魂所吸引的QB用计谋）情に流されて、魔法少女の契約をさせられる (これが1話) （骗取同情，让她交换了契约成为了魔法少女（这是第一话）） そして歴代最強の魔法少女になるが （然后变成了历代最强的魔法少女）ふとした事で魔女化の真相を知ってしまい （但是由于某件事知道了魔女化的真相）またもや情に流されて、魔女を殺せなくなる （又变得不忍心去杀魔女） その結果魂の器が暴走、最強の魔女になってしまう （结果灵魂容器暴走，变成了最强的魔女） まどかを倒す為に世界中の魔法少女が集まってくるが （为了打倒小圆全世界的魔法少女集合起来）あっさりと全滅して、世界は滅びを迎える （但是很简单的就被全部击破，世界走向毁灭） ただ一人残った少女、ほむらはQBと契約して魔女になり （只剩下最后一个少女，小焰跟QB契约变成了魔法少女）その願いである、時を越える力を使って過去に飛ぶ （利用她的愿望，穿越时间的能力回到了过去） もしかしたら滅びの運命を変えることが出来るかも知れない…… （或许能改变着破灭的未来）儚い願いを抱いて過去に飛ぶほのか （怀抱着这样的愿望回到过去） 果たして彼女の願いは叶えられ、世界は滅びから救われるのか （到底她的愿望能否实现，能否从灭亡中拯救世界）それとも変えられない運命が待っているだけなのか──── （还是说即使这样也还是有无法改变的命运在等待着他们呢——）────その答えの全てが最終回に！！！！！！！！！！(自主规制) （——答案全部在最终回！（自主规则）） 引用： 追加情报 转自PTT C_Chat enfis「魔女之夜」本身就是魔女的名字，是一个要组队才有办法刷的副本 雑誌インタビュー-キュウべぇは殺された！と思ったら、直後に復活しましたね 虚渊：前の個体の損傷が激しくなると、自動的に次の個体が生成されます。そして魔法少女がキュウべぇを殺すと、ペナルティとしてソウルジェムの濁りを濃くされてしまいます。 それもキュウべぇは説明していませんが（笑）ちなみにキュウべぇが自分の死体を食べたのは、体がこの世界にはない物質でできており、その証拠隠滅のためです。 简单翻译：(1) 前一个个体受伤太严重，会自动生成新的个体。(杀了一个还有千千万万个)(2) 杀了QB还会附加Soul Gem混浊的惩罚…(3) 这些内容QB当然没有说明。(4) 会吃掉自己的尸体，是因为身体是由这个世界没有的物质构成，所以吃掉湮灭证据 阿虚，这种的爆雷没问题吗? /口\\ 引用： 翻译转自 PTT C_Chat enfis疑似是Megami MAGAZINE的情报，未确认是否为真： ・ＱＢは最後までＱＢらしい所诠奴はシステムの歯車でしかないのか・・・希望は何処に・・・ 不负责翻译：QB就只是QB，既不伟大、也不卑微！它也不过是系统中的一个齿轮。 ・ＱＢはウソを言わない。「彼女一人では荷が重すぎたんだ。」パートナーのまどかがいないから、ほむら一人。不负责翻译：QB不会说谎，第一集开头说「这对她负担太重」是因为搭档粉圆不在，只有焰她一个人。 ・ほむらは弱い。不负责翻译：焰很弱。 引用： 翻译转自 PTT C_Chat enfis 1.红青同属速度＆力量型2.两人实力差不多，红因为技术上较好，所以对上青时会占上风3.红防御力低下但技术较好，青强在回复力跟防御力4.焰的强度设定是『只是变身了的普通少女』 除了有操纵时间以外算是较弱的魔法少女，不过变了身还是比普通人强一点5.上一篇提到的黑猫＝焰是看了杂志的人写的评语，不是杂志写的。 引用： 翻译转自 PTT C_Chat tsunamimk2出处：http://kamome.2ch.net/test/read.cgi/anime/1298821215/516补充一些MEGAMI杂志的小圆情报 MEGAMIのまどか関連のネタ読み終わった ・ほむらは魔法少女の中で最弱で補うために小細工してる(ほむら為了補自己是魔法少女中最弱的事实采用了一些小手段) ・杏子は防御に難があって攻撃を受けると脆い設定(杏子是个不擅长防守又一但受到攻击就容易critical hurt的角色) by Profaner ・人を殺したキャラが幸せになることはない(杀了人的角色是不会获得幸福的(暗指沙也加?)) ・キュウべぇは合理的すぎてﾀﾞｰｸｷｬﾗに見られている(QB因为行为过于合理而被看成黑暗角色) ・キュウべぇは最後までキュウべぇ(QB到故事的最后都是QB ) ・まどかはそろそろ変身する(小圆快摆脱废怯了) ・魔女に忠実な使い魔は1,2話に出てくるやつぐらい (对魔女忠诚的使魔也就只有第一, 二话登场的那几只) by enfis ・一期だけで風呂敷を畳むつもり (只有准备作一期的梗)-–どうやら二期が無さそうなのが残念だ (看来应该没有第二季了，真可惜~) 引用： 岛民(ID:f1uY.2/o)的推测：(转自Komica)这套新番应该分四部分(本作原名Magica Quartet魔力的四部曲?)第一部以学姐的死(1-4)作序 (所以OP窗上的雨是橙色?) 以小圆忘记过去的悲痛作开始(浮士德被”忘泉”淋浴)第一话中小圆被床上起来是指浮士德在忘却以往的事之后起来在一个“妩媚的地方”醒来然后小圆遇上学姐，学姐的死令小圆尝试以生存为人生目标 这部学姐代表太阳，小圆代表浮士德因为太阳的刺眼(学姐的死)令浮士德(小圆)欣赏大地(象征生命)(浮士德II 第一、二幕) 目前的是第二部以沙也加为主线(所以OP窗上的雨是蓝色?)沙也加契约使右手康复结果右手被绿毛NTR最终沙也加坏掉 中间加插的红毛(估计下话领便当)大概代表被Gretchen所杀的母亲 这部右手代表浮士德，在魔鬼的帮助下康复绿毛代表与浮士德幽会的魔女沙也加甘愿成为丧尸所指的大概就是浮士德中Gretchen精神失常，无意逃走吧(浮士德I)第三部大概会是女巫之夜的开始在此黑毛应该会表演穿越时空(超期待的(浮士德II 第二幕) 第四部分我就不猜了，而且也不知道会不会这样分 资料自WIKI 引用： 新的死亡顺序说─ 第六画出现的伪DDR「dog drug reinforcement」（药物强化犬）对照第三话死亡警告(?)的Caution图发现相同点了吗?第三话死亡警告图右下角插着针筒的犬(狗)正好跟DDR的名字「药物强化犬」相同意思死亡警告图线索=左边(沙耶加) +中间(麻美)+右边(杏子) 而且警告图里面，中央人物头被砍下来(同麻美)，于是可以推测接下来可能死状是左边(沙耶加) = 被砍头，或者穿肚(正好沙耶加变身后灵核在肚子上)右边(杏子) = 被砍头，或者被烧死(烧死的话灵核大概也…)(因为另外两人都是衣服的颜色确定是谁的，而右边却是以肤色，灰暗的衣服代表被烧过?)(众：转得好硬w) 接着我们看下一张图：由警告图我们可以知道：画面中的人物顺序代表：左边(沙耶加)+中间(麻美)+右边(杏子) 注意上一张图的顺序，对照跳舞机机型的号码，注意到了嘛?机型顺序(面对屏幕)： 2 1 3这顺序另人想到敏感的死亡顺序呢(笑) 我把顺序并在一起大家比较好懂~ ②左边(沙耶加)+①中间(麻美)+③右边(杏子)这恐怕就是死亡顺序了….(抖 之后的clear分数(2513940)跟破关画面里的猫还是谜团就是了…clear分数跟这张图是否有关系呢? 引用： 一切都是恶魔的策略假设说─ 既然一般的人类看不见魔女，那到底是谁开始知道需要魔法少女签约对抗魔女呢?这样的系统是谁做出来的?是谁设计的? 用这种想法去思考的话 魔女之类是不是根本就不存在?恶魔想要人的灵魂，但是因为人心太过封闭/坚固，没办法取得灵魂恶魔心想 以前用邪恶的诱惑引诱人类的灵魂，这种被强烈抵抗的事迹实在太多了 于是恶魔这样考虑着：不要明显地使用恶的诱惑(会有反弹/抵抗)，而是以欲望之罪让人类的心出现空隙 那就是「不管怎么样的愿望都能帮你实现」，但是这仍然失败了愿望虽然是实现了，给我们灵魂的人类却立场不坚，不是心甘情愿(?)站在我们(恶魔)这方 所以恶魔很苦恼，一直思考着该怎么做 「增加制造出其他的敌人，给予『把灵魂给我方的人类』力量，帮他们加上『正义的使者』的光环(魅力)会怎么样呢?」也就根据这点，齿轮开始大幅地转动了(开始有很多人心甘情愿把灵魂交给恶魔) 引用： 大雄的魔界大冒险假设说(のび太の魔界大冒険)─ 第一话比较版图：*夢の中で会った、ような･････*→ 开头都在荒凉的异世界(?)与巨大的敌人对决，同样在崖边望向巨大魔法力的构图十分相似→ OP结束后，刚刚的景象全是梦境，这两者是相同的→ 焰知道他们即将面对的悲惨未来，回到过去阻止小圆成为魔法少女哆啦A梦与大雄回到过去阻止过去的自己打开恶魔的盒子回到过去改变未来的结构相同→ 老师刚好说到”荷包蛋是全熟好还是半熟好?(下略w)”，而哆啦A梦跟大雄早餐刚好也是吃荷包蛋XD→ 都有个长得帅/漂亮，头脑聪明，运动神经出色的优等生来否定(?)主角→ 跟大家聚在一起聊梦的内容，却被当成笨蛋→ 但是，梦中看到的东西在现实世界也存在→ 当天晚上(?)，主角的周遭发生异变，同样地都有一方被虐待(被欺负?)逃来求救→ 有了进入魔法世界的新体验后，主角们又回到日常生活，而回到日常生活的时机(?)到此都相同 第二话比较版图：*それはとっても嬉しいなって*→ 魔法世界的生物(?)一般的人是看不见的→ 两者同时边吃点心喝红茶边说明魔法世界，而时间的经过同样到了傍晚→ 对魔法世界很在意的主角，首先先自己设计了一些构想。切入点相同→ 恶魔开始侵袭日常生活，但是却没有任何人查觉到变化/存在→ 魔法少女出现→ 棒子→ 棒子被魔法改良(?)→ 同样都有巨大化的武器 第三话比较版图：*もう何も恐くない*→ 一切的开端同样源自于交通事故→ 真的愿意跟我一起战斗吗?(流出高兴的眼泪)，之后没多久，主角的脸因变化而改变(颜艺?惊吓?)→ 主角要被吃掉了(但是哆啦A梦没成功)美夜子的母亲/麻美死掉时，红茶杯破掉的表现手法相同ed画面表现手法类似第四话比较版图：*奇跡も、魔法も、あるんだよ*→ 同样以主角们的素质劝诱他门进入战斗的舞台，但都因为恐惧战斗的心不参加，淫兽(喂)背对着离去。但是最后还是参战了(两者剧情展开完全相同)→ (用魔法把房间变干净─左)→ 麻美不在的房间…呜呜(下略)(众：喂)→ 两者同时有”现代医学办不到”的台词，而为了做到这件事，与恶魔签下契约→ 在电视中看见魔法少女的主角→ 在主角有难，飒爽登场（","categories":[],"tags":[{"name":"ACG","slug":"ACG","permalink":"https://www.hee.ink/tags/ACG/"}],"author":"天使の翼"},{"title":"浅谈2018年国内安卓手机生态","slug":"浅谈2018年国内安卓手机生态","date":"2018-12-31T14:50:25.000Z","updated":"2020-03-03T09:18:24.102Z","comments":true,"path":"2018/12/31/浅谈2018年国内安卓手机生态/","link":"","permalink":"https://www.hee.ink/2018/12/31/%E6%B5%85%E8%B0%882018%E5%B9%B4%E5%9B%BD%E5%86%85%E5%AE%89%E5%8D%93%E6%89%8B%E6%9C%BA%E7%94%9F%E6%80%81/","excerpt":"","text":"2018年就要画上句号了。有人说，这是极不平常的一年，因为老天对世人太不公了，竟招了这么多创造者或是伟人回去。 但对于国内安卓生态的发展，2018是极具革命性的一年。 2018，国内安卓设备百花齐放，在创新路上披荆斩棘，创新领跑世界。 2018，统一推送联盟取得巨大进展，2019年就将开始全面使用。 2018，绿色公约取得部分厂商和开发者支持，后台纯净和更完善的隐私保护策略离Android用户越来越近。 2018，中国厂商的设备首次进入Google的Android Pie的Beta测试计划。 2018，随着Project Terble的推广，以华为为首的中国厂商，升级Android底层积极而迅速。 2018，Android 9更新引入了更完善的后台机制，更好地从底层制约了部分国内毒瘤应用的流氓行为。 2018，Google宣布将禁止TargetSDK版本低于26的应用在Google Play Store发布更新，腾讯及阿里的主流应用如微信（目前仅有Beta版升级）、QQ（Play商店版）、支付宝和淘宝等应用，都已将TargetSDK Version升级为26，达成了后台纯净。 2018年是手机市场大洗牌的一年。国内智能机市场逐渐饱和，4G带来的换机浪潮也已结束，5G时代即将来临。随着相关技术的成熟，手机的耐用程度大大提升，用户的换季周期增长。在这样失落的一年里，金立倒下了，锤子快凉了，中兴也受重创，美图这个小众品牌也被收购。 但在这个多难的2018，华为无疑是一个响亮的名字。尽管华为的营销手段和处事态度遭到部分用户的唾弃，但不能否定的是，华为是国内最具实力、最能创新也最值得尊敬的一家厂商。今年Q3季度，华为手机的出货量首次超越Apple，成为世界上第二大的手机厂商。 如今，华为已经不再是那个拿着单反样张做广告者。如你所见，华为成为一个创新者和引领者——华为P20 Pro已经在DxO霸榜多时。其优秀的夜间拍摄模式展示了华为高超的软实力。华为被吐槽多时的GPU性能也得到了改善。华为的GPU Turbo大幅提升了手机的游戏性能，可谓是今年最震撼我的新技术。海思麒麟980这颗Soc，领先同期竞争对手高通的骁龙845（不过似乎略微落后于现在最新的骁龙855），扬眉吐气。 OPPO和vivo两兄弟，也在2018跳入了创新的圈子，分别重启和开创Find和Nex两个高端产品线，核心技术令人惊讶。 对于安卓的玩家们来说，“Android By Google”开发无疑是一个常识，但由于特殊国情，谷歌的服务在大陆完全无法使用。这使本来就管理较为宽松的安卓系统在大陆显得更加混乱——没有了统一的标准制定者。 Google服务主要带来以下功能：统一的经过严格审核管理的应用市场；完善的云服务和自动备份，能够自动同步你的通讯录、短信、通话记录、应用、相册、邮件、手机找回和账户密码自动填充等；统一的消息推送，能使不在后台常驻的应用及时推送消息，省电而便捷；归属地显示、骚扰电话标记、垃圾短信拦截及短信验证码复制；Google Assistant语音助手及其衍生产品；Google Feed资讯流等。 这些重要的功能在国内无法使用的现状促生了国内深度定制ROM的出现。小米MIUI以其较为完善的云服务和细节体验闻名，华为EMUI则以18个月不卡顿为核心卖点。但不得不说，搭载完整谷歌服务的原生安卓手机在英语环境下的体验是优于国内定制ROM的，因为更加简洁纯净。 2018年国内厂商的Android底层升级更加迅速，Project Treble的引入使厂商更快适配新系统，国内手机也不再是一次性买卖——华为、小米、一加等厂商已经为旗下旗舰手机升级到了最新的Android 9.0。这些国内深度定制的ROM在大陆通常比原生Android易用。 国内没有统一的推送服务，所以厂商们纷纷推出自己的推送接口，如小米MiPush，华为推送等。厂商们的构想很美好，但是由于这些推送端口的局限性，大多数开发者弃之不用，转而研究后台常驻的方法——因为支持推送的手机为少数，而社交软件必须保证所有用户及时收到推送；再者，适配厂商的接口也需要时间和精力。 后台常驻的代表如QQ、微信、淘宝等，这种方式确实能及时给用户推送新消息，但是使设备的续航大大下降。国内应用甚至发明了后台播放空音频文件保活、激活设备管理员权限、接收系统广播自动唤醒以及让人深恶痛绝的交叉唤醒。 交叉唤醒指在其他应用启动时，自动启动一大串的其他应用，一大家子不请自来，其乐融融。各大厂商，就算是老冤家干起这事儿来也是称兄道弟，通常一个应用启动时能唤醒手机中数家公司的应用。由于苹果iCloud服务的正常运营和严格管理，在后台管理及推送方面，iPhone的体验优于Android（即使是国内深度定制ROM）。 谷歌为了防止这事儿，限制了应用的权限，收紧了唤醒机制的管理，后台机制变得更加严格。在2018年，Google宣布将禁止TargetSDK版本低于26的应用在Google Play Store发布更新。Target SDK Version指应用目标运行的设备的版本，Google在API26上做出了较为严格的后台限制。同时，在统一推送联盟和绿色公约的推动下，国内的应用消息统一推送成为可能，统一推送的实现将给Android用户们带来更好的体验。 在2018年下半年，阿里所有在Google Play Store上架的应用都把目标版本升级到了API26，实现了后台纯净。阿里系App本遭广大用户诟病，淘宝这个国民级App一度被调侃为终极跑分神器——糟糕的优化使其在最高端的安卓旗舰机上也无法流畅使用。在最近几次更新之后，淘宝变得渐渐流畅了，支付宝冷启动也变快了。 阿里无疑是国内在新标准新技术方面的领军人物。支付宝早早适配了Shortcut功能——类似Apple的3D Touch，只不过是借助长按应用图标就能直达部分软件功能。使用此功能快速打开支付宝付款码或扫一扫功能，会略过启动页，带来极其流畅的体验。可惜的是，这个功能在不少国内深度定制ROM上被阉割，不过用户可以通过安装第三方桌面启动器来体验。 值得一提的是API26引入的自适应图标功能。一直以来，Android应用的图标缺乏统一的规范，iOS等系统统一的图标风格让人羡慕。图标设计风格和遮罩形状的统一，无疑是强迫症患者的福音，用户的使用体验也有了较大的提升。支付宝也适配了自适应图标功能，即用户可以自由地决定图标遮罩的形状，带来了更加美观的启动器Icon（这个功能在深度定制ROM上仍惨遭阉割）。 本来我打算在这里指责一番腾讯，没想到就在我写文前不久，微信Android v7.0.0的更新适配了自适应图标。对Google标准的跟进也是今年国内Android生态的极大改善。不过，国内大量App依然使用传统的图标（尤其是外包公司的作品），我希望国内开发者能积极跟进Google的新标准，毕竟着不是什么难事。就以自适应图标的适配来说，开发者只需要在Android Studio左侧项目目录右击-New-Image Asset就可以启动Google内置的图标设计器，适配全程耗时不到三分钟（作为Android开发者的我亲身测试）。 今年国内Android应用的流畅程度有了改善，手机淘宝在中端手机上也能流畅运行了，但是不知为什么安装包依然在不断加大（我没仔细看，感兴趣的朋友可以反编译看看）。不少国内深度定制ROM也增添了预加载常用应用的功能，使应用启动更快、使用更加流畅。 这一年以来，国内Android生态无疑是改善了。但有一点我很担忧，就是App设计的进一步iOS化、去Material Design化和大量的增添广告。一直以来，国内的开发者以iOS为原型进行UI设计，只有极少数的开发者针对不同系统设计不同UI。而这些良心的少数开发者，大多在2018年放弃了Material Design，全面拥抱Apple标准。知乎前期Android版的UI设计堪称典范，完美诠释了Google的Material Design，操作逻辑简单易懂，设计清新美观。而今天，MD设计已经在知乎上消失的无影无踪了。哔哩哔哩、酷安等App今年也经历了这种变化。 出现这种情况的原因是多方面的，比如开发设计成本、用户学习难度。在好多年前，微信曾经有过基于Holo Design的版本，但遭到了大量用户的吐槽。这种吐槽大多是由于当年Android设计的不成熟引起的。依我看来，今天的Material Design已是值得各大厂商推广了。我希望大厂们能够有一套独立的Android UI设计，毕竟，不同的系统本该就有不同的体验；再者，有能力推广标准的也只有大厂们了。 感谢这一年来广大开发者、Android爱好者以及每个用户做出的努力，希望国内Android生态的明天更加美好。","categories":[],"tags":[]},{"title":"Flash——早该覆灭的王朝","slug":"Flash——早该覆灭的王朝","date":"2018-07-17T12:50:25.000Z","updated":"2020-03-03T09:17:59.792Z","comments":true,"path":"2018/07/17/Flash——早该覆灭的王朝/","link":"","permalink":"https://www.hee.ink/2018/07/17/Flash%E2%80%94%E2%80%94%E6%97%A9%E8%AF%A5%E8%A6%86%E7%81%AD%E7%9A%84%E7%8E%8B%E6%9C%9D/","excerpt":"","text":"Flash Player是一个耳熟能详的名字。1997年问世Flash陪伴着一代网民的成长，这其中就包括了00后的我。Flash由著名公司Adobe运营并开发，内置了脚本语言AS，由于其使用矢量图形实现数据最小化，在低速互联网时代成为了开发互联网应用程序、视频音频的绝佳工具，甚至沿用至今。 为什么我们要弃用Flash？ 于官方宣传全球十几亿用户的光环下，2010年4月Apple前CEO史蒂夫·乔布斯发表了一封著名的公开信，批评了Flash的安全性和稳定性，并指出不会在任何Apple的移动端设备上支持Flash。在此之前的二月，Adobe因为没能修复Flash已知漏洞一年而道歉。 由于Flash数以百计的安全漏洞，昔日的王者竟成了骇客的温床——2009年Adobe公司亲自承认“Flash Player所列出的所有互联网技术（包括网络插件和浏览器）的漏洞数量排名第二”。著名安全公司卡巴斯基也于2012年的报告指出“Flash Player漏洞使网络犯罪分子能够绕过集成到应用程序中的安全系统。”随后曝光的漏洞“Magnitude”又能轻易地让骇客远程执行代码。 可以说安全性是Flash最大的问题，然而弃用Flash的理由远不止这一点——Flash的隐私性同样被人诟病。 Flash在计算机本地保存数据，由于站点可以通过Flash cookies检索其他站点保存于本地的用户信息，例如身份验证信息、游戏高分或保存的游戏、基于服务器的会话标识、站点首选项、已保存的工作或临时文件，从而建立用户档案，甚至出售用户数据。如今在Chrome等著名浏览器的最新版本中Cookies的本地储存功能已被禁用。 随着比Flash更优秀的后来者HTML5标准制定的完成，Flash的处境显得尴尬透顶。根据Wikipedia的释义：“HTML5是HTML最新的修订版本，由万维网联盟（W3C）于2014年10月完成标准制定。目标是取代1999年所制定的HTML 4.01和XHTML 1.0标准，以期能在互联网应用迅速发展的时候，使网络标准达到匹配当代的网络需求。广义论及HTML5时，实际指的是包括HTML、CSS和JavaScript在内的一套技术组合。它希望能够减少网页浏览器对于需要插件的丰富性网络应用服务（Plug-in-Based Rich Internet Application，RIA），例如：Adobe Flash、Microsoft Silverlight与OracleJavaFX的需求，并且提供更多能有效加强网络应用的标准集。” 用浅显易懂的话来概括，即“HTML5是一种功能上能代替Flash，性能、安全性及隐私性均大幅超过Flash的标准”。 最近Flash发生了什么？为什么重新被推上风口？ 2018年2月28日，上海剑圣网络科技有限公司（即2144游戏）宣布获得了Adobe Flash Player在中国大陆地区的独家代理发行权。中国大陆的用户在访问Adobe Flash Player的下载页面时，将强制跳转到2144域名下的下载页面，同时会默认捆绑2144游戏中心，且取消捆绑安装的复选框位置隐蔽。近日网友发现大陆定制版Flash用户协议区域比Adobe公司的原版下载页面多了一条的《Helper Service服务协议》。 该协议的其中一部分写道： 2.2只要用户开始使用程序，即表示用户无条件的接受了本协议的相关规定并愿意受其约束，否则用户无权使用程序。 3.1这款程序是重橙提供的一款为用户更好的使用Adobe Flash Player的必要程序，没有程序，Adobe Flash Player无法运行。其功能包括但不限于辅助Adobe Flash Player的更新升级等。 3.3用户同意本协议，使用程序，表示重橙已经明确告知用户，随着Adobe Flash Player版本的更新，程序将会自动静默安装新版本的Adobe Flash Player。 5.1用户同意本协议，使用程序，表示重橙已经明确告知用户，在用户使用Adobe Flash Player过程中，重橙可能会通过该程序收集用户的上网信息，以便为用户提供更好的产品和/或服务并改善用户体验。 5.2重橙承诺采取必要措施保护用户存放在服务器上的个人数据及收集到的用户上网信息的安全。除本协议约定的除外情况，重橙保证不对外公开或向第三方提供、公开或者共享用户的数据及上网信息。 5.3以下情况，重橙对用户的个人数据及上网信息的披露将不视为违约，具体包括： （1）重橙已经获得用户的明确授权； （2）根据有关法律法规的要求，重橙负有披露义务的； （3）司法机关或行政机关基于法定程序要求重橙提供的； （4）为维护社会公共利益及重橙合法权益，在合理范围内进行的披露； （5）重橙可能会和第三方合作向用户提供相关网络服务或者其数据收集工具用以完善自身服务，在此情况下，如该第三方愿意承担与重橙相等的隐私保护责任的，则重橙可在合理范围内对用户信息进行披露； （6）其他必须披露用户数据和上网信息的情况。5.4尽管重橙已经为用户的隐私权做了极大努力，仍然不能保证现有的安全措施使用户数据等不受任何形式的损失。用户对此情况充分知情，且不会因此追究重橙的法律责任。 经过简单的阅读就可以轻易得知，该公司按协议收集用户数据时、或是不慎将用户隐私泄露后也不愿负任何法律责任。 按Wikipedia的记录，中国大陆用户最后一个能正常安装使用的ActiveX和NPAPI版本是28.0.0.137，之后的版本均带有2144的进程“FlashHelperService.exe”，且无法关闭，如果关闭进程则Flash内容就会拒绝显示。Google Chrome自带的PPAPI版本不受影响。从Flash Player 30起，中国大陆的ActiveX、NPAPI和Win10上的PPAPI版本开始实行锁区策略，分成了全球版和大陆版两个独立的版本，即大陆用户无法安装运行全球版，中国大陆以外的用户无法安装运行大陆版。 在此事被曝光不久后中国定制版的Flash立即修改了用户协议，可谓是做贼心虚。除此收集隐私以外，经过笔者的实际测试，中国定制版的Flash时不时会给你于桌面右下角推送广告。 当然对此IT之家也给出了相应的解决方案，我不敢对此妄加评论（原因参照知乎），但是我只想说一下这件事情和一家名叫“苏州思杰马克丁”的公司有着千丝万缕的关系，感兴趣的朋友可以在知乎、Google上阅读相关内容。 弃用Flash的道路依然艰险 正是由于Flash的种种缺点，正是由于HTML5的种种优点，处于糟糕的国内互联网生态下，HTML5始终得不到全面推广，Flash依然广泛使用。Flash是网页牛皮藓们——贴片小广告的最爱，同时仍是少数几个国内视频网站的盈利大杀器。当你屏蔽了Flash，你也许会感觉整个世界都清净了。 每当我想要看CCTV5直播时，打开央视电视直播就必须启用Flash；打开教育局官网查询比赛程序，却发现网页内容七零八落——同是没启用Flash。在国际上极度打击Flash，Google、Microsoft、Facebook和Apple等强强联手推广HTML5时，国内生态让人心寒。多数国产主流浏览器仍默认启用Flash插件，流氓软件横行，网络安全更是无处谈起。同国内的Android生态一样，Windows生态也很糟糕，Flash仍是主流。在此特别点名表扬哔哩哔哩、微博（手机网页端）等国内优秀的HTML5站点，也希望这些站点能高举新技术好生态的旗帜，给中国网民更好的互联网环境。 另外值得一提的是，我国落后的信息技术教育助长了互联网流氓的嚣张气焰。作为一名准高中生，我发现我们的高中重要课程“技术”依然教授着古老的“Flash CS3”这种被淘汰了不知道多少年的课程。如同我当年学习信息奥赛时使用的、至今仍被传授给广大学生的古董级语言Pascal（不过即将被取缔），我不希望10后、20后继续学习诸如这类出现在父母大学课本里的古老“高新技术”。 22年了，Flash。你的时代，你的王朝已经结束了。 你永远活在我们的记忆里，或是那一个个网页小游戏，或是厌恶至极的网页广告都将会成为我们津津乐道的往事。 我希望和你说再见。","categories":[],"tags":[]},{"title":"【繁體鏡像】魔法少女小圓 內容考據","slug":"【正體中文鏡像】魔法少女小圓-內容考據","date":"2011-04-26T08:20:42.000Z","updated":"2020-08-30T03:55:46.679Z","comments":true,"path":"2011/04/26/【正體中文鏡像】魔法少女小圓-內容考據/","link":"","permalink":"https://www.hee.ink/2011/04/26/%E3%80%90%E6%AD%A3%E9%AB%94%E4%B8%AD%E6%96%87%E9%8F%A1%E5%83%8F%E3%80%91%E9%AD%94%E6%B3%95%E5%B0%91%E5%A5%B3%E5%B0%8F%E5%9C%93-%E5%85%A7%E5%AE%B9%E8%80%83%E6%93%9A/","excerpt":"","text":"原標題：廢怯少女小圓 內容考據(有雷)(4/26更新ver1) 作者：天使の翼 原網站：Game Comic Forum 原地址：http://www.gcforum.org/viewthread.php?tid=5721 字數：約53500字 此處的4/26是指2011年4月26日，這是一個老帖了。原帖已經404了，連Web Archive都打不開。現在也聯繫不到原帖大佬取得轉載授權，若有人能幫忙聯繫上就幫大忙了。如果您是原作者，認為這個鏡像侵犯了您的著作權，請直接在評論區留言，我會第一時間刪除。感謝天使の翼的考据。 看見Bangumi上依然有人討論，現特地整理並製作壓縮過的鏡像。如需訪問簡體中文的轉寫版本，請點擊此處。 圖片部分使用TinyPNG壓縮，不然原圖實在太大了，對設備和網速都不友好。不出意外的話，我這個鏡像站會在未來十年內持續提供服務。 以下是原帖內容： 廢 (ㄇㄛˊ) 怯 (ㄈㄚˇ) 少女小圓 內容考據(有雷)(4/26更新ver1) 魔法少女小圓 (魔法少女まどか★マギカ) (目前已完結) 引用：原作 - Magica Quartet ˇ監督 - 新房昭之 シリーズディレクター - 宮本幸裕 ˇシリーズ構成・脚本 - 虚淵玄（ニトロプラス） ˇキャラクター原案 - 蒼樹うめ ˇ音楽 - 梶浦由記 (可怕的四巨頭組合w 以下大部分內容整理自4chan(主)、維基百科(中&日)、PTT C_Chat、百度百科，2Ch，Komica，魔法少女まどか★マギカ官方網站(圖片點開可以放大) 整理者注：此处可能是原作者链接标错了，上面的链接指向《魔法少女まどか☆マギカ WIKI》。维基百科的URL应为https://wikipedia.org 目前出現的魔女引用： Gertrud - 蝶の羽を持つグロテスクな魔女。(第二話)Charlotte - ファンシーなぬいぐるみの姿をした魔女。見た目に似合わず強大な戦闘能力と特殊能力を誇る。(第三話)Suleika - 暗闇の魔女（未登場）。闇が深ければ深いほどその力は増す。Elly(Kirsten) - ハコの魔女。その性質は憧憬。 筋金入りのひきこもり魔女。 (第四話)Albertine - 落書きの魔女。（未登場）。その性質は無知。 かくれんぼが大好き。Gisela - 銀の魔女。その性質は自由。高速で移動する結界の中に潜んでいるが魔女自身は非常に愚鈍。 (第七話)Elsa Maria - 影の魔女。その性質は独善。全ての生命のために祈り続ける魔女。 (第七話)Uhrmann - 影の犬の魔女。(未登場)その性質は渇望。誰からも誰よりも愛されたくてしょうがない犬の姿をした魔女。(第八話)Oktavia von Seckendorff - 人魚の魔女。その性質は恋慕。在りし日の感動を夢見ながらコンサートホールごと移動する魔女。(第九話)Isadel - 芸術家の魔女。その性質は虚栄。自らを選ばれた存在であると疑わぬ魔女。(第十話)Kriemhild Gretchen - 救済の魔女。その性質は慈悲。この星の全ての生命を強制的に吸い上げ彼女の作った新しい天国（結界）へと導いていく。(第十話)Patricia - 委員長の魔女。その性質は傍観。蜘蛛のような糸を吐き結界内の空に自分だけの学園を作って学生達と変わらぬ日常生活を繰り返している。(第十話)Oktavia Von(第二版….) - 人魚の魔女。その性質は恋慕。ギターが鳴り響くコンサートホールの中で在りし日の感動を夢見続ける魔女。(第十話)Roberta - 鳥かごの魔女。その性質は憤怒。カゴの中で足を踏み鳴らし叶わぬもの達に憤り続ける。(第十話)?????(魔女之夜) - 舞台装置の魔女（通称・ワルプルギスの夜 / 本名不明）その性質は無力。回り続ける愚者の象徴。 歴史の中で語り継がれる謎の魔女。通称・ワルプルギスの夜。 (第十一話) → 取戲份最多的那一話XD 目前出現的使い魔引用： Anthony - 魔女の使い魔。おひげを生やした毛玉のような外見をしている。ハサミで手入れしようとする。おひげのセットは主が担当している。Adelbert - 魔女の使い魔。相手を足止めする蔦に変身する小型の使い魔。Pyotr - お菓子の魔女。その役割はチーズを探すこと。しかし過度な期待は禁物。Ulla - 暗闇の魔女の手下。その役割は夢。Daniyyel & Jennifer - ハコの魔女の手下。 その役割は運搬。 この手下がさわった物体はとても運びやすくなってしまう。Anja - 落書きの魔女の手下。その役割は童心。 ひとり遊びに夢中になっているうち 魔女とはぐれてしまった迷子の手下。 (第五話)Dora - 銀の魔女の手下。その役割は主張。体についたパイプから近所迷惑な爆音を撒き散らし気まぐれな砂嵐のように移動する。(第七話)SEBASTIAN’S - 影の魔女の手下。その役割は妄信。 影の魔女によって平等に救われてしまった命達の集合体。(第七話)Bartels - 犬の魔女の手下。その役割はインテリア。全く意思を持たずにただ回転しているだけのマネキン。(第八話)Bartels - 人魚の魔女の手下。その役割は演奏。 魔女のために音楽を奏で続ける虚ろな楽団。 (第九話)Michaela - 芸術家の魔女の手下。その役割は作品。魔女によって命を奪われた人間はその体の一部分を盗まれ、この中に組み込まれてしまう。(第十話)Mathieu - 委員長の魔女の手下。その役割はクラスメイト。足に履いたスケート靴で糸の上を優雅に滑走するがそれぞれは魔女が糸で操ってるだけであり意思を持たない。(第十話)Holger — Klarissa - 人魚の魔女の手下。その役割はバックダンサー。魔女の後ろで陽気に踊り続けるだけの存在。(第十話)Gotz - 鳥かごの魔女の手下。その役割は軽薄無思慮。群がる鳥は馬鹿な男達。(第十話)?????(魔女之夜的手下) - 舞台装置の魔女の手下。その役割は道化役者。 強大な魔力に引かれ集まった無数の魂。(第十一話) 文字：4chan討論的結果，廢怯少女動畫的原創文字是從德文改編而來(上圖有缺的部分是由於德文f,q,x出現頻率極低，加上目前動畫還沒出現對應的符號) 詳細文字對照在62#樓 故事：(第一話)第一集開場圖，引用自Prolog(浮士德)的一段話圖上的字是德文原文：Prolog im Himmel ，翻譯成英文是Prologue in Heaven也就是 在天堂的序言(Prologue in Heaven is the first scene of Faust)而正好Prolog im Himmel也是歌德的浮士德(Goethe’s Faust)第一篇的標題 這中間的核與第一話對照，似乎是相同的東西，但卻不明白這代表什麼意思 這個是布幕打開後，很快閃過的字，要順時針旋轉90度才看得出來，原文是TAGSCH是Prolog im Himmel中的一個片段，取縮寫 引用： 德文(Prolog im Himmel)部分原文：Sind herrlich wie am ersten Tag. Und schnell und unbegreiflich schnelle(Are wonderful as on the first day. And fast and incomprehensibly snaps) 第一話一開始出現崩壞的城市，鬧鐘響起，小圓起床究竟這是夢還是第二次loop? (loop的可能性很高)這張圖很明顯可以看出來，左邊是第一話一開始崩壞的地方，右邊則是小圓被QB聲音吸引而去的地方似乎可以看得出來這個地方是LOOP後才恢復的(?)時間軸如圖，可能是世界毀滅後焰許願回溯，來阻止小圓成為魔法少女 小圓的家取景自”House N” 引用： 更多資料請看 日本House N By Sou-Fujimoto建築事務所 焰轉學過來，同學位置好像怪怪的(作畫失誤?) Anthony，是魔女Gertrud的隨從，名稱含意是不祥魔女の手下。その役割は造園。おヒゲは魔女にセットしてもらう。(魔女的手下，工作是造園，鬍子是魔女賜的ww)這些品客(?)圍觀小圓他們所說的話：三國語言版XD 引用： Das sind mir unbekannte Blumen.(この花々は私には分からない花々だ ) (Those are unknown flowers to me. )Ja, sie sind mir auch unbekannt.( (そうだ、あの花々は私にも分からない物だ) (Yes, they are unknown to me too. )Schneiden wir sie ab.((じゃあ、切ってしまおう ) (Let’s cut them off.)Ja schneiden doch(?) sie ab.(そうだ、切ってしまおう) (Yes, let’s just cut them off. )Die Rosen schenken wir unserer Königin.(切って女王にこの薔薇を捧げよう ) (We present the roses to our queen.) 之後的秘境圖，字大多都跟上面有關~ 所以翻成簡單的英文我就不在翻中文了XD(眾：你好懶XD) 圖中原文： 引用： Die blühenden Rosen sollen der(上)(The blooming roses shall be)…bl[ü]henden Rosen sollen der(下)(… blooming roses shall be) 德文原文： 引用： Bekämpfe schädliche Insekten! (=Fight harmful insects!=撲滅害蟲) 德文原文： 引用： Kein Durchgang(=No trespassing=請勿擅入) 德文原文： 引用： Das sind mir unbekannte Blumen(=Those are unknown flowers to me) 德文原文： 引用： Königin sofort geschenkt sein(=the queen immidiately)Die blühenden Rosen sollen der(=The roses shall be presented to) 德文原文： 引用： Das sind mir unbekannte Blumen(=Those are unknown flowers to me)moero(=燃えろ=燃燒吧) 德文原文： 引用： Das sind mir unbekannte Blumen(=Those are unknown flowers to me)Die blühenden Rosen sollen der(=The roses shall be presented to) 德文原文： 引用： Kein Durchgang. Zutritt verboten.(=No trespassing. Entry forbidden) 德文原文： 引用： Königin sofort geschenkt sein(=the queen immidiately)Die blühenden Rosen sollen der(=The roses shall be presented to) 德文原文： 引用： Die ersten Knospen sollen gepflückt sein(=The first buds shall be plucked=第一個芽應該摘下) 德文原文： 引用： Kein Durchgang. Zutritt verboten(=No trespassing. Entry forbidden) 德文原文： 引用： Kein Durchgang(=No trespassing)Die Äste behindern Durchlüftung” Die üppigen Äste behindern gute Durchlüftung (=”The lush branches hinder good ventilation) 魔女祕境的圖，用羅馬拼音翻譯過來是けに来たよ，”來救你了”的意思這意思到底是”(麻美)來救你了”(為什麼會寫在魔女的領域內?)或主是魔女試著告訴我們他會救小圓呢?(如果是的話到底是為什麼?) 圖中出現的德文Bekämpfe schädliche Insekten!，翻譯成英文是Fight harmful insects!(撲滅害蟲) 左半邊是魔女祕境很快帶過的圖，沒想到竟然是拿破崙 囧…秘境主題：花園，園藝剪刀，薔薇，花，蝴蝶，荊棘，枯樹 滅火器上頭寫的是moero(燃えろ) 原文： 引用： ?Du mußt versteh’n! Aus Eins mach Zehn, Und Zwei laß geh’n, Und Drei mach gleich, So bist Du reich. Verlier die Vier! Aus Fünf und Sechs, So sagt die Hex’, Mach Sieben und Acht, So ist’s vollbracht: Und Neun ist Eins, Und Zehn ist keins. Das ist das Hexen-Einmaleins!“ 圖中原文很長，出處為浮士德”巫醫”篇，當時梅菲斯特帶領浮士德去找女巫去製造返老還童藥水女巫所念的咒語(全文很長，詳見附錄w)翻譯成中文為： 引用： 你得領悟！ 由一作十， 二任其去， 隨即得三， 你則富足。 將四失去！ 由五與六—— 女巫如是說—— 而得七與八， 如此完成了： 而九即是一， 而十是零號。 這是女巫的九九表！ 其實這首詩是一篇謎語，從前面三句我們得到10, 2, 3這三個數字，”你就富有”意指加起來(=15)後三句得到0, 7, 8，與5, 6, 4，最後得到的結果是3x3的9格方形，10是零號表示第10格不要 10 2 3 =15 0 7 8 =15 5 6 4 =15 =15 =15 =15 x 小圓他們的教室取材自Second life監獄(つд⊂)左上：Second life監獄右下：澳大利亞的玻璃(?)監獄 還有一些其他場景~中東的哈利法塔 (Burj Khalifa) 引用： 更多資料請看 世界第一高樓—哈利法塔 (Burj Khalifa) 跟杜拜的天空比較圖XD 新加坡的雙螺旋橋 引用： 更多資料請看 新加坡雙螺旋橋(Helix Bridge) (第二話)這棟建築物是Weltstadthaus(由建築師Renzo Piano所設計的) 新加坡的UOB廣場 引用： 更多資料請看 大華銀行廣場一期(UOB Plaza One) 這兩張出自浮士德的詩句，原文： 引用： Weh! weh!Du hast sie zerstörtDie schöne Welt,Mit mächtiger Faust;Sie stürzt, sie zerfällt!Ein Halbgott hat sie zerschlagen!Wir tragenDie Trümmern ins Nichts hinüber,Und klagenÜber die verlorne Schöne.MächtigerDer Erdensöhne,PrächtigerBaue sie wieder,In deinem Busen baue sie auf!Neuen LebenslaufBeginne,Mit hellem Sinne,Und neue LiederTönen darauf! 翻譯為： 引用： 悲哉!悲哉!你用這粗拳摧毀了這美麗的世界;它傾覆,它會瓦解!一位半神將它砸壞!我們將廢墟打掃乾淨並且為失去的美而傷懷.強而有力的地之子啊,趕快把它在你的胸中重建得更加氣派!光明磊落地開始嶄新的人生歷程吧,讓嶄新的歌曲響徹世界! 這張圖文字是The Blooming roses shall be presented to the queen lmmidiately(盛開的玫瑰必須馬上奉獻給皇后) 魔女的名字：Gertrud 原文：Die Rooose!!(=The Rooose!!) 大圖請點我這個是第二話出現的魔女，名字是Gertrud(蝶の羽を持つグロテスクな魔女)，不過Gertrud這個名字還滿多地方用的就是… 不是電影就是導演，還有小褲褲魔女www不過最好的解釋還是同名的玫瑰花種名為Gertrud，這種花長得也跟動畫中出現的很像介绍文：薔薇園の魔女。性質は不信。なによりも薔薇が大事。その力の全ては美しい薔薇のために。結界に迷い込んだ人間の生命力を奪い薔薇に分け与えているが、人間に結界内を踏み荒らされることは大嫌い。(薔薇園的魔女，生性多疑，薔薇比什麼都重要，他將所有力量都注入薔薇中，迷路進入薔薇園的人類會被竊取生命力) Adelbert，第二話才出現的隨從，薔薇園の魔女の手下。 その役割は警戒。人間を見つけると、ベルのような警戒音を鳴らし、容赦ない頭突きを食らわせる。視力は 2.5。 小さなタイプは侵入者を阻む薔薇の蔦に変身可能。(魔女的手下，工作是警戒，會像鈴鐺一樣發出警戒音，視力有2.5，小隻的能變身成帶刺的玫瑰攻擊入侵者) (第三話)沙耶加拿給上條君(誤)聽的CD 引用： 大衛·費奧多羅維奇·歐伊斯特拉夫（俄語：Давид Фёдорович Ойстрах，1908年9月30日－1974年10月24日），猶太裔俄羅斯小提琴家。詳情可以看介紹[簡介] 歐伊斯特拉夫 麻美學姐戒指上寫著”mami” 牢籠中牆壁寫著Charlotte 原文： 引用： CharlotteIch liebe Käse.Ich will nur Käse.Es gibt nirgends den Käse. 引用： CharlotteI love cheese.I want only cheese.There is no cheese anywhere. 秘境旁邊的圖騰有Charllote的圖案 第三話似乎在警告斬首的可能性 大圖請點我part1 大圖請點我part2第三話出現的魔女，名字叫Charllote(ファンシーなぬいぐるみの姿をした魔女。見た目に似合わず強大な戦闘能力と特殊能力を誇る。)(お菓子の魔女。その性質は執着。欲しいものは 全部。絶対に諦めない。お菓子を無限に生み出せるが大好物のチーズだけは自分で作ることができない。チーズさえ持っていれば簡単に隙をつくことが出来ただろう。)這隻同樣沒有適合的解釋，有地名，還有小褲褲魔女XD，不過看他這麼貪吃的樣子，就暫時把他歸類到一種法國的點心www準備起司的話就可簡單地製造破綻吧→ 所以焰戰勝的方式是餵他吃炸彈東西(喂最後引誘魔女吃到炸彈就結束了這點心裡面塞水果跟奶油，然後外面包著麵粉這樣，跟他的攻擊方式挺類似的…. 不知道算不算捏他，注意看英文部分MAMI MOGU MOGU…翻譯成日文就是…マミ モグ モグ…(抖 Charllote的使魔：お菓子の魔女。その役割はチーズを探すこと。しかし過度な期待は禁物。(Charllote的僕從，他的工作是找到奶酪，但是不要對他期望太高) 引用： 出處：http://yaraon.blog109.fc2.com/blog-entry-512.html圖片相信不用翻譯大家應該的看得懂XD疑點：焰第一次(?)看到這個魔女就知道本體(?)在哪，也就是說焰事先知道攻略法的可能性很高，劇情很高的可能性是loop 引用： 補一下Charllote秘境的一些圖(甜點+醫院+手術室+藥品+叉子+剪刀) 秘境中出現的兩本書 Charllote的悲傷之種(左)、學姐的靈核(右)之對照圖 第三話才出現的EDED最後看起來像一個臉，這是浮士德中的惡魔”梅菲斯特”的外貌(梅菲斯特曾經拍成電影，音樂劇…等等很多部的作品)似乎是影射QBey=梅菲斯特? 引用： 歌德筆下的梅菲斯特(詳情請看附件w)梅菲斯特雖然是個惡魔，但是歌德將他設定為代表「為成就大惡而行善的力量」，他剛登場的時候，並不是個恐怖的惡魔，而是一個身軀瘦弱，微微駝背，鷹勾鼻的男子，瞼上浮著嘲笑似的笑容。 不過他畢竟是個惡魔，能夠變成種種樣子，變成尨犬跟在浮士德身旁散步，或者變成旅行的學生待在浮士德的書房中。 而在要與浮士德簽訂契約時，則是變身成西班牙的貴族。與浮士德訂契約的場面相信是以《舊約聖經》中的〈約伯記〉為參考。 契約的期限是到浮士德念出「啊啊!你真是美好無匹!請你駐留!」為止。在那之前恢復年輕的浮士德經歷了種種的事件。墨菲斯托作為《浮士德》裡的反面主角，玩世不恭，誘人墮落，卻又不失冷靜、深沉、恢諧和機智，是個典型的虛無主義者的形象。 墨菲斯託在自我介紹時說：「我是永在否定的精靈！一切事物只要它生成，理所當然就都要毀滅，所以還不如無所發生。你們叫這做破壞、罪行，簡單扼要說就叫做惡，這就是我本質的屬性。」 官網第三話新增的魔女 ，名字是Suleika暗闇の魔女（未登場）。その性質は妄想。闇が深ければ深いほどその力は増す。完全な暗闇の中においてはほぼ無敵だが灯りの多い現代においてはそれほど恐れる魔女ではない。(暗闇的魔女(未登場),其性質為”妄想”,在越深的黑暗中力量越強,完全的黑暗中，將近是無敵的存在, 在燈火通明的現代並不是值得恐怖的魔女…)這魔女也太強了吧◢▆▅▄▃崩╰(〒皿〒)╯潰▃▄▅▇◣ Suleika的使魔：暗闇の魔女の手下。その役割は夢。あらゆるものに姿を変化させ漆黒の闇の中に魔女の望みを描き出す。暗闇の中では強大な力を誇るが、街灯や月明かり程度のわずかな光があればその力を半減できる。(暗闇魔女的手下,其職責為”夢”,能夠任意變化形態,在黑暗之中描繪出魔女的願望,黑暗中擁有強大的力量,但若在街燈及月光的影響下力量則半減…)名字叫Ulla，這隻使魔應該是第三話開頭被學姐打爆的那隻XD 引用： 翻譯轉自PTT C_Chat tgfh1234chan的第三話劇情推測：「所以妳決定跟我簽訂契約了?」 QBey坐在小圓的床上,看著就它見過中最具有潛力的女孩發出了掩飾不住興奮的聲音。小圓躺在床上還在思考她所要做的事「是的。我準備好了, QBey」 「我很高興能夠這麼快的找到了能夠替代麻美的人」 小圓向天花板扮了個鬼臉。她仍然沒有完全相信QBey的承諾 「讓我們開始吧, 那麼，妳的願望是甚麼?」 小圓猶豫了一下, 給了自己最後一點時間來思考。 在這之前, 感到不安因為她沒有甚麼願望。在她人生中的每一件事情, 雖然不是十全十美，一直不夠好, 她有一個美好的家庭、很好的朋友, 並沒有需要改變的必要。但是現在知道她想要的，她不能不抓住這個機會。 「我希望麻美能夠復活。」 她說完了之後鬆了一口氣。有任何其他問題這是好的願望現在已經毫無意義也為時已晚。 她甚至不知道她為什麼想過這儘管是一個不好的願望開始麻美承諾會指導小圓,而且小圓也承諾會在麻美的身邊。 有了這個, QBey 也不需要更換麻美。兩邊都有好處 不過QBey看起來似乎很失望「這就是妳的願望?」 小圓疑惑著看著QBey「是的, 就是這樣。 是否有問題呢??」 「我很抱歉, 我無法實現這個願望。」 「為甚麼不能。」小圓做了起來並且貼近了QBey她不相信牠拒絕了能再次見到麻美的機會 。 「為什麼你不能把她復活? 你說你能創造奇蹟發生, 對吧?」小圓的眼裡泛著淚光。「為什麼你不能讓 麻美 復活? 甚麼阻止了你? 是你能力不夠嗎?」 小圓開始抽泣，她想和麻美在一起的夢又破碎了。然而QBey絲乎沒有被小圓的情緒影響。 「不是這樣的。 我有權力使死者復活。」 「那你為甚麼不能讓麻美復活?」 小圓問。她雖然已經想到了原因, QBey在之前有提到了一些「規則」。 所以如果禁止復活。。。 「麻美並沒有死。」「…甚麼?」 小圓不敢相信她所聽到的。 「麻美並沒有死，我可以輕易的讓死者復活, 但我不能讓生者復活。」「你是什麼意思, 『麻美並沒有死』? 如果她真的活著, 那麼她在哪? 為何你需要一個代替她的?」 「妳還記得麻美發生了甚麼事吧? 魔女在她反應不過來的時候咬住了她的頭。」小圓轉身背對 QBey 並摀住了耳朵。她並不想要回憶起麻美的命運。但是沒有用; QBey的聲音很清楚的在她的頭響起。 「當麻美的無頭屍體掉在地上的時候, 魔女撲上去咀嚼。到這邊任何一個正常的人都會死, 但麻美的願望使她不同於一般人。她將永遠的生存下去 。 然而僅此活著是不夠的。隨著她的頭跟身體分家 , 魔女把她嚼成碎片, 她已經不能再和魔女戰鬥了。我不能再用她了。」 小圓躺在床上, 她的雙手仍試圖阻止QBey的聲音從她的耳朵進來。麻美的命運比她想像的還要糟糕。 「我真得很期待看到妳的潛力，一個魔法少女的誕生，真令人失望。」 QBey 走上了墊子並把自己捲成了一顆球。「如果有別的願望的話，告訴我，到時再來簽約吧。」 在這晚小圓完全沒有睡著。 (第四話)左手君用的CD Player： 引用： 以下說明轉自PTT C_CHAT 這款名為Dual Music Player的概念播放器，為來自設計師 Yong-Seong Kim的創意，它是一部同時支援CD及MP3的雙能音樂播放器，目前只有概念，沒有實品。 在MP3模式時它為一個長方體結構，上方配有一只圓形LCD螢幕，能用來顯示歌手與專輯名稱、樂曲長度等相關資訊下方則配備了圓形的播放/暫停、停止獨立按鍵，及前進/倒退/音量調整複合鍵此外一旁還配有細長的條狀藍色指示燈。 不過若為 CD模式，可以LCD螢幕為中心將整個Dual Music Player播放器以像蝴蝶刀旋轉的方式(也有點像圓規)筆直切成兩半轉開然後把CD光碟從LCD螢幕側邊的細縫放入，Dual Music Player就搖身變成CD播放器了。 SONY有實做一款類似的實體機Sony Discman D-88(看起來超恐怖啊XD 隨身電鋸)Sony D-88 Discman 第四話魔女，寫做Elly念做Kirsten(咦)ハコの魔女。その性質は憧憬。 筋金入りのひきこもり魔女。憧れは全てガラスの中に閉じ込める。 閉じ込められた者はその心までも簡単に見透かされてしまうが 考えるより先に殴れば問題ない。(箱的魔女。性質是憧憬(渴望?)。長時間住在內部含金屬條(?)的箱子中，不與外界接觸的家裡蹲魔女。他憧憬將所有他憧憬的事物關在(?)玻璃器具中。被關在玻璃中的入侵者心會被透視，但是在被透視之前先揍他一頓就沒問題了(喂wwww))不負責任亂翻譯Orz補充：Elly是綠野仙蹤(改寫版本)裡面，桃樂絲的名字 Elly的使魔：Daniyyel & Jenniferハコの魔女の手下。 その役割は運搬。 この手下がさわった物体はとても運びやすくなってしまう。(箱之魔女的手下。工作是搬運。它們能很輕鬆地搬運被他們碰到的物體)(竟然有小熊褲褲(噴茶)) 這話出現的 神聖儀式neta出處 ：人民聖殿教(這集的典故) 【逆再生】魔法少女まどか☆マギカ4話のあるシーン・・・ 第四話進魔女秘境前的奇怪音效，逆再生後才知道魔女所說的意思是今日は本当に楽しかったねぇまたいきたいねぇ今度はお弁当ももっていこう(今天真的很開心呦，下次還想再去耶，這次連便當也帶著了) 小圓進入秘境後，從天而降的雙子(Kirsten)手中的螢幕像開幕似地顯示4–>3–>2–>1(每一秒變一次) 小圓被拉入秘境前，背後的螢幕寫著Kirsten(這到底是使魔? 還是魔女?)雖然很多資料都寫這集應該是雙魔女，但是我覺得這應該是Elly的使魔才對 這次魔女刻印是雙子天使 德文原文：Ich mag keine Narren(I don’t like fools)在浮士德中，梅菲斯特把人所有人類影射為世界級的傻瓜Narren為德文的傻瓜之意，在這可看成影射人類。並且可能意味著魔女討厭人類。 德文原文：Ich will nicht arbeiten(I don’t want to work.)這句是一位挪威的劇作家Henrik Ibsen所寫出來的劇本John Gabriel Borkman(中文翻做冰雪人生 有翻拍成電影) 引用： “Ich bin jung, ich will nicht arbeiten, ich will leben,”可以翻譯成”Yes, but I don’t want to work now! For I am young! I will not work! I will only live, live, live!” 在冰雪人生中，這句話是從Erhart口中說出來的(劇中角色John Gabriel Borkman的兒子)，John Gabriel Borkman原本是銀行經理，但因詐欺坐了五年牢，(中間劇情省略)，最後他的兒子說他希望居住在他的幸福生活，無需未來。而最後Borkman在寒冷的冬天發抖著，接著在雪地跌倒，然後死亡 引用： 冰雪人生(John Gabriel Borkman)詳細劇情請看這裏：冰雪人生(John Gabriel Borkman) Elly最後死亡的一幕，是女人的樣子，Grief seed是從魔法少女的寶石/靈核變的可能性很高 引用： 補充Elly秘境的圖：(水中+旋轉木馬+CRT螢幕+雙子(?)) (第五話)第五話OP，旁邊紅色像血流下來的液體消失了，取而代之的是淡藍色的血/液體(?)(是否預告下次的死者?) 正中間的是帝國大廈XD 引用： 更多資料請看 帝國大廈(Empire State Building) 有台北101耶www 引用： 更多資料請看 台北101 (TAIPEI 101) 沙耶加變身，周圍魔法陣是音符(跟許的願望有關?) 沙耶加的魔法少女編號(?)是C(喂) 為什麼沙耶加的戒指上沒有寫字呢?是伏筆? 還是單純的作畫失誤? 焰的戒指上的文字是”mura”不知道焰的編號是什麼(喂)。疑點：編號跟強度是否有關係? 仔細一看對照圖，該不會第一話出現的魔女是沙耶加吧!?(可能性很高Orz 咦?! 簽下去之後連影子都不見了嗎?(つд⊂) ….(可能是伏筆?) 原文：Fin，通常用在電影結束，在法文中也有end的意思 第五話出現的使魔的主人，名字是Albertine落書きの魔女。（未登場） その性質は無知。 かくれんぼが大好き。 けれど彼女の手下達はあまり賢くないため 誰も彼女のことを探してくれない。(塗鴉的魔女(未登場)。其性質為無知。最喜歡捉迷藏。但是他的手下們都不太聰明，(捉迷藏的時候)都找不到他XD) 名字是Anja落書きの魔女の手下。その役割は童心。 ひとり遊びに夢中になっているうち 魔女とはぐれてしまった迷子の手下。 人間をボールに変えてしまう力を使い、ボールに変えられた人間は今までについた嘘の数だ地面を跳ねなくてはもとの姿に 戻ることが出来ない。(塗鴉的魔女的手下。他的工作是表現得天真幼稚(他本性原本就這樣吧XD)。獨自一人玩得太入迷會跟魔女走散(?)，他的能力可以把人類變成球，被變成球的人類如果不依照說謊的次數在地面彈跳的化就沒辦法變回來)他坐的交通工具從飛機變成船再變成車子www這隻使魔的音效好可愛~(ˊ艸ˋ) 鍊子上的圖案是奈良興福寺的五重塔 引用： (興福寺:日本第2の高塔。室町時代)興福寺為一座位於日本奈良縣奈良市登大路町的寺院，為南都六宗之一的法相宗的大本山。也是南都七大寺之一。以「古都奈良的文化財」的一部分而登入世界遺產名錄之列。 710年在奈良建都之時，當時的統治者、政治家藤原不比等將飛鳥的廄阪寺遷移到了這里，改名為興福寺。因為是祝願藤原氏繁榮昌盛的寺院，所以該寺院隨著藤原氏作為政治家活躍于世而不斷興盛繁榮。 但是，從16世紀左右其繁榮之勢開始衰落，1717年因火災除了北園堂、東金堂、食堂以外，其余建築都被燒毀，從那以後，慢慢重建為現在的規模。五重塔、三重塔、北園堂、東金堂已被指定為國寶。 現在的五重塔是日本古老的五層建築，建于1426年，采用了日本古典建築方法，高50米，是日本第二高塔。 三重塔則體現了10至11世紀優美的建築風格，堪稱三重塔中的傑作。 焰的能力是時間操作系嗎?就在藍毛要領蛋糕時，焰出現(此時背景的流水停住)藍毛&紅毛被移開位置 仔細想想QB所說的沙耶加的快速治癒能力(願望=治癒左手君的手)，如果像先前說的焰的願望是時間回溯的話，那能力是時間操作似乎也是理所當然的感覺~ 而學姐所說的許願要謹慎，或許是願望會跟你拿到的能力/武器(之後能不能活下來?)有很大的關係?沙耶加：OXX!! QB怎麼不早說不過內建補的坦不多見了啦(‘,_>`)y-~ 這一話有新房最喜歡的四十五度角分鏡XD (第六話)OP的變身畫面背景顏色變了(暗示小圓快簽下去了?)而且好像更恩愛了XD 杏子玩的跳舞機，不是DDR(Dance Dance Revolution )，而是DDR(Dog Drug Reinforcement、藥物強化犬)而且曲子還是OP電音版XD 法蘭克福的商業銀行大廈~ 引用： 更多資料請看 法蘭克福 商業銀行大廈(Commerzbank Tower) 這集果然是大怒神雲霄飛車Orz 這話沙耶加用的Grief seed是第四話出場的魔女Elly(上圖跟下圖是魔女結界的特徵，中間的圖是對照Elly的Grief seed) 先看到沙耶加拿grief seed吸收寶石/靈核的黯淡光輝，之後QB把那個用過的Grief seed收回後面的嘴巴(?)疑點1：吸收過多汙穢的Grief seed可以變回魔女之卵?(正好符合先前每個不同的魔女，Grief seed都不一樣)疑點2：魔法少女的寶石/靈核久了會沒辦法用Grief seed淨化，可能會黑化變成魔女，所以殺魔女=拿以前魔法少女的寶石/靈核(靈魂)來淨化自己的 QB吃掉的疑點：疑點1：QB吃掉表示他會再拿出來用? (可能性很高)疑點2：還是QB只是藉由簽魔法少女幫他蒐集Grief seed來吃?(會變大魔王嗎?XD) 魔法少女食物鏈(抖 引用： 所謂成為魔法少女，就是把靈魂抽出來變成寶石/靈核，而身體變成殭屍之類的東東，如果寶石/靈核離開身體超過100公尺，寶石/靈核(靈魂)就沒辦法控制身體，身體會像死掉一樣(本體=寶石/靈核) QB：這種方式很方便耶，只要寶石/靈核沒有受損就是不死之身，心臟被打穿或者斷手斷腳這種傷害都可以復原但是我實在無法理解你們人類，只要知道這點都會有這種震驚/悲傷的反應~(菸) 觀眾：「そういうことは先に言えええええええええええ！！！」(出處http://seiga.nicovideo.jp/seiga/im929425) 等等!?那這樣的話麻美學姐他…..?可能性1：麻美學姐連寶石/靈核都被吃掉了，沒救(可能性比較高，因為學姐的寶石/靈核好像變成髮飾 囧)可能性2：他其實沒死，但是被Charllote吃下去之後寶石/靈核被焰炸爛=死亡可能性3：學姐到現在都還沒死!? (但是身體被炸爛+靈核離開身體超過100公尺，而且還困在Charllote的祕境中?)可能性4：麻美學姐的寶石/靈核在焰手上!(咦?) (靈核在變身後會鑲嵌在肉體上?，變身之後弱點反而更明顯這是哪招啦XD)所以學姐可能….. 寶石/靈核離開身體有無副作用?(EX:記憶喪失之類的)or離開身體太久(或者原本的身體被破壞/找不到肉體–>寶石/靈核隨時間流逝變汙穢?)會直接變成Grief seed? 焰可能是用時間操作能力追上卡車的(時間暫停–>焰前進–>時間解除–>焰跑步–>loop)，但是一次只能暫停一小段時間 重點是這集QB的嘴臉超討厭的啊啊啊啊啊!!!眾人的憤怒，小圓收到了 引用： 焰提到的瓦爾普吉斯之夜(魔女之夜/ヴァルプルギスの夜) 瓦爾普吉斯之夜，在德國是一個非常古老的傳說，這傳說相信著每一年的四月三十號到五月一號之間的夜晚，魔鬼們和女巫們在德國中部哈尔茨山脈（Harz）的最高峰布羅肯山（Brocken）舉行狂歡節，它又被稱作「女巫們的安息日」，又稱作布羅肯奇景（Specter of the Brocken）。 最初發現的登山隊由於無法解釋眼前的光環，以為是山中的幽靈，所以稱作「布羅肯幽靈」，1780年由約翰·斯伯奇萊克（Johann Silberschlag）記錄為「布羅肯虹」。德國文豪歌德於1808年發表寫作了60年才完成的悲劇《浮士德》中的一幕為瓦爾普吉斯之夜。主人翁浮士德（Heinrich Faust）被魔鬼梅菲斯特（Mephistopheles）帶去參加群魔亂舞的布羅肯峰之夜。後來的作家將布羅肯峰之夜引申為「群魔夜」，如：法國作家巴爾扎克的《驢皮記》，前蘇聯作家米爾加科夫的《大師與瑪格麗特》以及德國童話大師米切爾·恩德的《願望潘趣酒》。(日文版本：)歴史的なヴァルプルギスの夜は、異教の春の風習にちなんでいる。ノース人の風習では、ヴァルプルギスの夜は『死者を囲い込むもの』とされていた。北欧神話の主神オーディンがルーン文字の知識を得るために死んだことを記念するもので、その夜は死者と生者との境が弱くなる時間だといわれる。かがり火は、生者の間を歩き回るといわれる死者と無秩序な魂を追い払うためにたかれ、光と太陽が戻るメーデー（5月1日）を祝うことにつながる。ワルプルガの聖なる日が同じ日に移動されたことにより、彼女の名前が祝祭と結びついたのである。ヴァイキングたちが春を祝った風習がヨーロッパに広まることでワルプルガは同じ方法で讃えられ、2つの記念日がともに混じり合い、ヴァルプルギスの夜の祭りとして成立していった。(學姐在那天復活的可能性?) 引用： 瓦爾普吉斯之夜(浮士德的悲劇第一部，「瓦爾普吉斯之夜」篇章請看附錄)因為佔的版面很大，對「瓦爾普吉斯之夜」本文的推測請看下面補充區 引用： 浮士德之中也有提到瓦爾普吉斯之夜(原文詳見附錄)梅非斯特一直想把浮士德引向純肉欲感官的愛情，但浮士德被梅非斯特帶進馬格麗特閨房，感受到她的寧靜、整潔、滿足、貞潔的性格，他的愛情立刻昇華成對反璞歸真的嚮往了。浮士德跟馬格麗特犯罪前，曾到森林洞窟中，在大自然中倘佯，這其實也是企圖抗拒他渴望馬格利特的慾念。但浮士德終究是個歷練過人生的老手，又有了年輕的身體，他並無青少年的羞澀膽怯，卻有青年的性慾，因此，他和馬格麗特發生性關係在所難免。 浮士德引誘了馬格麗特，誤殺了馬格麗特的母親與哥哥，梅菲斯特趕快攜浮士德逃亡，他把浮士德帶到他的地盤，也就是「瓦爾普吉斯之夜」。這導致馬格麗特單獨面對婚前產子的羞慚，她驚惶不知所措下，殺了自己的嬰孩，於是被判絞刑。 引用： 描寫浮士德”瓦爾普吉斯之夜”的白遼士「幻想交響曲」第五樂章Berlioz SF V: Songe d’une nuit de Sabbat (Immerseel) 幻想交響曲 Immerseel 白遼士的幻想交響曲第五樂章，被付以〈魔女的晚宴之夢——魔女輪迴曲〉（Songs d’une Nuit du Sabbat——Ronde du Sabbat），是描寫歌德「浮士德」中所構想的，在布羅肯山中魔女們的晚宴情景，當然，白遼士不是直接抒寫歌德《浮士德》中此段的確切含意，而是借用瓦爾普吉斯之夜可能會出現的狂亂，來抒寫狂亂的幻覺，在這幻覺中，有白遼士自己的喪禮，而他愛卻得不到的愛人，在幻覺中則成為了魔女。 更詳細說明請到這裡看[音樂]：白遼士《幻想交響曲》ch5、古諾《浮士德》Act Five前半段 小圓使用的鍵盤類似這種雷射鍵盤Celluon Magic Cube 小圓寫的作業是首英文詩Hey Diddle Diddle 英文wiki條目 引用： Hey diddle diddle,The cat played the fiddle,The cow jumped over the moon,The little dog laughed to see such sport,And the dish ran away with the Spoon . 引用： 改編自這首詩的童謠：Hey Diddle Diddle Hey diddle(=騙取) diddleAnd the cat and the fiddle(=小提琴)And the cow jumped over theMoonA little dog lied to see such aSportAnd the dish ran away with theSpoon There was a little girlWho had a little curl Right in the middle of herForeheadWhen she was good she was veryVery goodBut when she was bad she wasHorrid La lala lalala… Humpty dumpty sat on the wallHumpty dumpty had a great fallAll the king’s horses and all theKing’s menCould’nt put humpty togetherAgain Georgi porgi pudding and pieKissed the girls and made them cryWhen the boys came out to playGeorgi porgi ran away La lala lalala… Old king cole was a merry old soulAnd a merry old soul was heHe called for his pipeAnd called for his bowlAnd called for his fiddles threeAnd every fiddler had a fiddle soFineAnd a very fine fiddle had heThere’s none so rare as canCompareWith old king cole and his fiddlersThree La lala lalala… 最後一張圖倒過來看起來像個「死」這個字(抖 (第七話)這話OP變身的顏色改回來了，跟第六話不一樣，跟第五話一樣 魔法少女的行動模式(ry 跟前面第五話相同，戒指上寫的是”Homura” 杏子抓住沙耶加的時候，手裏拿的那袋蘋果消失了”(;’Д`)”(作畫失誤? 沙耶加戒指上的文字還是沒辦法辨識，不過根據先前的經驗，我們可以假設戒指上寫是他的名字”Sayaka”之前沙耶加的戒指也沒辦法看出寫了什麼字，特別要注意的是手指上的C 這話取材的場景─日本群馬縣的一景 杏子的戒指上寫著”Kyoko” 第七話[杏子回想mode]跟杏子戰鬥魔女，名字叫Gisela銀の魔女。その性質は自由。高速で移動する結界の中に潜んでいるが魔女自身は非常に愚鈍。残念ながら科学的な力は一切使えない。かつては全身目も眩むほどの銀色であったが、海岸線の夕日を眺めているうちにずいぶんと錆びてしまった。(銀の魔女。性質是自由。潛居在任何物體都高速移動的結界中，但是魔女本身卻很愚鈍。很可惜地一切有關科學的力量他都沒辦法使用。他的身體曾經閃耀著眩目的銀色光芒，但卻因為到海攤去看夕陽而全身生滿銀鏽。) Gisela的使魔，名字叫Dora銀の魔女の手下。その役割は主張。体についたパイプから近所迷惑な爆音を撒き散らし気まぐれな砂嵐のように移動する。嫌いなものは磁石。(銀の魔女的使魔。工作是堅持下去。他移動起來像個沙塵暴同時也會製造很大的噪音，困擾著周遭的人。他恨磁石。)(大略翻了一下，應該有漏掉的 \\囧/) 杏子的死亡暗示? 第七話跟沙耶加戰鬥的觸手魔女，名字叫Elsa Maria影の魔女。その性質は独善。全ての生命のために祈り続ける魔女。祈りの姿勢を崩さぬまま、その影の中へとあらゆる命を平等に引きずり込む。この魔女を倒したくば、黒色の苦痛を知らなくてはならない。(影の魔女。性質是自以為是。持續不斷地為世界上所有的生命祈禱的魔女。維持祈禱的姿勢不動，他可以把所有生命都拉進他的影子內。人們必須了解黑暗的痛苦才有辦法擊倒他) 難得出現跟沙耶加有關係的魔女解說(炸這大概也是指沙耶加內心的痛苦(加上他打倒Elsa Maria)的暗示吧。魔女全景，一個人拿著聖體匣的樣貌仔細看，左邊跟右邊有跟背景同色的文字圍繞在旁邊念做「elsamaria」，就是Elsa Maria 這圖更明顯了，文字翻譯是「Elsa Maria」，右下方跪下祈禱的是魔女的本體 左圖：魔女Elsa Maria右圖：杏子的妹妹(左)，杏子(右)魔女Elsa Maria的樹&髮型，對照杏子的妹妹髮型跟窗外的樹難道這個魔女是杏子的妹妹? 左：這件物件出現在在第7集的魔女的結界右：聖體光座，是天主教經常在宗教義式上用來的一件物件下：聖體光座是由神父拿著的，中間的位置是放著｢聖體｣。因為這件聖體光座是被視為神堅的，所以神父會一邊拿著一邊用來向信徒祝福，這就等同由主耶誕基督來祝福信徒。 引用： 詳細資料請看這裏Monstrance wiki 影の魔女的使魔，名字叫觸手SEBASTIAN’S影の魔女の手下。その役割は妄信。 影の魔女によって平等に救われてしまった命達の集合体。 彼らは同胞を求めている。(影の魔女的使魔。工作是盲目的信仰。是被影の魔女平等救(吃)出(掉)的這些生命的集合體。他們總是在尋求(找)著同伴。) 壞掉啦壞掉啦壞掉啦~ 這壞掉的表情讓我飛躍起來啦(喂www~發動速攻魔法！狂戰士之魂！~~ 沙耶加這種表現法是向壞蘋果致敬嗎?XDD 為別人而許願簽下去的果然都沒什麼好下場(遮臉 杏子：「奇蹟並不是免費的。如果你祈求了希望，也會散播出同等的絕望，就這樣將差距變為0，以此保持這個世界的平衡。」(這表示魔法少女許願後會出現相應絕望的魔女?) 把沙耶加的戰鬥調亮：(soulgem變成黑的? 或者只是因為背光? or作畫崩壞?) (第八話)引用： 本AA轉自PTT_CChat 小圓 浮士德 ——–> 魔法少女 梅菲斯特 ——–> QB 浮士德最後 ——–> 魔女 引用： 轉自 PTT C_Chat PsycoZero(魔法少女方程式)簡單易懂(個鬼)的圖解版 M(t)：t時間點魔法少女數量的函數W(t)：t時間點魔女數量的函數 C：QB簽的數量D：陣亡的魔法少女的比例B：魔法少女變成魔女的比例K：被魔法少女幹掉的魔女的比例F：每個魔女製造的使魔長大成魔女的數量(好複雜)(這欄要正有理數) 接下來有很多演算 總之主要計算法是這樣：ΔM(t) = C - D × M(t) - B × M(t) = C - (D + B) × M(t)ΔW(t) = B × M(t) + F × W(t) - K × M(t) = F × W(t)+ (B - K) × M(t) …總之是個公式 從其他角度來推測魔法少女小圓的結局引用： 轉自 PTT C_Chat Shift2 虛淵是誰 在C-Chat板上，虛淵真的快變成佛地魔了(苦笑)老實說，我不知道目前的我有沒有那個資格，但是我還是試圖來談談他。 回到虛淵的第一款商業作品Phantom，在這邊我們可以找到虛淵玄的『初心』在本作，有這麼一句台詞，也是我在全作中最喜歡的台詞。 『強固な信念、守るべきもの、生き殘るための不屈の意志ヒロイズムとは、幻想ではなかったようだ。』(『強韌的信念、該守護的存在、為了生存而具備的不屈意志 看來英雄並非只存在於幻想之中』) 非常諷刺地是，這句話出自本作的最大反派賽斯口中，他在解釋主角的能力為何超出他的想像時，說了這句話。而這句話中的要素我們可以一直在虛淵的劇本中找到。 其實虛淵一直都在寫『意志力』與『英雄』這兩個東西。但他並不像是少年漫畫，說到意志力就是咬緊牙關喊Never Give Up， 燃燒胸中熱血，事情就會迎刃而解。 虛淵劇中的『英雄』要用無從抵抗的逆境來描述虛淵劇中的『意志力』要用一次又一次的犧牲來突顯 「即使你知道前方走下去只有痛苦只有斷崖，你也要走下去嗎？」「即使你知道你作的事都是錯的，走越遠就失去越多，你也要走下去嗎？」 於是如同版友所說：『這些角色不見黃河心不死，但最後走到了黃河畔，大都會選擇不死心地跳下去，能遊多遠算多遠，最後被名為Bad End的濁流吞沒。』 這是早期的虛淵，虛淵三番兩次玩這套，玩到自己都快把自己搞到爆炸：「奇怪我為啥只能寫這種東西」「我怎麼沒辦法隨便凹一下來個救贖呢」 他甚至開始懷疑：「我是不是不相信平常人相信的幸福啊？」而萌生了封筆之意。 「當我看蜘蛛人2，彼得放不出絲的那個橋斷，發現了自己心中深藏的願望…」「虛淵玄該不會其實很討厭寫作吧？」 但此時好友奈須\\武內帶來了F/Z的企畫，虛淵大喜：「Fate是一部『大團圓』的喜劇，這個故事已經確定會被衛宮士郎所救贖， 既然如此，就算我把自己胸腹中的Bad End惡性腫瘤通通掏剖出來給大家看，也無損於Fate最終的結局！ 就算我在F/Z怎麼欺負Saber，她在本篇Fate線最後還是有善終！」 從這段話我們可以看到，F/Z會變成了那附德行，也是必然的道理。虛淵就是打定主意要在F/Z中盡情地寫他的Bad Ending。而確實，自從F/Z(2006)之後，虛淵有點變了，也許是這自我Shock療法出了作用吧。 虛淵劇中的『英雄』有點變了，不再是一個『無盡犧牲、承擔無數罪惡以成就某些事』的人物，而有了新的解釋：『英雄是一個傳承下來的人們的夢想』 從F/Z的Rider主從的最後一幕為開端，懦弱的威巴分得了征服王的勇氣，居然敢對英雄王大小聲 賞金首的抗暴革命英雄黑鷹，在劇情前半被虛淵又踢又踹：「只要帶著那把傳說中的槍，誰就是革命英雄黑鷹！黑鷹是誰根本沒人在意」於是女主角帶著那把傳說中的槍，自稱黑鷹招搖撞騙。然而到劇情的最尾，虛淵卻把這件事完全地翻了盤：「對，黑鷹是誰都無所謂，因為黑鷹就是人們心中嚮往自由的夢」 鋼之翼的結局主角貫徹了『挑戰音速的夢』之後，仍然有下一代接手這個夢『挑戰未知的宇宙』。本作的『犧牲』成分一樣相當低。不像以前，虛淵的主角動不動就是殺害好友、泯滅舊情、毀滅世界… 引用： 轉自 PTT C_Chat Shift2 來說小圓 好，回來說魔法少女小圓，小圓仍然是虛淵的孩子，就算不是兒子，老鼠生的女兒一樣會打洞。 那麼，小圓劇中傳承的『夢』是什麼？我想那就是『幫助他人的魔法少女(正義使者)』這個夢。同時這也是『魔法少女』這個類型的故事中，最根本的要素，也是小圓一開始的夢想。 註：(我其實不太想用正義這個詞，因為正義在板上有某種很負面的印象，一說正義大家就殺氣騰騰的要談美國和切嗣。但其實這作品中的正義沒這麼複雜…)虛淵三番兩次懷疑這件事，好像要打破這件事，告訴觀眾：『你看，要幫助他人的通通沒好下場。』 麻美學姐是最像『魔法少女』的魔法少女，她有絕招名，也最接近正義使者。 可是她三話就被秒殺了，十話還被虛淵拖出來鞭屍，破壞死者形象，慘。沙也加為了上條簽約，化身魔法少女後選擇了和麻美一樣的正義使者之路。 她的下場就不要說了。杏子呢？她不也是嗎，她重拾了『助人的魔法少女』之夢十分鐘後殉職。 但是反過來說。她們都貫徹到底了。 麻美學姐貫徹到底，最後也取得了小圓這個伙伴，得到了心靈上的救贖。[沙也加也真的直到最後都沒有利用魔法和許願為藉口去取得上條的心。 (雖然她混亂之下把電車上的兩個男的宰了…)杏子一度背棄這個夢，但最後也回來為了這個夢，義無反顧地犧牲性命。 麻美教導沙也加，沙也加讓杏子回想起來的這個『助人的魔法少女』之夢引導出她們的破滅，同時也引導出她們的堅持與光芒。 把這一切看在眼裡的小圓，9話接下了杏子交出的美味棒。 虛淵難道不是在問這個年僅國中二年級的的女兒嗎：『會變成身魂分離的僵屍、總有一天會變成魔女被別的魔法少女獵殺、甚至傷害他人 所有付出都無人知曉，無從求回報， 即使這樣，妳也要當助人的魔法少女嗎？』小圓的答案？我想，小圓就算廢怯，她體內流的還是虛淵的血。 引用： 轉自 PTT C_Chat Shift2 從這角度來說焰從這角度來看，焰是一個被排除在『助人的魔法少女』這個接力賽之外的角色。相反地，她還是一個打算破壞這交棒的角色。**她從一開始就是個『只為一人的魔法少女』——某個角度來看，她並不是一個『魔法少女』，她沒有背負魔法少女的宿命，** 反倒比較像是『沙耶之歌』和『鬼哭街』中，只為一人而造成無數死傷的早期虛淵故事的主角。一開始她的視野內也許還有其他人的安危，但隨著loop數的增加，她的關心也越來越集中在小圓身上。 最後這一次loop中，從4、5話她和小圓的對談可以知道，一旦成為魔法少女，在她眼中就只剩下戰死和魔女化的差別：『一旦成為魔法少女就沒有希望了，所以妳放棄美樹沙也加吧！』 事實上也是這樣，這就是魔女系統的真相。 回頭說『結局應該不會是怎樣』從這個觀點來看，若虛淵選擇讓『再loop一輪以完成完美結局』，那會是件令我難以想像的事。 在小圓無法loop的狀況下(我也不認為虛淵會讓她loop)一旦再loop，那不但代表1-9話整個『夢』的傳承通通都要被歸零。同時也代表，整個1-9話麻美、沙也加、杏子的故事，她們的奮力演出通通都被推翻了 那觀眾為她們流的眼淚，捏的冷汗，放的感情，吐的口水，開的討論串，延燒的筆戰，通通是要reset去哪？ 『選擇再loop』，會把整個1-9話，貶為單純用來介紹角色和世界觀的道具。 就算我們最後看到了幸福的結局，那個沙也加絕不是我們關注了兩個月的死腦筋沙也加，那個杏子也不會是經歷和沙也加的點滴之後重拾愛與勇氣的杏子。 最重要的『夢的傳承』，必須要完遂在這一輪，才會為三人的犧牲和故事帶來意義。 因為這一輪的小圓，已經具有最多的覺悟了。她掌握了比之前所有小圓都要多的情報，她已經可說是知道一切該知道的了。她喊簽約需要的是難以想像的決心和意志力。 畢竟，這部作品的重點，就是『描寫小圓決心成為魔法少女的經過』 而不是寒蟬一樣的『無限loop以求完美結局』所以…萬一真的loop把記錄洗掉了，我會很失望。 引用： 轉自 PTT C_Chat Shift2 小圓與焰(妄想) 現在小圓面前最後沒開示的情報只剩下一條：「妳變成魔女之後會毀滅世界，沒人打得贏」 小圓站在全劇分崩離析的人際關係中唯一的交錯點。 她聽過麻美的心裡話，見過沙也加的眼淚，知道杏子的決心 那麼，也該是時候讓焰對她坦白一些事了吧？直到現在，小圓和焰的交集是很單方面的，小圓仍然不懂焰究竟要什麼。這集揭示了焰的過去，那下一集就該讓小圓去接觸這一塊東西。 小圓無論如何都要簽約時，我想焰會搬出這最後一條情報來阻止她。 如果小圓作出了之前同樣的決定，我想小圓就會擊倒魔女之夜而存活， 並且以她寧死也不願魔女化、仍然要為他人而戰的勇氣，說服焰不再loop。 -—-我很喜歡這篇分析w 引用： 翻譯轉自PTT C_Chat enfis(獵戶座與天蠍座的故事 vs 紅毛藍毛故事) 由於外星人出現，所以老外的考據也走向星座了嗎XD *”Orion was the son of the sea-god Poseidon”- the reason for Sayaka’s fish form .* “奧利安為海神波賽頓之子(本集さやか的人魚造型) *”Odysseus sees him hunting in the underworld with a bronze club”- first time we’ve seen Sayaka in a barrier(underworld) , she carried a golden(bronze) bat.*奧德修斯看奧利安以青銅棒在陰間狩獵(さやか首次跟麻美姊去見習的時候也有青銅棒)(如下圖) *”he hunted with the goddess Artemis and her mother Leto”- she hunted with Mami and Madoka .*他會跟女神阿耳忒彌斯和她的母親勒托一起狩獵(這邊指的是粉圓跟麻美) *”threatened to kill every beast on Earth”- kill every witch on the world .*大地之母看他不爽，所以派出巨大的蠍子去對付他(杏子登場，杏子的槍造型也像是蠍子尾) *”The creature succeeded, and after his death, the goddesses asked Zeus to place Orion among the constellations.*蠍子成功了，在奧利安死後，女神要球宙斯把奧利安放上星座 Zeus consented and, as a memorial to the hero’s death, added the Scorpion to the heavens as well”- and now they’re both in the skies .宙斯答應了，同時也把蠍子放上，跟奧利安就一起成為了星座──天蠍座跟獵戶座(兩個人一塊自爆了(っ･ω･)っ(拍拍) 順帶一提，這兩個星座永遠不會同時出現在天空上，一個落下另一個就升起天蠍座，跟杏子的鎖鏈槍蠻像的獵戶座，魔女化さやか臉部的三個圓圈是不是剛好等同獵戶座的腰帶-–很有趣的討論XD 滿有道理的~ 引用： 轉自PTT C_Chat greydust(杏子心境討論) さやか這個結局(還是還沒結局? 不過我是相信兩個人都便當了啦),雖然從她變成魔法少女的那一刻就已經注定, 不過還是會讓人很感嘆啊(尤其是上一集)只能說一直讓我想到這句台詞:You either die a hero (マミ) or you live long enough to see yourselfbecome the villain. (さやか) 這篇主要是想討論杏子(不可免俗的還是要強調一下, 我從第一集就是ほむら派)杏子就我看來, 她對さやか就是很簡單的投射心理而已 杏子的行為從頭到尾都很一致, “不希望其他人跟她一樣”所以一開始さやか那個樣子, 杏子就打她是因為看到過去的自己而生氣嗎? 還是有更多其他的理由我也不知道雖然第六集的時候さやか說雙方打到最後是真的想要殺掉對方但在沒有明確的解釋之下, 我覺得那只是為了表現出さやか心中的”憎恨”罷了 後來soul gem的事情爆發, 杏子反而去開導さやか如果前面所作的是為了把さやか打醒, 那這邊就是意識到這件事對她打擊很大了於是伸出了援手. 可惜的是這只是杏子單方面的認為さやか需要援手而已實際上さやか根本拉不下臉來和解, 也沒有經歷過那一段殘酷的現實接著さやか開始暴走, 杏子開始為她奔波. 也是延續著這一段. 而第九集整個我覺得是刻畫杏子內心的高峰, 也是句點. 一開始杏子只是抱持著さやか跟她有相同的經驗.而杏子的過去沒有人幫助她, 她靠自己的力量得出了不為他人使用魔法的結論.所以她希望可以幫幫さやか. 但是在ほむら說出”魔法少女終將成為魔女”以後, 也打碎了杏子的防線. 靠著去拯救さやか, 杏子最想拯救的其實是她自己.所以她不停的問 “沒救了嗎?” “所以說還有你不知道的方法?”其中她問まどか的一句話我覺得最為傳神 “救不了的話, 就不管了嗎?” 我彷彿看到杏子這麼問著:“如果我也這樣沒救了, 會有人幫我嗎?”很顯然ほむら不會, 但是まどか會. 如果這個友情的羈絆真的這麼強烈這次可以拯救さやか, 那下次搞不好就可以拯救杏子自己. 可惜的是在虛淵玄的故事裡面從來就沒有什麼友情的羈絆這種鬼東西 於是在杏子向神祈禱以後, ほむら出現了. 雖然杏子什麼都沒說, 可是我看到的感覺是:“哈哈.. 果然你才是對的. 像我們這樣子, 本來就是沒救了呢” 所以杏子也放棄了一切. 與其最後變魔女與其要去殺死原本一直想拯救的, 與自己過去神似的晚輩.不如就在這邊把一切結束. 在最後道別的時候, ほむら明顯的有了表情讓我覺得, 其實這部片裡面所有人都是一樣的さやか想藉由拯救所有人來拯救自己, 所以犧牲了.杏子想藉由拯救さやか來拯救自己, 所以犧牲了.ほむら表面上看起來什麼也不管, 其實她也想拯救まどか而且拯救まどか對她來說應該有什麼重要的意義, 而我認為這與杏子如出一轍.(所以接下來換她犧牲了) 除了目標不明的マミ和總是被阻止的まどか其他角色真的是都有愛的很可愛啊, 虛淵玄果然沒有辜負他自稱愛的戰士 -–超棒的杏子分析 ｡ﾟ･(つД`)･ﾟ 引用： 2ch對Charlotte的有趣分析*155 名前：風の谷の名無しさん＠実況は実況板で[sage] 投稿日：2011/02/28(月) 20:23:21.33 ID:VHfOtOKt0*シャルロッテは病院で発動薬品とお菓子のイメージ＝末期の不治の病でお菓子を食べたかった(Charlotte結界中，藥品跟甜點的image表示Charlotte罹患末期的不治之症，所以不能吃甜食) もしくは過食と拒食を繰り返してた？(厭食和貪食這兩種情緒不斷反覆著?)シャルロッテの結界で一瞬出てくるこれ 外来で抗癌剤治療受ける外来科学療法センターに似すぎなんだわ。(這景象跟治療癌症的癌症中心很相似)ウエの番号とかベットの並びとか(像是序列的號碼啦，跟床的擺放方式) ちなみに抗癌剤治療してる間はお菓子は食べていいけど、(順帶一提癌症的治療期間雖然可以吃甜點)チーズとか一部発酵食品は禁止。(但是禁止吃起司之類的發酵品)ソースは抗癌剤治療中の俺。(消息來源在化療中的這位2CH鄉民ˊxˋ) もしシャルが小児がん患者だったら、そんな子を契約させたQB…(如果Charlotte真的是幼年癌症患者的話，在瀕死時跟QB簽約….) 以下是轉自PTT的相關討論 Kusari 目前2ch現在正在熱烈討論Charlotte到底代表什麼首先有人提出夏洛特的結界後者是哪裡呢？癌症中心….目前治療乳癌用的紫杉醇(taxol),必須避免與Trp或是其前趨物5-HTP一起服用, 否則會增加Taxol的副作用 而含有高量Trp的食材包含鮪魚,蛋,堅果類,牛奶和乳製品….→所以Charlotte不能吃起司最後Charlotte被學姊打敗後二段變身成惠方卷代表癌細胞的轉移與不死性(目前最早被發現的癌細胞在主人死了之後依然還活著) 所以有人猜Charlotte本來是幼年癌症患者,在瀕死時和QB訂下契約… -–Charlotte變成魔女的原因(喂)Charlotte變成魔女的原因(同人補完版｡ﾟ･(つД`)･ﾟ) (請看這帖的回覆#61樓~) 引用： 本文轉自PTT C_Chat dotZu*「若不啄破蛋殼的話，蛋殼裡的雛鳥將因無法誕生而死去。 吾等就是雛鳥、蛋就是世界， 若不打破世界之殼，吾等將因無法誕生而死去。 將世界之殼破壞吧！為了讓世界革命！」 ––《少女革命》* 本來標題要打成「蛋的聯想」，但是覺得這樣會不會太強調劇中有蛋了， 所以改成較無特定意義的「蛋蛋的悲傷」，完全是無意義的標題。只是後來想想，還真的是「蛋蛋的悲傷」沒有錯。（以下會解釋） 事情是這樣的，說到那個孵化器（育成中心），我不知為啥，想起第一話當中，老師所說的話：*「各位同學！蛋要吃半熟的好，還是全熟的好？ 沒錯！兩者都可以！各位女同學，請務必不要和只吃半熟蛋的男人交往， 各位男同學，長大以後千萬不要成為只吃半熟蛋的男人！」* 看起來只是一句無關緊要的閒聊對吧？不不不，看起來這句可是在描述真正核心的主要劇情啊！這部作品，劇情密度還真的是相當高啊！ 在魔法少女小圓 08 當中，我們看到靈魂寶石（Soul Gem，SG）會轉變為悲傷之種（Grief Seed，GS），也就是魔女之卵。 先前就有西洋人觀察到，**靈魂寶石的外觀長得很像一種蛋雕藝術品，這叫做「法貝熱彩蛋」的樣子，是俄羅斯工匠所製作的華麗蛋雕，**在劇場版《名偵探科南：世紀末的魔術師》當中登場的就是這個東西。 而 06 話當中出現的童謠()，主角是「蛋人」，他坐在牆上，不小心掉下而摔碎，就算國王出動了多少人馬都拼不回來。 相當符合劇情，從這裡我們也可以認知到，靈魂寶石是顆蛋。編劇虛淵在此給了較快樂的結局，童謠當中打破蛋殼是不可逆的。 我觀察到，靈魂寶石轉變為悲傷之種的過程，視覺上是原本四周欄杆狀的保護條（蛋殼）消失，而向下伸出刺針，而這刺針就像圖釘之類的，可以插在地上。 QB說過，靈魂寶石的優點，是有比普通人類有更佳的防護效果，由此可以知道， 那個保護條並不只是視覺上的設計，說它有加強防禦力的用意在，應該不算錯。 而向下伸出的針，我把它聯想成雛鳥的鳥喙。有點牽強就是了。 但是從 08 話 QB 所說，「還未成長的魔女，稱為魔法少女。」我想「打破蛋殼」這個含意，應該是沒有錯的。也就是說，這是成長的必然。（至少 QB 這麼認為） 少年少女成長之後，就成了汙穢的大人；靈魂寶石成長之後，就成了悲傷之種。蛋成長之後，就成了……還是一顆蛋。 一顆成長過的蛋，但是還沒完全長成魔女，所以是魔女之卵。但是成長是件很痛苦的事，有些人會因此累積了負面能量。 圓和媽媽的對話：「那不是很痛苦嗎？」 「每個大人都很痛苦的，所以才能喝酒呀。」圓媽也說，但是變成大人不是只有痛苦，也有很多快樂的事。但是小圓的回答：「真想快點能和媽媽一起喝酒呢！」 不覺得這句話，現在看起來，是個成長 flag 嗎？（抖） 靈魂寶石是個蛋，悲傷之種也是個蛋，所以還真的是蛋蛋的悲傷。 小圓04話說過：「活著才能吃到蛋，真是太幸福了。」說不定QB就是許了一個「活著、吃蛋」的願望，才成為QB喔； 他是個只吃全熟的蛋的男人，全熟＝全黑。所以，老師有說過：全熟、半熟兩種都可以，不要挑食的男人交往；這其實是在提醒大家，不要和挑食的 QB 簽約， 因為半熟的他不吃啊，看到蛋就想做成全熟的……。 -–(超棒的蛋推論XD 快承認你就是虛淵吧!!(ry)) 引用： 本文轉自PTT C_Chat evilsura*與魔鬼戰鬥的人，應當小心自己不要成為魔鬼。當你遠遠凝視深淵時，深淵也在凝視你。 －－尼采* 雖說”魔女是由魔法少女轉變而來”這點已經是大家都猜到的了不過看到sayaka肉體與精神一同崩落的瞬間，還是讓人很傷心啊。 在看著sayaka心路歷程轉變以及魔化的過程中，我一直想到安徒生的《小美人魚》，童話中的小美人魚救了王子一命，又為了王子放棄了人魚的身分以及天籟之音，王子卻錯愛別人，小美人魚最後化為泡沫。但小美人魚對於自己將會化為泡沫這件事是了然於心的，她寧可如此也不願傷害王子， sayaka為了上條而許願，也因此犧牲了自己卻直到墮落前的那一刻都不知道，自己變成了自己眼中最不能容忍的存在。 從這集也可以看出sayaka對上條用情之深，sayaka在與魔女對戰所用的治療魔法，甚至在黑化的眼中，都是音符和五線譜，想當然爾在這些符號的中心…自然是那位上條了(只不過是斷頭的跟沾滿血的上條君…)從sayaka當時穿的衣服胸前有個C來看，這或許就是她身為魔法少女符號的來源，**sayaka可以說是整個世界都繞著上條在打轉，為了他當上魔法少女，也為了他成為魔女，初戀嘛，總是最純粹最刻骨銘心跟最傻的那個。** 新房在畫面處理中，把sayaka充滿污穢的靈核和轉化為魔女的過程，都加入了泡沫的元素， **如果說小美人魚是因為愛的光明面才變成了泡沫，毫無疑問的sayaka則是因為另一面而使然，** 在第四集營救madoka和hitomi的時候，面對madoka的困惑，sayaka曾笑笑說了一句:”嘛，該說是心境的變化嗎?” 然而這次心境的遽變，她卻沒能渡過。難怪魔女們帶著的叫做悲傷之種，因為是希望轉為絕望之間所必經的結晶啊。(不過我覺得這個名字應該也是個伏筆，幫初看學姐介紹的時候就很困惑了，不知情的魔法少女應該是不會給它取這個名字的，QB更不像是會取這種名字的傢伙……那到底是誰取的呢?) 另外貼一些我覺得很有意思的點：(1)這一幕是sayaka遷怒到madoka的時候，可以看到sayaka身後已經被扭曲成籠狀，或者卵狀，非常呼應她的靈魂在卵(靈核)內也一併扭曲的情形。(2)杏子被吹的方向剛好跟背後看板箭頭的方向一致wwwww不過如果搭上這張圖片大概就笑不太出來了… 只有頭跟身體是分開的…拜託不要啊Orz 感想到此，謝謝大家收看~-–(沙耶加=小美人魚那邊很有道理呢w) 引用： 2ch的劇情推測(翻譯轉貼自Komica，ID:QRSyz42Q)，我開始相信你了 /口\\ ↓ 結局part2スレのこれが正解で、本当のネタバレ919 名前： 進藤ヒカル(香川県)[sage] 投稿日：2011/02/05(土) 10:53:24.59 0そろそろ良い頃合いなので、ネタバレすると QBは悪魔 （QB是惡魔）少女の願い事を叶える代わりに魂を奪う （實現少女的願望的代價就是奪走靈魂）魂を奪われた人＝魔法少女 （被奪走靈魂的人=魔法少女）一度魂を奪われると二度と元の人間には戻れない （被奪走靈魂的話不能再次變回普通人） そしてそのまま時間が経つと （而且經過一段時間之後）空っぽの魂の器が暴走して化け物＝魔女になる （空虛的靈魂容器就會暴走變成怪物=魔女） 化け物になりたくなければ、魔女を殺し続けて （如果不想變成怪物的話，就要獵殺魔女）彼らの生命の残滓から、仮初めの魂(シード)を奪い取り （去奪取他們的生命殘骸，最開始的靈魂）自身の魂の器を補強するしか無い （來增強自己的靈魂容器） 魔女は正気を失っているが （魔女雖然已經失去意識了）二度と戻らない人間性を取り戻そうとして （但是爲了取回原有的普通屬性）人間の魂、特に魔法少女の魂の器を狙うようになる （會不斷的獵捕人類的靈魂，尤其是魔法少女的靈魂容器） そして延々と戦いが続いてきた （戰鬥就這樣一直的持續著） まどかは、この世で最も大きな魂の器を持つ少女 （小圓，持有這個世界上最大的靈魂容器的少女）その魂の大きさに目を付けたQBの策略によって （被她的大型靈魂所吸引的QB用計謀）情に流されて、魔法少女の契約をさせられる (これが1話) （騙取同情，讓她交換了契約成為了魔法少女（這是第一話）） そして歴代最強の魔法少女になるが （然後變成了歷代最強的魔法少女）ふとした事で魔女化の真相を知ってしまい （但是由於某件事知道了魔女化的真相）またもや情に流されて、魔女を殺せなくなる （又變得不忍心去殺魔女） その結果魂の器が暴走、最強の魔女になってしまう （結果靈魂容器暴走，變成了最強的魔女） まどかを倒す為に世界中の魔法少女が集まってくるが （爲了打倒小圓全世界的魔法少女集合起來）あっさりと全滅して、世界は滅びを迎える （但是很簡單的就被全部擊破，世界走向毀滅） ただ一人残った少女、ほむらはQBと契約して魔女になり （只剩下最後一個少女，小焰跟QB契約變成了魔法少女）その願いである、時を越える力を使って過去に飛ぶ （利用她的願望，穿越時間的能力回到了過去） もしかしたら滅びの運命を変えることが出来るかも知れない…… （或許能改變著破滅的未來）儚い願いを抱いて過去に飛ぶほのか （懷抱著這樣的願望回到過去） 果たして彼女の願いは叶えられ、世界は滅びから救われるのか （到底她的願望能否實現，能否從滅亡中拯救世界）それとも変えられない運命が待っているだけなのか──── （還是說即使這樣也還是有無法改變的命運在等待著他們呢——）────その答えの全てが最終回に！！！！！！！！！！(自主規制) （——答案全部在最終回！（自主規則）） 引用： 追加情報 轉自PTT C_Chat enfis「魔女之夜」本身就是魔女的名字，是一個要組隊才有辦法刷的副本 雑誌インタビュー-キュウべぇは殺された！と思ったら、直後に復活しましたね 虚淵：前の個体の損傷が激しくなると、自動的に次の個体が生成されます。そして魔法少女がキュウべぇを殺すと、ペナルティとしてソウルジェムの濁りを濃くされてしまいます。 それもキュウべぇは説明していませんが（笑）ちなみにキュウべぇが自分の死体を食べたのは、体がこの世界にはない物質でできており、その証拠隠滅のためです。 簡單翻譯：(1) 前一個個體受傷太嚴重，會自動生成新的個體。(殺了一個還有千千萬萬個)(2) 殺了QB還會附加Soul Gem混濁的懲罰…(3) 這些內容QB當然沒有說明。(4) 會吃掉自己的屍體，是因為身體是由這個世界沒有的物質構成，所以吃掉湮滅證據 阿虛，這種的爆雷沒問題嗎? /口\\ 引用： 翻譯轉自 PTT C_Chat enfis疑似是Megami MAGAZINE的情報，未確認是否為真： ・ＱＢは最後までＱＢらしい所詮奴はシステムの歯車でしかないのか・・・希望は何処に・・・ 不負責翻譯：QB就只是QB，既不偉大、也不卑微！它也不過是系統中的一個齒輪。 ・ＱＢはウソを言わない。「彼女一人では荷が重すぎたんだ。」パートナーのまどかがいないから、ほむら一人。不負責翻譯：QB不會說謊，第一集開頭說「這對她負擔太重」是因為搭檔粉圓不在，只有燄她一個人。 ・ほむらは弱い。不負責翻譯：燄很弱。 引用： 翻譯轉自 PTT C_Chat enfis 1.紅青同屬速度＆力量型2.兩人實力差不多，紅因為技術上較好，所以對上青時會佔上風3.紅防禦力低下但技術較好，青強在回復力跟防禦力4.燄的強度設定是『只是變身了的普通少女』 除了有操縱時間以外算是較弱的魔法少女，不過變了身還是比普通人強一點5.上一篇提到的黑貓＝燄是看了雜誌的人寫的評語，不是雜誌寫的。 引用： 翻譯轉自 PTT C_Chat tsunamimk2出處：http://kamome.2ch.net/test/read.cgi/anime/1298821215/516補充一些MEGAMI雜誌的小圓情報 MEGAMIのまどか関連のネタ読み終わった ・ほむらは魔法少女の中で最弱で補うために小細工してる(ほむら為了補自己是魔法少女中最弱的事實採用了一些小手段) ・杏子は防御に難があって攻撃を受けると脆い設定(杏子是個不擅長防守又一但受到攻擊就容易critical hurt的角色) by Profaner ・人を殺したキャラが幸せになることはない(殺了人的角色是不會獲得幸福的(暗指沙也加?)) ・キュウべぇは合理的すぎてﾀﾞｰｸｷｬﾗに見られている(QB因為行為過於合理而被看成黑暗角色) ・キュウべぇは最後までキュウべぇ(QB到故事的最後都是QB ) ・まどかはそろそろ変身する(小圓快擺脫廢怯了) ・魔女に忠実な使い魔は1,2話に出てくるやつぐらい (對魔女忠誠的使魔也就只有第一, 二話登場的那幾隻) by enfis ・一期だけで風呂敷を畳むつもり (只有準備作一期的梗)-–どうやら二期が無さそうなのが残念だ (看來應該沒有第二季了，真可惜~) 引用： 島民(ID:f1uY.2/o)的推測：(轉自Komica)這套新番應該分四部分(本作原名Magica Quartet魔力的四部曲?)第一部以學姐的死(1-4)作序 (所以OP窗上的雨是橙色?) 以小圓忘記過去的悲痛作開始(浮士德被”忘泉”淋浴)第一話中小圓被床上起來是指浮士德在忘卻以往的事之後起來在一個“嫵媚的地方”醒来然後小圓遇上學姐，學姐的死令小圓嘗試以生存為人生目標 這部學姐代表太陽，小圓代表浮士德因為太陽的刺眼(學姐的死)令浮士德(小圓)欣賞大地(象徵生命)(浮士德II 第一、二幕) 目前的是第二部以沙也加為主線(所以OP窗上的雨是藍色?)沙也加契約使右手康復結果右手被綠毛NTR最終沙也加壞掉 中間加插的紅毛(估計下話領便當)大概代表被Gretchen所殺的母親 這部右手代表浮士德，在魔鬼的幫助下康復綠毛代表與浮士德幽會的魔女沙也加甘願成為喪屍所指的大概就是浮士德中Gretchen精神失常，無意逃走吧(浮士德I)第三部大概會是女巫之夜的開始在此黑毛應該會表演穿越時空(超期待的(浮士德II 第二幕) 第四部分我就不猜了，而且也不知道會不會這樣分 資料自WIKI 引用： 新的死亡順序說─ 第六畫出現的偽DDR「dog drug reinforcement」（藥物強化犬）對照第三話死亡警告(?)的Caution圖發現相同點了嗎?第三話死亡警告圖右下角插著針筒的犬(狗)正好跟DDR的名字「藥物強化犬」相同意思死亡警告圖線索=左邊(沙耶加) +中間(麻美)+右邊(杏子) 而且警告圖裏面，中央人物頭被砍下來(同麻美)，於是可以推測接下來可能死狀是左邊(沙耶加) = 被砍頭，或者穿肚(正好沙耶加變身後靈核在肚子上)右邊(杏子) = 被砍頭，或者被燒死(燒死的話靈核大概也…)(因為另外兩人都是衣服的顏色確定是誰的，而右邊卻是以膚色，灰暗的衣服代表被燒過?)(眾：轉得好硬w) 接著我們看下一張圖：由警告圖我們可以知道：畫面中的人物順序代表：左邊(沙耶加)+中間(麻美)+右邊(杏子) 注意上一張圖的順序，對照跳舞機機型的號碼，注意到了嘛?機型順序(面對螢幕)： 2 1 3這順序另人想到敏感的死亡順序呢(笑) 我把順序並在一起大家比較好懂~ ②左邊(沙耶加)+①中間(麻美)+③右邊(杏子)這恐怕就是死亡順序了….(抖 之後的clear分數(2513940)跟破關畫面裡的貓還是謎團就是了…clear分數跟這張圖是否有關係呢? 引用： 一切都是惡魔的策略假設說─ 既然一般的人類看不見魔女，那到底是誰開始知道需要魔法少女簽約對抗魔女呢?這樣的系統是誰做出來的?是誰設計的? 用這種想法去思考的話 魔女之類是不是根本就不存在?惡魔想要人的靈魂，但是因為人心太過封閉/堅固，沒辦法取得靈魂惡魔心想 以前用邪惡的誘惑引誘人類的靈魂，這種被強烈抵抗的事蹟實在太多了 於是惡魔這樣考慮著：不要明顯地使用惡的誘惑(會有反彈/抵抗)，而是以慾望之罪讓人類的心出現空隙 那就是「不管怎麼樣的願望都能幫你實現」，但是這仍然失敗了願望雖然是實現了，給我們靈魂的人類卻立場不堅，不是心甘情願(?)站在我們(惡魔)這方 所以惡魔很苦惱，一直思考著該怎麼做 「增加製造出其他的敵人，給予『把靈魂給我方的人類』力量，幫他們加上『正義的使者』的光環(魅力)會怎麼樣呢?」也就根據這點，齒輪開始大幅地轉動了(開始有很多人心甘情願把靈魂交給惡魔) 引用： 大雄的魔界大冒險假設說(のび太の魔界大冒険)─ 第一話比較版圖：*夢の中で会った、ような･････*→ 開頭都在荒涼的異世界(?)與巨大的敵人對決，同樣在崖邊望向巨大魔法力的構圖十分相似→ OP結束後，剛剛的景象全是夢境，這兩者是相同的→ 焰知道他們即將面對的悲慘未來，回到過去阻止小圓成為魔法少女哆啦A夢與大雄回到過去阻止過去的自己打開惡魔的盒子回到過去改變未來的結構相同→ 老師剛好說到”荷包蛋是全熟好還是半熟好?(下略w)”，而哆啦A夢跟大雄早餐剛好也是吃荷包蛋XD→ 都有個長得帥/漂亮，頭腦聰明，運動神經出色的優等生來否定(?)主角→ 跟大家聚在一起聊夢的內容，卻被當成笨蛋→ 但是，夢中看到的東西在現實世界也存在→ 當天晚上(?)，主角的周遭發生異變，同樣地都有一方被虐待(被欺負?)逃來求救→ 有了進入魔法世界的新體驗後，主角們又回到日常生活，而回到日常生活的時機(?)到此都相同 第二話比較版圖：*それはとっても嬉しいなって*→ 魔法世界的生物(?)一般的人是看不見的→ 兩者同時邊吃點心喝紅茶邊說明魔法世界，而時間的經過同樣到了傍晚→ 對魔法世界很在意的主角，首先先自己設計了一些構想。切入點相同→ 惡魔開始侵襲日常生活，但是卻沒有任何人查覺到變化/存在→ 魔法少女出現→ 棒子→ 棒子被魔法改良(?)→ 同樣都有巨大化的武器 第三話比較版圖：*もう何も恐くない*→ 一切的開端同樣源自於交通事故→ 真的願意跟我一起戰鬥嗎?(流出高興的眼淚)，之後沒多久，主角的臉因變化而改變(顏藝?驚嚇?)→ 主角要被吃掉了(但是哆啦A夢沒成功)美夜子的母親/麻美死掉時，紅茶杯破掉的表現手法相同ed畫面表現手法類似第四話比較版圖：*奇跡も、魔法も、あるんだよ*→ 同樣以主角們的素質勸誘他門進入戰鬥的舞台，但都因為恐懼戰鬥的心不參加，淫獸(喂)背對著離去。但是最後還是參戰了(兩者劇情展開完全相同)→ (用魔法把房間變乾淨─左)→ 麻美不在的房間…嗚嗚(下略)(眾：喂)→ 兩者同時有”現代醫學辦不到”的台詞，而為了做到這件事，與惡魔簽下契約→ 在電視中看見魔法少女的主角→ 在主角有難，颯爽登場（","categories":[],"tags":[{"name":"ACG","slug":"ACG","permalink":"https://www.hee.ink/tags/ACG/"}],"author":"天使の翼"}],"categories":[],"tags":[{"name":"教程","slug":"教程","permalink":"https://www.hee.ink/tags/%E6%95%99%E7%A8%8B/"},{"name":"ACG","slug":"ACG","permalink":"https://www.hee.ink/tags/ACG/"}]}