{"meta":{"title":"ZeroSimple的小站","subtitle":"日常摸鱼的蒟蒻","description":"ZeroSimple的摸鱼小站","author":"ZeroSimple","url":"https://www.hee.ink","root":"/"},"posts":[{"tags":[],"title":"浅谈2018年国内安卓手机生态","date":"2018/12/31","text":"2018年就要画上句号了。有人说，这是极不平常的一年，因为老天对世人太不公了，竟招了这么多创造者或是伟人回去。 但对于国内安卓生态的发展，2018是极具革命性的一年。 2018，国内安卓设备百花齐放，在创新路上披荆斩棘，创新领跑世界。 2018，统一推送联盟取得巨大进展，2019年就将开始全面使用。 2018，绿色公约取得部分厂商和开发者支持，后台纯净和更完善的隐私保护策略离Android用户越来越近。 2018，中国厂商的设备首次进入Google的Android Pie的Beta测试计划。 2018，随着Project Terble的推广，以华为为首的中国厂商，升级Android底层积极而迅速。 2018，Android 9更新引入了更完善的后台机制，更好地从底层制约了部分国内毒瘤应用的流氓行为。 2018，Google宣布将禁止TargetSDK版本低于26的应用在Google Play Store发布更新，腾讯及阿里的主流应用如微信（目前仅有Beta版升级）、QQ（Play商店版）、支付宝和淘宝等应用，都已将TargetSDK Version升级为26，达成了后台纯净。 2018年是手机市场大洗牌的一年。国内智能机市场逐渐饱和，4G带来的换机浪潮也已结束，5G时代即将来临。随着相关技术的成熟，手机的耐用程度大大提升，用户的换季周期增长。在这样失落的一年里，金立倒下了，锤子快凉了，中兴也受重创，美图这个小众品牌也被收购。 但在这个多难的2018，华为无疑是一个响亮的名字。尽管华为的营销手段和处事态度遭到部分用户的唾弃，但不能否定的是，华为是国内最具实力、最能创新也最值得尊敬的一家厂商。今年Q3季度，华为手机的出货量首次超越Apple，成为世界上第二大的手机厂商。 如今，华为已经不再是那个拿着单反样张做广告者。如你所见，华为成为一个创新者和引领者——华为P20 Pro已经在DxO霸榜多时。其优秀的夜间拍摄模式展示了华为高超的软实力。华为被吐槽多时的GPU性能也得到了改善。华为的GPU Turbo大幅提升了手机的游戏性能，可谓是今年最震撼我的新技术。海思麒麟980这颗Soc，领先同期竞争对手高通的骁龙845（不过似乎略微落后于现在最新的骁龙855），扬眉吐气。 OPPO和vivo两兄弟，也在2018跳入了创新的圈子，分别重启和开创Find和Nex两个高端产品线，核心技术令人惊讶。 对于安卓的玩家们来说，“Android By Google”开发无疑是一个常识，但由于特殊国情，谷歌的服务在大陆完全无法使用。这使本来就管理较为宽松的安卓系统在大陆显得更加混乱——没有了统一的标准制定者。 Google服务主要带来以下功能：统一的经过严格审核管理的应用市场；完善的云服务和自动备份，能够自动同步你的通讯录、短信、通话记录、应用、相册、邮件、手机找回和账户密码自动填充等；统一的消息推送，能使不在后台常驻的应用及时推送消息，省电而便捷；归属地显示、骚扰电话标记、垃圾短信拦截及短信验证码复制；Google Assistant语音助手及其衍生产品；Google Feed资讯流等。 这些重要的功能在国内无法使用的现状促生了国内深度定制ROM的出现。小米MIUI以其较为完善的云服务和细节体验闻名，华为EMUI则以18个月不卡顿为核心卖点。但不得不说，搭载完整谷歌服务的原生安卓手机在英语环境下的体验是优于国内定制ROM的，因为更加简洁纯净。 2018年国内厂商的Android底层升级更加迅速，Project Treble的引入使厂商更快适配新系统，国内手机也不再是一次性买卖——华为、小米、一加等厂商已经为旗下旗舰手机升级到了最新的Android 9.0。这些国内深度定制的ROM在大陆通常比原生Android易用。 国内没有统一的推送服务，所以厂商们纷纷推出自己的推送接口，如小米MiPush，华为推送等。厂商们的构想很美好，但是由于这些推送端口的局限性，大多数开发者弃之不用，转而研究后台常驻的方法——因为支持推送的手机为少数，而社交软件必须保证所有用户及时收到推送；再者，适配厂商的接口也需要时间和精力。 后台常驻的代表如QQ、微信、淘宝等，这种方式确实能及时给用户推送新消息，但是使设备的续航大大下降。国内应用甚至发明了后台播放空音频文件保活、激活设备管理员权限、接收系统广播自动唤醒以及让人深恶痛绝的交叉唤醒。 交叉唤醒指在其他应用启动时，自动启动一大串的其他应用，一大家子不请自来，其乐融融。各大厂商，就算是老冤家干起这事儿来也是称兄道弟，通常一个应用启动时能唤醒手机中数家公司的应用。由于苹果iCloud服务的正常运营和严格管理，在后台管理及推送方面，iPhone的体验优于Android（即使是国内深度定制ROM）。 谷歌为了防止这事儿，限制了应用的权限，收紧了唤醒机制的管理，后台机制变得更加严格。在2018年，Google宣布将禁止TargetSDK版本低于26的应用在Google Play Store发布更新。Target SDK Version指应用目标运行的设备的版本，Google在API26上做出了较为严格的后台限制。同时，在统一推送联盟和绿色公约的推动下，国内的应用消息统一推送成为可能，统一推送的实现将给Android用户们带来更好的体验。 在2018年下半年，阿里所有在Google Play Store上架的应用都把目标版本升级到了API26，实现了后台纯净。阿里系App本遭广大用户诟病，淘宝这个国民级App一度被调侃为终极跑分神器——糟糕的优化使其在最高端的安卓旗舰机上也无法流畅使用。在最近几次更新之后，淘宝变得渐渐流畅了，支付宝冷启动也变快了。 阿里无疑是国内在新标准新技术方面的领军人物。支付宝早早适配了Shortcut功能——类似Apple的3D Touch，只不过是借助长按应用图标就能直达部分软件功能。使用此功能快速打开支付宝付款码或扫一扫功能，会略过启动页，带来极其流畅的体验。可惜的是，这个功能在不少国内深度定制ROM上被阉割，不过用户可以通过安装第三方桌面启动器来体验。 值得一提的是API26引入的自适应图标功能。一直以来，Android应用的图标缺乏统一的规范，iOS等系统统一的图标风格让人羡慕。图标设计风格和遮罩形状的统一，无疑是强迫症患者的福音，用户的使用体验也有了较大的提升。支付宝也适配了自适应图标功能，即用户可以自由地决定图标遮罩的形状，带来了更加美观的启动器Icon（这个功能在深度定制ROM上仍惨遭阉割）。 本来我打算在这里指责一番腾讯，没想到就在我写文前不久，微信Android v7.0.0的更新适配了自适应图标。对Google标准的跟进也是今年国内Android生态的极大改善。不过，国内大量App依然使用传统的图标（尤其是外包公司的作品），我希望国内开发者能积极跟进Google的新标准，毕竟着不是什么难事。就以自适应图标的适配来说，开发者只需要在Android Studio左侧项目目录右击-New-Image Asset就可以启动Google内置的图标设计器，适配全程耗时不到三分钟（作为Android开发者的我亲身测试）。 今年国内Android应用的流畅程度有了改善，手机淘宝在中端手机上也能流畅运行了，但是不知为什么安装包依然在不断加大（我没仔细看，感兴趣的朋友可以反编译看看）。不少国内深度定制ROM也增添了预加载常用应用的功能，使应用启动更快、使用更加流畅。 这一年以来，国内Android生态无疑是改善了。但有一点我很担忧，就是App设计的进一步iOS化、去Material Design化和大量的增添广告。一直以来，国内的开发者以iOS为原型进行UI设计，只有极少数的开发者针对不同系统设计不同UI。而这些良心的少数开发者，大多在2018年放弃了Material Design，全面拥抱Apple标准。知乎前期Android版的UI设计堪称典范，完美诠释了Google的Material Design，操作逻辑简单易懂，设计清新美观。而今天，MD设计已经在知乎上消失的无影无踪了。哔哩哔哩、酷安等App今年也经历了这种变化。 出现这种情况的原因是多方面的，比如开发设计成本、用户学习难度。在好多年前，微信曾经有过基于Holo Design的版本，但遭到了大量用户的吐槽。这种吐槽大多是由于当年Android设计的不成熟引起的。依我看来，今天的Material Design已是值得各大厂商推广了。我希望大厂们能够有一套独立的Android UI设计，毕竟，不同的系统本该就有不同的体验；再者，有能力推广标准的也只有大厂们了。 那么，我的总结就到这里结束了，毕竟时间有限。感谢这一年来广大开发者、Android爱好者以及每个用户做出的努力，希望国内Android生态的明天更加美好。 本文授权IT之家、酷安发布，如需转载请联系Email：hqf0327g@gmail.com，私自转载原作者将追究责任。","permalink":"https://www.hee.ink/2018/12/31/浅谈2018年国内安卓手机生态/","photos":[]},{"tags":[],"title":"Flash——早该覆灭的王朝","date":"2018/07/17","text":"Flash Player是一个耳熟能详的名字。1997年问世Flash陪伴着一代网民的成长，这其中就包括了00后的我。Flash由著名公司Adobe运营并开发，内置了脚本语言AS，由于其使用矢量图形实现数据最小化，在低速互联网时代成为了开发互联网应用程序、视频音频的绝佳工具，甚至沿用至今。 我较早接触PC和互联网，也有着开启电脑先要“本地连接”的经历，更清晰地记得Office 2000中那摇头晃脑的回形针（Office Assistant）以及瑞星小狮子。 为什么我们要弃用Flash？ 于官方宣传全球十几亿用户的光环下，2010年4月Apple前CEO史蒂夫·乔布斯发表了一封著名的公开信，批评了Flash的安全性和稳定性，并指出不会在任何Apple的移动端设备上支持Flash。在此之前的二月，Adobe因为没能修复Flash已知漏洞一年而道歉。 由于Flash数以百计的安全漏洞，昔日的王者竟成了骇客的温床——2009年Adobe公司亲自承认“Flash Player所列出的所有互联网技术（包括网络插件和浏览器）的漏洞数量排名第二”。著名安全公司卡巴斯基也于2012年的报告指出“Flash Player漏洞使网络犯罪分子能够绕过集成到应用程序中的安全系统。”随后曝光的漏洞“Magnitude”又能轻易地让骇客远程执行代码。 可以说安全性是Flash最大的问题，然而弃用Flash的理由远不止这一点——Flash的隐私性同样被人诟病。 Flash在计算机本地保存数据，由于站点可以通过Flash cookies检索其他站点保存于本地的用户信息，例如身份验证信息、游戏高分或保存的游戏、基于服务器的会话标识、站点首选项、已保存的工作或临时文件，从而建立用户档案，甚至出售用户数据。如今在Chrome等著名浏览器的最新版本中Cookies的本地储存功能已被禁用。 随着比Flash更优秀的后来者HTML5标准制定的完成，Flash的处境显得尴尬透顶。根据Wikipedia的释义：“HTML5是HTML最新的修订版本，由万维网联盟（W3C）于2014年10月完成标准制定。目标是取代1999年所制定的HTML 4.01和XHTML 1.0标准，以期能在互联网应用迅速发展的时候，使网络标准达到匹配当代的网络需求。广义论及HTML5时，实际指的是包括HTML、CSS和JavaScript在内的一套技术组合。它希望能够减少网页浏览器对于需要插件的丰富性网络应用服务（Plug-in-Based Rich Internet Application，RIA），例如：Adobe Flash、Microsoft Silverlight与OracleJavaFX的需求，并且提供更多能有效加强网络应用的标准集。” 用浅显易懂的话来概括，即“HTML5是一种功能上能代替Flash，性能、安全性及隐私性均大幅超过Flash的标准”。 最近Flash发生了什么？为什么重新被推上风口？ 2018年2月28日，上海剑圣网络科技有限公司（即2144游戏）宣布获得了Adobe Flash Player在中国大陆地区的独家代理发行权。中国大陆的用户在访问Adobe Flash Player的下载页面时，将强制跳转到2144域名下的下载页面，同时会默认捆绑2144游戏中心，且取消捆绑安装的复选框位置隐蔽。近日网友发现大陆定制版Flash用户协议区域比Adobe公司的原版下载页面多了一条的《Helper Service服务协议》。 该协议的其中一部分写道： 2.2只要用户开始使用程序，即表示用户无条件的接受了本协议的相关规定并愿意受其约束，否则用户无权使用程序。 3.1这款程序是重橙提供的一款为用户更好的使用Adobe Flash Player的必要程序，没有程序，Adobe Flash Player无法运行。其功能包括但不限于辅助Adobe Flash Player的更新升级等。 3.3用户同意本协议，使用程序，表示重橙已经明确告知用户，随着Adobe Flash Player版本的更新，程序将会自动静默安装新版本的Adobe Flash Player。 5.1用户同意本协议，使用程序，表示重橙已经明确告知用户，在用户使用Adobe Flash Player过程中，重橙可能会通过该程序收集用户的上网信息，以便为用户提供更好的产品和/或服务并改善用户体验。 5.2重橙承诺采取必要措施保护用户存放在服务器上的个人数据及收集到的用户上网信息的安全。除本协议约定的除外情况，重橙保证不对外公开或向第三方提供、公开或者共享用户的数据及上网信息。 5.3以下情况，重橙对用户的个人数据及上网信息的披露将不视为违约，具体包括： （1）重橙已经获得用户的明确授权； （2）根据有关法律法规的要求，重橙负有披露义务的； （3）司法机关或行政机关基于法定程序要求重橙提供的； （4）为维护社会公共利益及重橙合法权益，在合理范围内进行的披露； （5）重橙可能会和第三方合作向用户提供相关网络服务或者其数据收集工具用以完善自身服务，在此情况下，如该第三方愿意承担与重橙相等的隐私保护责任的，则重橙可在合理范围内对用户信息进行披露； （6）其他必须披露用户数据和上网信息的情况。5.4尽管重橙已经为用户的隐私权做了极大努力，仍然不能保证现有的安全措施使用户数据等不受任何形式的损失。用户对此情况充分知情，且不会因此追究重橙的法律责任。 经过简单的阅读就可以轻易得知，该公司按协议收集用户数据时、或是不慎将用户隐私泄露后也不愿负任何法律责任。 按Wikipedia的记录，中国大陆用户最后一个能正常安装使用的ActiveX和NPAPI版本是28.0.0.137，之后的版本均带有2144的进程“FlashHelperService.exe”，且无法关闭，如果关闭进程则Flash内容就会拒绝显示。Google Chrome自带的PPAPI版本不受影响。从Flash Player 30起，中国大陆的ActiveX、NPAPI和Win10上的PPAPI版本开始实行锁区策略，分成了全球版和大陆版两个独立的版本，即大陆用户无法安装运行全球版，中国大陆以外的用户无法安装运行大陆版。 在此事被曝光不久后中国定制版的Flash立即修改了用户协议，可谓是做贼心虚。除此收集隐私以外，经过笔者的实际测试，中国定制版的Flash时不时会给你于桌面右下角推送广告。 当然对此IT之家也给出了相应的解决方案，我不敢对此妄加评论（原因参照知乎），但是我只想说一下这件事情和一家名叫“苏州思杰马克丁”的公司有着千丝万缕的关系，感兴趣的朋友可以在知乎、Google上阅读相关内容。 弃用Flash的道路依然艰险 正是由于Flash的种种缺点，正是由于HTML5的种种优点，处于糟糕的国内互联网生态下，HTML5始终得不到全面推广，Flash依然广泛使用。Flash是网页牛皮藓们——贴片小广告的最爱，同时仍是少数几个国内视频网站的盈利大杀器。当你屏蔽了Flash，你也许会感觉整个世界都清净了。 每当我想要看CCTV5直播时，打开央视电视直播就必须启用Flash；打开教育局官网查询比赛程序，却发现网页内容七零八落——同是没启用Flash。在国际上极度打击Flash，Google、Microsoft、Facebook和Apple等强强联手推广HTML5时，国内生态让人心寒。多数国产主流浏览器仍默认启用Flash插件，流氓软件横行，网络安全更是无处谈起。同国内的Android生态一样，Windows生态也很糟糕，Flash仍是主流。在此特别点名表扬哔哩哔哩、微博（手机网页端）等国内优秀的HTML5站点，也希望这些站点能高举新技术好生态的旗帜，给中国网民更好的互联网环境。 另外值得一提的是，我国落后的信息技术教育助长了互联网流氓的嚣张气焰。作为一名准高中生，我发现我们的高中重要课程“技术”依然教授着古老的“Flash CS3”这种被淘汰了不知道多少年的课程。如同我当年学习信息奥赛时使用的、至今仍被传授给广大学生的古董级语言Pascal（不过即将被取缔），我不希望10后、20后继续学习诸如这类出现在父母大学课本里的古老“高新技术”。 22年了，Flash。你的时代，你的王朝已经结束了。 你永远活在我们的记忆里，或是那一个个网页小游戏，或是厌恶至极的网页广告都将会成为我们津津乐道的往事。 我希望和你说再见。 本文作者ZeroSimple，授权IT之家、酷安发表，如需转载请联系Email：hqf0327g@gmail.com，私自转载原作者将追究责任。https://hexo.io/docs/deployment.html)","permalink":"https://www.hee.ink/2018/07/17/Flash——早该覆灭的王朝/","photos":[]}]}